{"_id":{"$oid":"66f047ca17ea6cfda7afbbda"},"likes":0,"title":"Mediterranean Herb Dip","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/651409-556x370.png","instructions":"<ol><li>Put the sun dried tomatoes, roasted red peppers and garlic in a food processor. Pulse until finely chopped.</li><li>Add the feta cheese, cream cheese, Worcestershire sauce and Tabasco. Pulse until combined.</li><li>Add parsley and basil. Pulse again until combined.</li><li>**Keep refrigerated.</li></ol>","spoonacularId":651409,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:37:30.432Z"},"__v":0}
{"_id":{"$oid":"66f047ca17ea6cfda7afbbdb"},"likes":0,"title":"Pumpkin Ravioli With Browned Butter Sage Sauce","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/657377-556x370.jpg","instructions":"Make dough by mixing egg & sour cream in a bowl, mix in flour until a shaggy rough dough forms, then add splash of milk to make it come together.\nBegin mixing & kneading with your hands on a counter top, adding flour until the dough is no longer overly sticky and can be rolled out without tearing or breaking.\nMix all ingredients of the filling together.\nRoll out dough to a long thin rectangle.\nAlong one side of the rectangle, place small scoops of the filling about 1-2 inches apart in a row.\nWet the dough with the water around each scoop of filling.\nTake the opposite side of the rectangular dough and fold it over on top of the scoops, then removing as much air from each ravioli as possible, cut into squares or rounds, ensuring each ravioli is sealed thoroughly.\nRepeat with the rest of the ravioli.\nCook ravioli in small batches in boiling water for 3 minutes, flip over and boil for another 3 minutes.\nMeanwhile, heat a skillet over medium low heat and add butter.\nKeep a close eye on the butter, skimming the foam off the top and cooking until it's a golden brown color.\nAdd sage and stir.\nAdd boiled ravioli and cook for a few minutes per side.\nServe, topping with a drizzle of the browned butter sauce over top and enjoy!","spoonacularId":657377,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:37:30.433Z"},"__v":0}
{"_id":{"$oid":"66f047ca17ea6cfda7afbbdc"},"likes":0,"title":"Bibimbab (Korean Rice w Vegetables & Beef)","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/634965-556x370.jpg","instructions":"<ol><li>1.Cook rice according to package directions.</li><li>2.Cut vegetables into matchstick pieces and set aside for sauteing.</li><li>3.In a large non-stick pan/skillet, bring 2 cups water to a boil. Add spinach and cook, stirring constantly until wilted; drain. When cool enough to handle, squeeze spinach dry into a ball.</li><li>4.Wipe out skillet; heat 1 tsp olive oil over medium-high. Add carrots and cook until soft, 3 minutes. Add garlic and cook until fragrant or semi-browned, 1 minute. Add cucumber slices mixed with gochugaru (red pepper flakes). Combine spinach and soy sauce; set aside until serving.</li><li>5.Add thinly sliced beef to non-stick pan and heat until browned. Wipe down with napkin.</li><li>6.Heat 1 tsp olive oil in non-stick pan over medium-high. Add eggs and cook until whites are set and yolks are still runny, about 5 minutes.</li><li>7.Divide rice among four bowls; top with vegetables and eggs. Drizzle each with sesame oil, sprinkle with sesame seeds. Top with gochujang (red pepper paste) or Sriracha sauce as substitute.</li><li>*Bibimbab and its main ingredients (usually rice and vegetables) can be chosen at one's preference. This is the main reason why bibimbab is so appealing; it suits vegetarians, dieters, health-conscience eaters, and even meat-lovers, who are more than welcome to add beef to their liking. For us, since we usually have rice available to eat at all times, we simply slice up any available vegetables or lettuce leaf varieties in the fridge for an \"instant\" and very satisfying bibimbab meal. So feel free to deviate from the original recipe!</li></ol>","spoonacularId":634965,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:37:30.433Z"},"__v":0}
{"_id":{"$oid":"66f047ca17ea6cfda7afbbdd"},"likes":0,"title":"Garlicky Kale","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/644387-556x370.jpg","instructions":"<ol><li>Heat the olive oil in a large pot over medium heat.</li><li>Add the kale and cover.</li><li>Stir occasionally until the volume of the kale is reduced by half. Uncover. Add garlic and basalmic.</li><li>Allow to cook for about another 30 seconds or so, mixing well so that the garlic and vinegar are well distributed.</li><li>Serve hot.</li></ol>","spoonacularId":644387,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:37:30.434Z"},"__v":0}
{"_id":{"$oid":"66f047ca17ea6cfda7afbbde"},"likes":0,"title":"Peppery Absorption-Cooked Red-Wine Capellini","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/655706-556x370.jpg","instructions":"1.Preheat the oven to 375F. Break the capellini into approximately 3-inch lengths. Spread the pasta on a baking sheet, slide it into the oven, and toast, tossing occasionally with tongs, until golden brown, about 12 minutes.\n2.Meanwhile, heat the olive oil in a large pot (at least 5 1/2 quarts) with a lid over medium heat. Add the onion, garlic, and a pinch of salt and cook, allowing them only to soften and grow aromatic but not brown, about 5 minutes. Increase the heat to medium-high and add the zucchini and another pinch of salt. Saut until the zucchini is well browned, about 5 more minutes.\n3.Place the noodles on top of the zucchini mixture. Layer the asparagus and 1 cup of the cherry tomatoes on top of that and sprinkle in the smoked paprika, black pepper, cayenne pepper, oregano, and rosemary. Pour the red wine and  cup of water over the top. Toss as best you can with tongs; it will be hard at first because the noodles are stiff. Return the heat to medium and cover the pot.\n4.Every 3 minutes, remove the lid and toss the pasta. The total cooking time will be 8 to 12 minutes. Toward the end, taste a noodle each time you remove the lid to see if it is done. If not, and there isnt any moisture left on the bottom of the pot, add a bit more wine or water, about 1/3 cup.\n5.When the noodles are done to your liking, taste and make any final adjustments to the seasoning. Transfer to serving bowls. Garnish with the remaining 1/2 cup cherry tomatoes, the parsley, and another grind of black pepper. Serve immediately.","spoonacularId":655706,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:37:30.434Z"},"__v":0}
{"_id":{"$oid":"66f049ae2e061c0a30605239"},"likes":0,"title":"Stuffed Chicken Breast","readyInMinutes":27,"servings":4,"image":"https://img.spoonacular.com/recipes/1003670-556x370.jpg","instructions":"Wash and Pat dry chicken breast.\nCut chicken lengthwise, careful not to cut all the way through.\nStuff chicken breast with cream cheese and onion.\nFirmly press the chicken breast closed.\nSpray chicken with olive oil based cooking spray.\nRib chicken breast with your favorite chicken seasonings.","spoonacularId":1003670,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:45:34.411Z"},"__v":0}
{"_id":{"$oid":"66f049ae2e061c0a3060523a"},"likes":0,"title":"Shrimp & Crab Egg Rolls","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/659906-556x370.jpg","instructions":"8 oz. bean sprouts, washed n patted dry\n2 carrots, shredded or grated\n1 lb imitation crab (or the real thing)\n1/2 lb medium sized shrimp, shelled & deveined\n2 garlic cloves, finely minced (1 tbsp garlic powder)\n1 tsp brown sugar\n2 green onions, finely chopped (green part only)\n20 (6 or 8-inch) egg roll wrappers\n1 beaten egg, for egg wash\nvegetable oil, for frying\n1 tsp salt and ground pepper\n1 cup sweet chili sauce","spoonacularId":659906,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:45:34.412Z"},"__v":0}
{"_id":{"$oid":"66f049ae2e061c0a3060523b"},"likes":0,"title":"Almond Coffee Cupcakes with Kahlua Liqueur","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/632115-556x370.jpg","instructions":"<ol><li>Preheat oven to 180C (335F). Place the flour, sugar, almond meal, coffee, butter and egg whites in a bowl and mix well combine with a hand whisk.</li><li>Spoon mixture into 6 lightly greased or use cooking spray on medium size muffin pan or 12 mini muffin pan and bake for 20-25 minutes or until cooked when tested with a skewer.</li><li>Drizzle with the liqueur (about 1/2 tablespoon on each cake) and set aside for 2 minutes before turning out on a wire rack to cool.</li><li>Decorate with chocolate icing on top (I used Wiltion chocolate icing) or just dust with some icing sugar.</li><li>You can serve them warm or store it in an airtight container for 2-3 days.</li></ol>","spoonacularId":632115,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:45:34.413Z"},"__v":0}
{"_id":{"$oid":"66f049ae2e061c0a3060523c"},"likes":0,"title":"Brown Rice Vegetable Pulao","readyInMinutes":45,"servings":3,"image":"https://img.spoonacular.com/recipes/636295-556x370.jpg","instructions":"<ol><li>Heat 2 tbsp of oil in a frying pan over medium heat. Add the chopped onion and saute well till softened.</li><li>Add the celery, carrot, chilli, spring onions and almonds. Stir-fry for 2 minutes or until the vegetables are done. Transfer to a bowl and set aside.</li><li>Add the remaining oil to the pan. Stir in the rice and lentils. Cook over medium heat, stirring for 2 minutes.</li><li>Reduce the heat and stir in the veg stock and orange juice. Season with salt and pepper.</li><li>Mix the already cooked vegetables to the pan. Toss with the rice for a few minutes until heated through.</li><li>Transfer to a warmed dish, garnish with leaves and serve.</li></ol>","spoonacularId":636295,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:45:34.414Z"},"__v":0}
{"_id":{"$oid":"66f049ae2e061c0a3060523d"},"likes":0,"title":"Peppermint Brookie Pies - gluten free, dairy free","readyInMinutes":45,"servings":16,"image":"https://img.spoonacular.com/recipes/655668-556x370.jpg","instructions":"<ol><li>Preheat oven to 375 F.</li><li>For the pies:</li><li>Fill a medium saucepan (relatively the same size as the bowl) about 1/3 full with water and set over medium heat.</li><li>In a medium glass bowl, combine the bittersweet chocolate, semi-sweet chocolate and shortening.</li><li>When the water simmers, place the bowl of chocolate and shortening over the simmering water and lower the heat. Make sure your bowl does not touch the simmering water. The more you stir the shinier your cookies will be.</li><li>When the chocolate and shortening has melted, remove the bowl from the heat; stir to assure it's completely mixed. Set aside to cool a few minutes.</li><li>Meanwhile, in another bowl, whisk together the sugar, eggs, vanilla paste, and espresso. Set aside.</li><li>In another bowl, sift together the flour, cocoa powder, baking powder and salt. Set aside.</li><li>Whisk the melted chocolate into the sugar/egg mixture.</li><li>Add the flour mixture, whisk. Only whisk until blended, over-mixing can affect the texture of the pies.</li><li>Line 2 baking sheets with parchment paper, no need to grease the paper.</li><li>Drop a heaping tablespoon of batter (keeping the shapes as round as possible) onto the baking sheets. You are aiming for rounds that are about 2 inches in diameter. Take care to leave some room (about 2 inches) between each one to allow for spreading that will occur as they bake.</li><li>Bake for 6 to 8 minutes.</li><li>Leave in the oven an additional minute if they seem under baked. The cookie will have a brownie like crackling surface, and will feel soft, when ready.</li><li>Allow them to cool for about 10 minutes before gently lifting them off the baking sheet and onto a flat surface for piping the filling.</li><li>For the Filling:</li><li>Combine 1 1/4 cups sugar and the water in a small saucepan.</li><li>Heat over medium heat with a candy thermometer attached to the inside of the saucepan, and stir to dissolve. </li><li>When the mixture reaches 220 degrees F it is ready for the stand mixer.</li><li>Meanwhile, in a bowl of a stand mixer fitted with the whisk attachment, whisk the eggs on medium speed until it begins to look very foamy(about 3 minutes).</li><li>Avoiding the whisk, gradually add the remaining 2 tablespoons PLUS 1 teaspoon sugar. </li><li>Increase the speed to high and whip until soft white peaks are formed.</li><li>At this point check to see if your sugar has cooled. If it has cooled, turn heat back on to high until it comes back up to 220 degrees F just before adding to stand mixer.</li><li>When egg whites are at a soft peak stage resembling marshmallow fluff,slowly add the hot sugaralong the edge of the mixer avoiding the whisk.</li><li>Continue to whisk on high until the bowl has cooled, about 5 minutes.</li><li>Add peppermint extract, whisk another 30 seconds.</li><li>Refrigerate for 5 minutes before transferring to a piping bag with a plain tip attached or a large ziploc bag with one corner cut a 1/4 inch.</li><li>For Garnish:</li><li>Place candy canes between layers of wax paper, then sandwich between a dish towel.</li><li>Using a meat tenderizer, or the back of a dry measuring cup, pound the candy cane until broken up into very small pieces.</li><li>Make sure the candy cane is between wax paper first, otherwise, the candy cane will stick to the dish towel.</li><li>Assemble:</li><li>Turn the brookie cookies upside down, pipe about 2 tablespoons of filling onto half of the cookies.</li><li>Cover each filled cookie with a dry cookie, press down just enough so that filling adheres to the cookie.</li><li>Sprinkle crushed candy cane around the brookie pie edges.</li><li>Serve chilled or at room temperature.</li></ol>","spoonacularId":655668,"ingredients":[],"createdAt":{"$date":"2024-09-22T16:45:34.414Z"},"__v":0}
{"_id":{"$oid":"66f175088666590ba4635d6c"},"likes":0,"title":"Crock Pot Chicken Pot Pie","readyInMinutes":45,"servings":20,"image":"https://img.spoonacular.com/recipes/640862-556x370.jpg","instructions":"In Crock Pot, combine chicken breasts, potatoes, frozen vegetables, cream of chicken soup and mix well. Add additional salt and pepper if desired.\nCook on low for 6-8 hours until chicken is fully cooked. Use a sturdy spoon to break up the chicken after cooking. Preheat oven to 400. Prepare pie crusts. Spoon chicken filling into pie crust.\nTop with pie crust. Cut slits into the top crust to vent steam during baking. Cut excess crust from edges and pinch to seal.\nBrush with egg white or melted butter and bake for 20-30 minutes until crust is fully cooked and golden brown on top.\nAllow pies to cool for at least 10 minutes before cutting. Best served hot.","spoonacularId":640862,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:02:48.216Z"},"__v":0}
{"_id":{"$oid":"66f175088666590ba4635d6d"},"likes":0,"title":"Coconut Almond Cheesecake","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/639714-556x370.jpg","instructions":"For crust: Preheat oven to 350F. Wrap outside of 9-inch-diameter springform pan with 2 3/4-inch-high sides with foil.\nFinely grind cracker crumbs, coconut, almonds and sugar in food processor. Add butter; process until moist crumbs form. Press mixture onto bottom and 1 inch up sides of pan. Bake crust until set and beginning to brown, about 12 minutes. Cool. Reduce oven temperature to 325F.\nFor filling: Using electric mixer, beat cream cheese and sugar in large bowl until smooth. Add eggs 1 at a time, beating just until blended after each addition. Mix in coconut and extract . Fold in almonds. Transfer filling to crust. Bake until cake is puffed and no longer moves when pan is shaken, about 1 hour 15 minutes. Cool completely on rack.\nFor glaze: Combine 1 cup chocolate chips, cream and vanilla in small saucepan. Stir over medium-low heat until smooth. Cool until glaze begins to thicken but can still be poured, about 30 minutes. Pour glaze over cooled cake; spread evenly. Chill cake overnight.\nRun small knife around sides of cake to loosen. Release pan sides.","spoonacularId":639714,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:02:48.217Z"},"__v":0}
{"_id":{"$oid":"66f175088666590ba4635d6e"},"likes":0,"title":"Oh Pear Cocktail","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/653521-556x370.jpg","instructions":"<ol><li>Pour ingredients into shaker and fill with ice. Shake well for 30 seconds and strain into chilled cocktail glass. Garnish with a USA Red Bartlett pear wedge.</li></ol>","spoonacularId":653521,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:02:48.218Z"},"__v":0}
{"_id":{"$oid":"66f175088666590ba4635d6f"},"likes":0,"title":"Gambas Al Ajillo","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/644140-556x370.jpg","instructions":"<ol><li>In a saut pan over medium-high heat, add olive oil. When hot, add shrimp and seasonings, and saut until they are cooked halfway.</li><li>Add garlic, tomatoes, bacon and saut a bit longer. Add sherry and cook until reduced by half. Add butter and stir in.</li><li>Sprinkle with parsley and squeeze the lemon wedges over the shrimp. Serve with crusty bread and a crisp white wine like a Verdejo from Rueda or a bubbly Cava from Penedes.</li></ol>","spoonacularId":644140,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:02:48.219Z"},"__v":0}
{"_id":{"$oid":"66f175088666590ba4635d70"},"likes":0,"title":"Mixed Berry Yogurt with Almonds","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/652111-556x370.jpg","instructions":"<ol><li>You can put this together a variety of ways. It looks great layered in a glass cup or bowl.</li><li>Variations. This breakfast lends itself to endless variations. If this is for dessert and you want something more decadent, use a creamier vanilla yogurt or layer in a bit of maple syrup on top of the yogurt.  Any kind of nut will do (Toast them for maximum crunch and flavor). If you dont have berries on hand, this works well with just about any fruit.</li></ol>","spoonacularId":652111,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:02:48.22Z"},"__v":0}
{"_id":{"$oid":"66f1797954ef1326aef304f6"},"likes":0,"title":"Easy Chicken with White Wine Sauce","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/641912-556x370.jpg","instructions":"<ol><li>Heat the oil in a 10-inch skillet over medium heat.  Add the chicken and cook for 10 minutes or until well browned on both sides.  Remove the chicken from the skillet.</li><li>Add the shallot and thyme to the skillet and cook and stir for 30 seconds.  Stir in the wine and cook for 2 minutes or until the mixture is reduced by half.  Stir in the concentrated broth.  Return the chicken to the skillet.  Cook for 5 minutes or until the chicken is cooked through.</li></ol>","spoonacularId":641912,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:21:45.186Z"},"__v":0}
{"_id":{"$oid":"66f1797954ef1326aef304f7"},"likes":0,"title":"Watermelon, Kiwi, Apple and Frozen Banana Smoothie","readyInMinutes":45,"servings":3,"image":"https://img.spoonacular.com/recipes/665040-556x370.jpg","instructions":"<ol><li>Place all ingredients in the blender and blend until smooth. Pour mixture into glass and enjoy!</li></ol>","spoonacularId":665040,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:21:45.186Z"},"__v":0}
{"_id":{"$oid":"66f1797954ef1326aef304f8"},"likes":0,"title":"Strawberry and Chocolate Chip Panini","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/661741-556x370.jpg","instructions":"Open up the slices of sourdough bread\nBrush it wit some olive oil on either side\nAdd a layer of strawberries and chocolate chips\nPut it in the panini press!\nServe it hot with a side of fresh cut berries!","spoonacularId":661741,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:21:45.186Z"},"__v":0}
{"_id":{"$oid":"66f1797954ef1326aef304f9"},"likes":0,"title":"Chipotle Cheese Stuffed Black Bean Burgers with Avocado Creme","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/638744-556x370.jpg","instructions":"Add a swirl of olive oil to a skillet and add diced mushrooms and onions.\nSaute until softened then season with salt and pepper.\nAdd drained black beans to a medium bowl and press and mash with a fork.\nMix in mushrooms and onions then add egg and bread crumbs.\nFinally mix in cumin and chipotle chili powder.\nRoll and form into burger patties (sliders or full size).\nForm a indent in the center of each burger\nAdd a spoonful of cream cheese spread to the indent in the burgers and then form the burger over the cream cheese.\nHeat a skillet over medium heat, add a swirl of olive oil.\nAdd 2 burgers at a time and sear on each side until cooked and browned, about 4 minutes each side.\nIf you want to add sliced cheese on top, add now and cover skillet to steam and melt cheese.\nRemove to a plate, then cook remaining patties.\nFor the avocado creme, combine all ingredients in a food processor or blender, and mix until smooth. Taste and add more sour cream or lime juice if needed.\nTo plate, add each hot cooked burger to an open toasted bun. Top with lettuce and tomato (optional) and a hearty scoop of avocado creme and then top with bun.","spoonacularId":638744,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:21:45.186Z"},"__v":0}
{"_id":{"$oid":"66f1797954ef1326aef304fa"},"likes":0,"title":"Shrimp pasta with white wine tomato cream sauce","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/659988-556x370.jpg","instructions":"<ol><li>If you are using frozen shrimp, remove them from the fridge and allow to come to room temperature before using.</li><li>Bring a large pot of water to a boil and cook your pasta according to package directions. 1 or 2 minutes before your pasta is done cooking, ladle about 250ml / 1 cup of the cooking water into a cup.</li><li>In the meantime, heat the olive oil in a large frying pan over medium heat. Add the shallots and garlic, season with salt and pepper, and saut until soft and translucent, about 3 to 5 minutes.</li><li>Add the wine and stir.</li><li>Add the tomatoes and simmer until the wine has evaporated, about 5 minutes.</li><li>Drain the pasta and add it to the sauce, along with the shrimp and cream, and toss to combine. If you find the sauce is too thick, add a splash of the pasta water.</li><li>Add the coriander and serve immediately.</li><li>Find more recipes on my blog http://alalemon.com</li></ol>","spoonacularId":659988,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:21:45.187Z"},"__v":0}
{"_id":{"$oid":"66f17e70a1ab17454d0ed223"},"likes":1,"title":"Pesto & Yogurt Pasta","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/655806-556x370.jpg","instructions":"<ol><li>In a food processor, blend parsley, garlic, nuts and oil until smooth.  Mix in yogurt and cheese.  Season with salt and pepper.</li><li>Cook pasta in a large pot of boiling water, stirring occasionally until al dente.</li><li>Toss pasta and pesto sauce together in a large bowl.</li></ol>","spoonacularId":655806,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:42:56.804Z"},"__v":0}
{"_id":{"$oid":"66f17e70a1ab17454d0ed224"},"likes":0,"title":"All American Sloppy Joes","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/632071-556x370.jpg","instructions":"<ol><li>Heat the olive oil in a large skillet. Add in minced garlic, shallots, and green bell pepper.  Stir until fragrant and tender, about 3 minutes. Season it with salt and black pepper.</li><li>Add the ground beef to the vegetables. Stir and cook about 5 minutes, until the meat is no longer pink and fully cooked. Add tomato sauce, barbecue sauce, Worcestershire, and hot sauce into the skillet. Stir to combine. Simmer until thickened.</li><li>To serve, spoon and pile sloppy meat onto the toasted, buttered bun bottoms and cover with bun tops with your favourite side dish or pickles.</li></ol>","spoonacularId":632071,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:42:56.805Z"},"__v":0}
{"_id":{"$oid":"66f17e70a1ab17454d0ed225"},"likes":0,"title":"Gingerbread Mummies","readyInMinutes":45,"servings":18,"image":"https://img.spoonacular.com/recipes/644693-556x370.jpg","instructions":"In a bowl of an electric mixer, beat the butter until light and fluffy.\nIn a separate small bowl, whisk together the flour, baking powder, ground ginger, baking soda, cinnamon, cloves, nutmeg and salt. Set aside.\nAdd the sugar to the butter and beat until light and fluffy. Turn the mixer to low and mix in the molasses, egg and balsamic vinegar. Slowly add the dry ingredients to the bowl and continue mixing until thoroughly combined.\nCover and chill about 2 hours or until the dough is easy to handle.\nPreheat oven to 400 degrees.\nDivide the dough in half and turn out onto a lightly floured surface. Roll each half of the dough to 1/4\" thickness adding flour as needed, the dough is very sticky so use flour liberally to prevent your cutouts from sticking to the surface.\nUsing cookie cutters, cut dough into shapes and place on a baking sheet lined with parchment approximately 1\" apart.\nBake in a 400 degree oven for 5-6 minutes. Cool on baking sheets for one minute and move to a wire rack.\nIn a small bowl, combine the powdered sugar, vanilla and milk. Whisk to combine. Spoon mixture into a pastry bag or zip top bag and snip off the tip. Add two small dots of icing where the eyes should be and then press one eye on each dot. Decorate the mummies using a zig-zag pattern across the surface of the cookie and allow to dry for 2-4 hours or overnight.\nStore in an airtight container.","spoonacularId":644693,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:42:56.805Z"},"__v":0}
{"_id":{"$oid":"66f17e70a1ab17454d0ed226"},"likes":0,"title":"Butternut Squash and Chorizo Pasta","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/636576-556x370.jpg","instructions":"Heat olive oil and chili flakes.\nAdd chorizo and saute until the sausage begins to release it's oils.\nAdd onion and garlic and saute until softened (a few minutes).\nSeason with s&p.\nAdd squash and stir mixture together.\nAdd chopped thyme.\nSaute mixture for 5 minutes or so uncovered.\nAt this point put your pasta water on to boil.\nContinue to saute your squash mixture covered for 5 minutes.\nCheck the squash for firmness.\nYou want the squash to be tender but still hold it's shape.\nWhen the squash is tender transfer to a large serving bowl.\nAdd your cooked pasta to the squash.\nMix everything together with your cheese.\nAdd some of the reserved pasta water to loosen the mixture if you want.\nServe with more grated cheese over top.","spoonacularId":636576,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:42:56.806Z"},"__v":0}
{"_id":{"$oid":"66f17e70a1ab17454d0ed227"},"likes":0,"title":"Larb Salad","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/649264-556x370.jpg","instructions":"<ol><li>Add ground pork and stock to a large saut pan and cook for 5 minutes over medium-high heat. Add garlic, shallots and chilies and cook an additional 5 minutes, or until meat is done. Remove from heat and cool slightly. </li><li>In a medium mixing bowl, whisk together lime juice, fish sauce, sugar and grated ginger. Add cooked pork mixture to this mixing bowl and stir until well combined.</li><li>Add fresh herbs and stir to combine, or allow guests to choose which fresh herbs to add. Serve with tomatoes and lettuce leaves. Spoon ground pork mixture into lettuce leaves.</li></ol>","spoonacularId":649264,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:42:56.806Z"},"__v":0}
{"_id":{"$oid":"66f18085e365165208e90ea0"},"likes":0,"title":"Goldilocks Chia Seed Porridge","readyInMinutes":15,"servings":1,"image":"https://img.spoonacular.com/recipes/645032-556x370.jpg","instructions":"<ol><li>Lovingly mix all of the ingredient's together in your favorite cereal bowl, let sit for approx. 5 minutes or longer so that the Chia seeds can began to thicken into a gel-like consistency. You may prefer to add the Chia seeds and the hemp milk first to allow for the thickening process to take course before adding the remaining ingredient's, this shall be up to you.</li><li>Once the cereal is thickened, think happy and enjoy!</li></ol>","spoonacularId":645032,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:51:49.741Z"},"__v":0}
{"_id":{"$oid":"66f18085e365165208e90ea1"},"likes":0,"title":"Brussel Sprouts in Bacon and Garlic Sauce","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/636359-556x370.jpg","instructions":"Wash 250g of brussel sprouts. Remove any old hard out leaves.\nBring 4 cups of water to the boil and add 1/2 teaspoon of salt.\nAdd the brussel sprouts to the boiling water and leave to boil at medium heat for 4 minutes or until sprouts are tender but still crunchy.\nDrain the brussel sprouts.\nReturn the saucepan to the hot stove and add 1 tablespoon of butter.\nWhile the butter is melting, cut the brussel sprouts in half.\nAdd 1 tablespoon of minced garlic to the melted butter. Saut for a few seconds till garlic is fragrant but not brown.\nReturn the cut brussel sprouts to the saucepan. Toss the brussel sprouts lightly in the garlic-butter sauce.\nAdd 1 tablespoon of bacon bits. I keep a jar of ready to use bacon bits in the fridge at all times for this dish (and for my Mushroom Delight dish). You can also use freshly pan fried and crumbled bacon, but I like to cook this fast.\nSeason to taste with salt and pepper. I always use Masterfoods Garlic Pepper to season my dishes. A few shakes of this and its done.\nAdd a squeeze of fresh lemon juice (about 1 teaspoon).\nToss everything together. Serve with some fresh lemons on the side for extra tangy flavour, if preferred. You can also garnish with some toasted almond flakes.","spoonacularId":636359,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:51:49.742Z"},"__v":0}
{"_id":{"$oid":"66f18085e365165208e90ea2"},"likes":0,"title":"Dry Mee Siam","readyInMinutes":45,"servings":3,"image":"https://img.spoonacular.com/recipes/641687-556x370.jpg","instructions":"<ol><li>Soak the vermicelli in water till soft for about 30 minutes (I used chilli brand), Drain and set aside.</li><li>Using a food processor, grind the spice paste till fine and set aside.</li><li>Heat wok with some oil and make the beaten eggs into an omelette. Fold and slice the omelette thinly. Set aside.</li><li>Heat up the wok and add 3 tablespoons of oil. Once the oil is heated, fry the spice paste until aromatic and the oil separates. This ensures that the chillies are cooked through and you will not get that 'grassy' taste of raw chillies. Add shrimps, stir-frying until half done, then add the fried tofu pieces.</li><li>Add the vermicelli and keep stirring until the spice paste has spread evenly. (you may add about half cup of water to it if you find the rice vermicelli is still quite dry when frying) Add sugar and salt to taste, if requred, followed by bean sprouts and chives. Continue to stir-fry until the vegetables are cooked. Taste and adjust the seasoning by adding more salt or sugar to taste. If the noodles taste bland, add a little soy sauce/fish sauce to taste.</li><li>Garnish with shredded omelette, green lime and some red chillies on mee siam when serve.</li></ol>","spoonacularId":641687,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:51:49.742Z"},"__v":0}
{"_id":{"$oid":"66f18085e365165208e90ea3"},"likes":0,"title":"Butter Chicken","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/636488-556x370.jpg","instructions":"Combine first 9 ingredients and marinate overnight.\nHeat 1 tablespoon oil in a large saucepan over medium high heat.\nSaute onion until soft and translucent.\nStir in butter, lemon juice, ginger, garlic , 1 teaspoon garam masala, cumin and bay leaf. Cook, stirring, for 1 minute.\nAdd tomato sauce and diced tomatoes, and cook for 2 minutes, stirring frequently.\nStir in cream.\nReduce heat to low, and simmer for 10 minutes, stirring frequently.\nSeason with salt and pepper.\nRemove from heat and set aside.\nHeat 1 tablespoon oil in a large heavy skillet over medium heat.\nCook chicken until lightly browned, about 10 minutes.\nReduce heat, and season with 1 teaspoon garam masala and.\nStir in a few spoonfuls of sauce, and simmer until liquid has reduced, and chicken is no longer pink.\nStir cooked chicken into sauce.\nMix together cornstarch and water, then stir into the sauce.\nCook for 5 to 10 minutes, or until thickened.\nTop with cilantro, if desired.","spoonacularId":636488,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:51:49.743Z"},"__v":0}
{"_id":{"$oid":"66f18085e365165208e90ea4"},"likes":0,"title":"Gooey Chocolate Buttermilk Sheet Cake","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/645068-556x370.jpg","instructions":"<ol><li>Cake:</li><li>Preheat oven to 350 F (180C).</li><li>In a large saucepan, bring to a boil the water, cocoa, oil and butter or margarine.</li><li>Mix the flour, sugar, salt and soda in a large mixing bowl.  </li><li>Whisk in the hot mixture and mix well.</li><li>To this add the buttermilk, vanilla and the beaten eggs; continue mixing.</li><li>Pour the batter into a greased and floured 9\"x13\" oblong baking pan.</li><li>Bake in the preheated oven for approximately 20 minutes or until a toothpick comes out clean when inserted in the middle.</li><li>Remove from the oven and frost while still warm.</li><li>Frosting:</li><li>In a large pan set over medium heat, melt the butter and the cocoa powder and milk.</li><li>Stir in the sugar and vanilla; whisk until smooth.</li><li>Add the chopped nuts if desired; stir well and spread on the warm cake.</li><li>Let cake cool before serving.</li></ol>","spoonacularId":645068,"ingredients":[],"createdAt":{"$date":"2024-09-23T14:51:49.743Z"},"__v":0}
{"_id":{"$oid":"66f2d78e5e6ca10e5ed71ea4"},"likes":0,"title":"Old Fashioned Vanilla Buttercream Frosting","readyInMinutes":5,"servings":8,"image":"https://img.spoonacular.com/recipes/715550-556x370.jpg","instructions":"Instructions\n\nButtercream Icing Recipe\n\nIn a large mixing bowl cream butter and shortening with electric mixer. Add vanilla.\n\nGradually add in sifted confectioners sugar, one cup at a time beating on medium speed.\n\nScrape sides and bottom of bowl often. When all of the sugar has been mixed in, icing will appear dry. Add milk and beat at medium speed for 3 minutes.\n\nKeep icing covered with a damp cloth until ready to decorate. For best results, keep icing bowl in refrigerator when not using.\n\nIcing can be stored in an air tight container for up to a week. Just re-whip it in your mixer before using. Makes 3 1/2 cups.","spoonacularId":715550,"ingredients":[],"createdAt":{"$date":"2024-09-24T15:15:26.689Z"},"__v":0}
{"_id":{"$oid":"66f2d78e5e6ca10e5ed71ea3"},"likes":0,"title":"Coconut Cream Pie Vegan Milkshake","readyInMinutes":45,"servings":3,"image":"https://img.spoonacular.com/recipes/639749-556x370.jpg","instructions":"Combine coconut meat, lemon juice, coconut oil, coconut milk, banana, vanilla, agave nectar (optional) and graham cracker crumbs in a blender; pulse until smooth.\nTop with soy or dairy based whip cream, sprinkle with additional graham crackers and garnish with toasted coconut flakes.\nServes 2-3","spoonacularId":639749,"ingredients":[],"createdAt":{"$date":"2024-09-24T15:15:26.688Z"},"__v":0}
{"_id":{"$oid":"66f2d78e5e6ca10e5ed71ea7"},"likes":0,"title":"Coconut and Whole Wheat Chicken Tenders","readyInMinutes":30,"servings":2,"image":"https://img.spoonacular.com/recipes/639722-556x370.jpg","instructions":"<ol><li>Pre Heat the oven to 350 degrees</li><li>Dip chicken tenders in egg whites</li><li>Mix together the whole wheat crumbs and unsweetened coconut</li><li>Roll eggy chicken in the breadcrumbs/coconut mixture</li><li>Place on a cookie sheet in bake for 20 minutes</li></ol>","spoonacularId":639722,"ingredients":[],"createdAt":{"$date":"2024-09-24T15:15:26.691Z"},"__v":0}
{"_id":{"$oid":"66f2d78e5e6ca10e5ed71ea6"},"likes":0,"title":"Red Quinoa and Roasted Cauliflower Salad","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/658087-556x370.jpg","instructions":"Cook the quinoa according to package directions.\nPreheat the oven to 400 F\nCut head of cauliflower into florets.  Toss with olive oil, salt and pepper and place on a baking sheet.  Roast cauliflower for 20 minutes or until tender.\nMeanwhile, crumble the cheese and chop the rest of the ingredients.\nMix them all together, sprinkle with some extra virgin olive oil and juice from 1/2 a lemon season to taste.\nServe warm or cold.","spoonacularId":658087,"ingredients":[],"createdAt":{"$date":"2024-09-24T15:15:26.69Z"},"__v":0}
{"_id":{"$oid":"66f2d78e5e6ca10e5ed71ea5"},"likes":0,"title":"Cheesy Chicken Enchilada Quinoa Casserole","readyInMinutes":30,"servings":4,"image":"https://img.spoonacular.com/recipes/715421-556x370.jpg","instructions":"To get started, heat your oven to 350 and prepare an 8x8 baking dish. Cook the quinoa according to the instructions. If you haven't already, boil and shred your chicken breast.In a medium sized mixing bowl add 2 Tbsp cilantro, 1 cup shredded cheese, quinoa, tomatoes with chilis, black beans, half of the can of sweet corn, verde enchilada sauce, cumin, chili powder, white pepper, black pepper, and salt to taste. Mix everything well, and then pour into the 8 x8 baking dish. Cover with the last cup of cheese and then bake in the oven for 15 minutes.Remove from oven and allow to cool for 5 minutes. Then top with chopped Roma tomato, chopped avocado, green onion tops, and remaining 2 tsp of cilantro. Serve immediately.","spoonacularId":715421,"ingredients":[],"createdAt":{"$date":"2024-09-24T15:15:26.69Z"},"__v":0}
{"_id":{"$oid":"66f4580409b6550e89f48bc1"},"likes":0,"title":"Lebanese Kibbeh","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/649403-556x370.jpg","instructions":"1) Preheat the oven to 375F degrees. Rinse the bulgur wheat in a sieve and squeeze out the excess moisture.\n2. Mix the lamb, onion and seasoning, kneading the mixture to make a thick paste. Add the bulgur wheat and blend together.\n3. To make the filling, heat the oil in a frying pan and fry the onion until golden. Add the lamb or veal and cook, stirring, until evenly browned and then add the pine nuts, allspice and salt and pepper.\n4. Oil a large baking dish and spread half of the meat and bulgur wheat mixture over the bottom. Spoon over the filling and top with a second layer of meat and bulgur wheat, pressing down firmly with the back of a spoon.\n5. Pour the melted butter over the top and then bake on the oven for 40-45 minutes until browned on top.\n6. Meanwhile make the yogurt dip: Blend together the yogurt and garlic, spoon into a serving bowl and sprinkle with the chopped mint.\n7. Cut the cooked kibbeh into squares or rectangles and serve garnished with mint and accompanied by rice and the yogurt dip. NOTES The national dish of Syria and the Lebanon in Kibbeh, as kind of meatball made from minced lamp and bulgur wheat. Raw kibbeh is the most widely eaten type, but this version is very popular too.","spoonacularId":649403,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:35:48.925Z"},"__v":0}
{"_id":{"$oid":"66f4580409b6550e89f48bc2"},"likes":0,"title":"Lemony Zucchini Fritters","readyInMinutes":45,"servings":3,"image":"https://img.spoonacular.com/recipes/631754-556x370.jpg","instructions":"<ol><li>Chop the zucchini into small pieces. Place in food processor and pulse until there are small bits left. (If you have a grating attachment on your food processor you can use that instead).</li><li>In a medium bowl add zucchini, lemon juice, parsley, flour, eggs, spices, Parmesan cheese, and breadcrumbs. Mix together until evenly distributed.</li><li>Place olive oil in a large frying pan and heat over medium high heat. Working in batches, add a little less than a cup of batter to the frying pan for each fritter. Cook until golden brown on the bottom, about 45 seconds. Flip over and cook until golden brown on the other side.</li><li>Place a few layers of paper towel on a baking sheet or plate. Once fritters are done, transfer to the lined baking sheet or dish and let the paper towel soak up extra oil.</li><li>Garnish with more lemon juice and a dollop of Greek yogurt before serving.</li></ol>","spoonacularId":631754,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:35:48.927Z"},"__v":0}
{"_id":{"$oid":"66f4580409b6550e89f48bc3"},"likes":0,"title":"Crispy Pineapple Fritters","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/640827-556x370.jpg","instructions":"Prepare the batter by combining the flour, cornstarch, baking powder, salt, egg and milk in a shallow dish and whisk with a fork to make a pancake-like batter.\nPlace the panko crumbs in another shallow dish.\nPlace about an inch of oil in a large skillet and preheat the oil over medium-high heat.\nPat the pineapple rings as dry as possible between sheets of paper towels. Slide each ring into the batter, tapping off any excess batter. Coat well in the crumbs. Immediately fry in the hot oil until golden brown on both sides.\nServe hot, warm or at room temperature.  Great just as is or optional garnishes can include powdered sugar, cinnamon sugar, ice cream, or whipped cream.","spoonacularId":640827,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:35:48.927Z"},"__v":0}
{"_id":{"$oid":"66f4580409b6550e89f48bc4"},"likes":0,"title":"Creamy Shrimp Bisque","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/640700-556x370.jpg","instructions":"In a medium saucepan, add the celery, onion and butter stirring occasionally until tender for about 10 minutes. When tender add the garlic and saut for another 3-4 minutes. Stir in the flour and cook for about 5 minutes to take out the flour taste then add the potatoes, half and half. Let simmer over medium heat for another 5 minutes. Stir in the fish stock, parsley and all of the seasonings then let this cook for another 10 minutes and it gets thick and bubbly. Add the shrimp meat and simmer for another 10 minutes.\nSide Note: My husband and I decided that even though this bisque was amazing the way it was it could also benefit from some smoky bacon. So next time, I will cook up some bacon pieces then set them aside and cook the onion and celery in the bacon drippings. Once the bisque is ladled into bowls, sprinkle the top with the crispy bacon.","spoonacularId":640700,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:35:48.928Z"},"__v":0}
{"_id":{"$oid":"66f4580409b6550e89f48bc5"},"likes":0,"title":"How to Make an Amazing Chicken Salad with Apples and Celery","readyInMinutes":10,"servings":3,"image":"https://img.spoonacular.com/recipes/1160166-556x370.jpg","instructions":"Instructions\n\nMix chicken, celery, and apples. \n\nIn a separate bowl mix mayo, yogurt, and lemon juice. Mix well.\n\nCombine chicken mixture with mayo mixture and stir well. Add salt and pepper to taste.\n\nOPTIONAL: Slice an avocado, remove the pit, and serve the chicken salad with avocado. It's so good! ","spoonacularId":1160166,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:35:48.929Z"},"__v":0}
{"_id":{"$oid":"66f4587b09b6550e89f48bc7"},"likes":0,"title":"Baked Mushroom Caps","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/633678-556x370.jpg","instructions":"<ol><li>Fill sauteed caps with mixture of rest of ingredients and sprinkle generously with Parmesan cheese. Bake at 350 degrees for 10 minutes.</li></ol>","spoonacularId":633678,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:37:47.465Z"},"__v":0}
{"_id":{"$oid":"66f459e87604c212b7396782"},"likes":0,"title":"Home made coffee ice cream","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/646868-556x370.jpg","instructions":"<ol><li>Combine the cream, milk, sugar, and coffee in a medium, heavy saucepan</li><li>Bring to a gentle boil over medium heat; remove from the heat and set aside.</li><li>Beat the egg yolks in a medium bowl.</li><li>Whisk 1 cup of the hot cream into the egg yolks.</li><li>Add the vanilla extract.</li><li>Gradually add the egg mixture in a slow, steady stream, to the hot cream</li><li>Cook over low heat, stirring constantly until slightly thickened, about 4-5 minutes.</li><li>Remove from the heat and strain through a fine mesh strainer into a clean container.</li><li>Cover with plastic wrap, pressing down against the surface to keep a skin from forming.</li><li>Chill in the refrigerator for at least 2 hours.</li><li>Pour the mixture into an ice cream machine and churn until frozen (according to the manufacturer's instructions).</li><li>Transfer to plastic container and place in the freezer for a few hours before serving.</li><li>Serving: take it out of the freezer for 5-10 minutes before serving, or longer, so it comes to the right scooping temperature.</li><li>Easy suggestion: ice cream is best served in chilled glass or porcelain bowls. Scoop it with a hot, but dry, ice-cream spoon (soak it in boiling water, then wipe dry).</li></ol>","spoonacularId":646868,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:43:52.21Z"},"__v":0}
{"_id":{"$oid":"66f459e87604c212b7396783"},"likes":0,"title":"Fava Crostini","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/642638-556x370.jpg","instructions":"Throw the fava in a pan & cover with water & a little salt. Bring to a boil & lower to a simmer. Cook a couple of minutes until the fava are tender. Drain.\nReturn the pan to the heat. Pour in a couple glugs of olive oil and the garlic clove. Fry the garlic until browned. Then discard garlic.\nToss the fava into the pan & saute for a minute or two. Then begin mashing with the back of a wooden spoon until you form a paste. If you need to add a bit of water, do so.\nRemove fava paste from heat & season with salt & pepper add a squeeze of lemon.\nToast slices of good bread & rub warm fava mixture & top with shaved parmesan. You can drizzle a little really good quality extra virgin olive oil as well if you like.","spoonacularId":642638,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:43:52.211Z"},"__v":0}
{"_id":{"$oid":"66f459e87604c212b7396784"},"likes":0,"title":"Banana Bread","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/634006-556x370.jpg","instructions":"Preheat the oven to 350 degree. In big bow smashed banana and add melted butter, then add sugar, egg, and vanilla. Keep mixer then add flour, salt and baking soda mixed well then pour buttered into 8 X 3.75 inch loaf pan. Bake for 1 hour. keep cool on the rack. Slice and serve.","spoonacularId":634006,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:43:52.211Z"},"__v":0}
{"_id":{"$oid":"66f459e87604c212b7396785"},"likes":0,"title":"Strip steak with roasted cherry tomatoes and vegetable mash","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/661948-556x370.jpg","instructions":"<ol><li>For the marinade, mix the first 5 ingredients, add fresh rosemary.</li><li>Pour marinade over steaks and allow to stand for at least an hour, preferably overnight.</li><li>Cook cherry tomatoes in a grill pan, drizzle over a little olive oil and season to taste. Set aside.</li><li>Remove the steaks from the marinade and cook for 2 minutes on each side in hot olive oil.  Reduce the heat, add butter and cook for another 2-4 minutes, turning once, depending on how rare you like your meat. Transfer to a plate, set aside in a warm place to rest.</li><li>To make the mash, cook green string beans and peas in boiling water for 8-10 minutes until tender, then drain and cool under cold water.</li><li>Tip them into a food processor with the ricotta and a tablespoon of olive oil. Season with salt and pepper, blend them to a rough pure.</li><li>Transfer the mash to a pan where the stakes were cooked and gently heat it for 1 minute.</li><li>To serve, divide the pure among warmed plates and arrange the steaks on top. Finish with a pile of roasted tomatoes, a drizzle of olive oil and some steamed new potatoes.</li></ol>","spoonacularId":661948,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:43:52.211Z"},"__v":0}
{"_id":{"$oid":"66f459e87604c212b7396786"},"likes":0,"title":"Barbecued Corn on the Cob With Spiced Butter","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/634300-556x370.jpg","instructions":"Combine the butter, garlic, honey, and spices in a small saucepan and cook over a gentle heat.\nBrush corn with the flavored butter and cook on the barbecue or under the grill turning regularly until golden.\nBaste continually during the cooking process.","spoonacularId":634300,"ingredients":[],"createdAt":{"$date":"2024-09-25T18:43:52.211Z"},"__v":0}
{"_id":{"$oid":"66f46d92570c6d2381946e98"},"likes":0,"title":"Quinoa and Chickpea Salad with Sun-Dried Tomatoes and Dried Cherries","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/716004-556x370.jpg","instructions":"Rinse the quinoa and soak for 8 hours or overnight in 2 cups of water. Rinse the chickpeas and soak for 8 hours or overnight in several inches of water.Rinse the chickpeas and transfer to a small saucepan. Cover with fresh water and bring to a boil. Reduce heat to medium-low, cover, and simmer for 1 hour or until buttery soft.While the chickpeas are cooking, soak the sun-dried tomatoes in hot water for 30 minutes, then drain and chop. Meanwhile, bring the quinoa to a boil in a medium saucepan. Reduce heat to the lowest setting, cover, and simmer for 15 minutes or until the water is absorbed. Remove from heat and wait 5 minutes before fluffing with a fork.Meanwhile, toast the cashews in a dry unoiled skillet or saucepan over medium-low heat, tossing or stirring frequently, for 10 minutes until browned.Transfer the chickpeas, quinoa, sun-dried tomatoes, cashews and dried cherries to a large mixing bowl. Whisk the dressing ingredients together and pour over the salad. Stir to combine and serve at room temperature or chilled.","spoonacularId":716004,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:07:46.229Z"},"__v":0}
{"_id":{"$oid":"66f46d92570c6d2381946e99"},"likes":0,"title":"Basil Infused Balsamic Oven Baked Chicken","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/730914-556x370.jpg","instructions":"Place into the oven and bake for 40 minutes. Cover with mozzarella cheese and place back into the oven for 10 additional minutes. Use a thermometer make sure the internal temp is 160 for the chicken to be fully cooked. If not, allow to cook for a few additional minutes until the desired temp is reached.Allow to cool slightly and serve with your favorite salad.Basil Infused Balsamic Oven Baked ChickenI LOVE this recipe. If you want to join in on the Simple Fit Forty Lifestyle campaign we are kicking off here on PinkWhen, then make sure you sign up for the newsletter and stay up to date. You can also follow along in our private Facebook community, Simple Fit Forty Lifestyle, where we will be sharing all things fit an healthy and motivating each other along the way.JOIN 500,000 SUBSCRIBERS!Join over 500,000 others who follow PinkWhen on Social Media, the PinkWhen blog, and email. Sign up to receive exclusive bonuses like this FREE Simple Fit Dinners Ebook.Don't wait! You won't want to miss a thing.Success! Now check your email to confirm your subscription and download your FREE ebook.There was an error submitting your subscription. Please try again.First NameEmail AddressSubscribePowered by ConvertKit","spoonacularId":730914,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:07:46.23Z"},"__v":0}
{"_id":{"$oid":"66f46d92570c6d2381946e9a"},"likes":0,"title":"Honey Sesame Crisps-Eggless,Sugarless & Flourless","readyInMinutes":45,"servings":15,"image":"https://img.spoonacular.com/recipes/647279-556x370.jpg","instructions":"Lightly toast the almonds and cashews in a sauce pan.Set aside to cool.\nIn the same saucepan, add the sesame seeds and lightly toast them too.Set aside.\nTip in the roasted almonds and cashews in the food processor with the metal blade and process to make a crumbly powder.The flour u get should not be too chunky or too fine.\nIn a medium bowl, tip in the almond-cashew powder,sesame seeds,salt and cardamom powder.Combine well and let it sit.\nIn a sauce pan,let the butter melt.When it has just about melted, add the honey, whisk the two to an emulsion.Dont cook.\nPreheat oven to 400F.Line a cookie sheet with parchment paper or silicone mats. I think aluminium foil will not work.\nSlowly add the butter-honey mix to the flour-sesame mix and start combining with a spatula. You might need little less or more honey mix if your flour is chunky or fine. The mix once done will resemble a loose cookie dough [but not runny]\nSpoon a dollop [approx 1 tbsp] of the mix on the parchment paper.Dip a fork in oil & flatten out the mix with the help of the back of the fork.\nBake in oven for 8 -10 minutes or until the crisps are brown.You really need to keep a watch on these coz they cook really fast.\nOnce done,take out of the oven and if you want, use a cookie cutter while still warm to a desired shape.\nLet the crisps cool before stacking them in air tight container.","spoonacularId":647279,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:07:46.231Z"},"__v":0}
{"_id":{"$oid":"66f46d92570c6d2381946e9b"},"likes":0,"title":"Simply Bean Soup","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/660161-556x370.jpg","instructions":"Melt the butter in a pan on medium heat.\nAdd in the onion and garlic and let it cook up for 2 to 3 minutes.\nAdd in the beans and the fresh herbs.\nNext up, add in the wine and broth.\nAllow the mixture a few minutes to heat back up and then turn the heat down a notch to medium low.\nSmooth out the soup either with an emulsifier or in batches in your blender.\nStir in the sherry and add salt and pepper to taste.","spoonacularId":660161,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:07:46.232Z"},"__v":0}
{"_id":{"$oid":"66f46d92570c6d2381946e9c"},"likes":0,"title":"Cumin and Paprika Rubbed Chicken Drumsticks","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/641029-556x370.jpg","instructions":"Marinate the chicken with the spice powders, garlic, lemon juice and a tsp of olive oil. Add some salt and pepper to taste and leave at room temperature for at least half an hour.\nHeat the oven to 400F. Grease an oven proof pan. Lay the drumsticks in a single layer. Bake on high for the first fifteen minutes, then reduce to 300F and continue to cook for another fifteen, or until almost done.\nThen turn on the broiler and place the pan under it. Continue to cook the chicken until it gets a nice colour on both sides (turn them after about five minutes on each side).\n\n\nServe with corn sauted with garlic, chilli and green onions and garnished with fresh cilantro and spring onion greens","spoonacularId":641029,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:07:46.232Z"},"__v":0}
{"_id":{"$oid":"66f47740cdbd185c11c2e780"},"likes":0,"title":"Valentine Hearts","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/664269-556x370.jpg","instructions":"Preheat oven to 220 degrees C (425 F)\nThaw the pastry sheet according to the instructions on the box. Unroll pastry sheet and cut around 8 hearts with a heart shaped cookie cutter. (I used medium sized cutter of a set of 3)\nPrick each heart with a fork, brush with beaten egg and sprinkle lightly with some sugar.\nPlace these hearts on a greased baking sheet and bake for about 10min until risen and golden brown in colour. Let it cool.\nSlice the strawberries and split the heart horizontally using a sharp knife.\nSandwich the heart together with crme fraiche and sliced strawberries. Drizzle the chocolate and dust some castor sugar over the tops of the heart.","spoonacularId":664269,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:49:04.556Z"},"__v":0}
{"_id":{"$oid":"66f47740cdbd185c11c2e781"},"likes":0,"title":"Mango-Berry Swirled Smoothies","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/650844-556x370.jpg","instructions":"<ol><li>Smoothie 1: blueberries, strawberries, pomegranate juice Smoothie 2: mangos, orange juice</li><li>If you have an immersion blender, place the ingredients for each smoothie into its own quart-sized mason jar or a really large cup. Blend one smoothie, rinse off the blender, then blend the other.</li><li>If you're using a blender, blend smoothies one at a time, rinsing the blender between uses.</li><li>Pour the smoothies together into serving cups, creating a swirled effect.</li></ol>","spoonacularId":650844,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:49:04.558Z"},"__v":0}
{"_id":{"$oid":"66f47740cdbd185c11c2e782"},"likes":0,"title":"Banana Milo Milkshake","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/716351-556x370.jpg","instructions":"<p>In a blender, pour in your milk, milo, banana and ice-cream and blend till smooth.Pour into a glass, spray the whipped cream on top and sprinkle the chopped strawberries on top.Serve cool.    For those that asked, here is a link on how to make whipped cream.</p>","spoonacularId":716351,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:49:04.558Z"},"__v":0}
{"_id":{"$oid":"66f47740cdbd185c11c2e783"},"likes":0,"title":"Broccoli Rabe and Breaded Veal Scallopini","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/636207-556x370.jpg","instructions":"<ol><li>Wash and steam the broccoli rabe for a few minutes (3 or 4) in a pressure cooker.</li><li>Thinly slice the onion. Peel the garlic clove, cut in half and remove the stem.</li><li>Heat up 1 or 2 tbsp olive oil in a deep pan.</li><li>Saut the onion and garlic for a few minutes on medium heat until translucent.</li><li>Add the broccoli rabe, close with a lid and cook for a few minutes.</li><li>Cut the tomatoes in 4 or 8 wedges depending on their size, add to the pan and cook several more minutes.</li><li>Season with salt and pepper and serve.</li><li>Proceed as follows with each scalopini:</li><li>Season with salt and pepper.</li><li>Dip in beaten egg.</li><li>Dip in bread crumb and cover evenly.</li><li>Pan fry in a good amount of butter (add more butter before flipping as the bread crumb will absorb it), 1 or 2 minutes on each side over high heat.</li></ol>","spoonacularId":636207,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:49:04.559Z"},"__v":0}
{"_id":{"$oid":"66f47740cdbd185c11c2e784"},"likes":0,"title":"Eggplant Curry","readyInMinutes":360,"servings":4,"image":"https://img.spoonacular.com/recipes/642283-556x370.jpg","instructions":"<ol><li>Heat about  cup of the coconut milk over medium heat in a large skilled. Saut the onion and garlic using the coconut milk as oil until soft and beginning to brown, about 12 minutes.</li><li>Put all the eggplant and tomato into a 6-quart or larger crockpot.  In a bowl, combine all spices and stir them together. Pour the coconut milk, all the spices, salt and ginger into the crock; once the onion and garlic is finished sauting, pour contents of the skillet into the crock and mix everything together.  Turn crock pot on high and allow the curry to cook for 6 to 8 hours, checking it periodically to stir.</li><li>About a half an hour before you serve the curry, add the Greek yogurt and mix it into the curry before allowing it to cook an additional 30 minutes.</li><li>Follow directions on the back of your quinoa package (I typically do a 2:1 water to quinoa ratio and simmer for about half an hour). Serve the curry over quinoa and add a dollop of Greek yogurt on top.</li></ol>","spoonacularId":642283,"ingredients":[],"createdAt":{"$date":"2024-09-25T20:49:04.559Z"},"__v":0}
{"_id":{"$oid":"66f6d9a105e29a07c4365448"},"likes":0,"title":"Avocado Nests","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/633144-556x370.jpg","instructions":"Cook hash browns according to direction.\nCut bacon slices into thin strips and bake or fry as you prrefere.\nMake deviled eggs; mix a bit of mayonaise or cream cheese with egg yolks and divide equally into the egg white halves.\nCut avocados in half, remove seed and peel.\nPlace hash browns on plate and sprinkle with bacon.\nPlace eggs into seed cavity of avocados.\nRest avocados on the bed of hash browns and bacon.","spoonacularId":633144,"ingredients":[],"createdAt":{"$date":"2024-09-27T16:13:21.455Z"},"__v":0}
{"_id":{"$oid":"66f6d9a105e29a07c4365449"},"likes":0,"title":"Pancakes","readyInMinutes":45,"servings":9,"image":"https://img.spoonacular.com/recipes/654495-556x370.jpg","instructions":"<ol><li>Beat egg until fluffy.</li><li>Add milk and melted margarine.</li><li>Add dry ingredients and mix well.</li><li>Heat a heavy griddle or fry pan which is greased with a little butter on a paper towel.</li><li>The pan is hot enough when a drop of water breaks into several smaller balls which 'dance' around the pan.</li><li>Pour a small amount of batter (approx 1/4 cup) into pan and tip to spread out or spread with spoon.</li><li>When bubbles appear on surface and begin to break, turn over and cook the other side.</li></ol>","spoonacularId":654495,"ingredients":[],"createdAt":{"$date":"2024-09-27T16:13:21.457Z"},"__v":0}
{"_id":{"$oid":"66f6d9a105e29a07c436544a"},"likes":0,"title":"Grilled Ham and Cheese French Toast For A Quick Weeknight Dinner","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/645732-556x370.jpg","instructions":"Preheat oven to 350 degrees.\nIn a shallow bowl or pie plate, whisk together buttermilk and egg whites. Set aside.\nSpread mustard on one side of each slice of bread.  Top 4 slices with 1 slice of cheese.  Arrange ham on top of cheese.  Add to each 3-4 thin slices of pickle. Top with remaining bread slices, mustard side down.\nMelt 1 tablespoon reduced-fat butter in a large nonstick pan over medium heat.  Dip 2 sandwiches into buttermilk mixture; carefully flip and dip other side.  Dont soak the sandwiches in this mixture. Just lightly dip and remove sandwiches, allowing excess buttermilk mixture to drip back into dish.\nAdd sandwiches to pan; cover and cook 3-5 minutes.  Uncover, flip sandwiches, press top down with a spatula, cover and cook for 2-3 minutes until golden and cheese is melted.  Remove sandwiches, place on a baking sheet and keep warm in oven.\nRepeat steps 4 and 5 with remaining 2 sandwiches.\nSlice each sandwich in half and serve with a fork and knife.","spoonacularId":645732,"ingredients":[],"createdAt":{"$date":"2024-09-27T16:13:21.458Z"},"__v":0}
{"_id":{"$oid":"66f6d9a105e29a07c436544b"},"likes":0,"title":"Chicken and Mango Skewer","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/716330-556x370.jpg","instructions":"<p>Chop chicken breast into cubes and place on sticks. Set fire to your grill or oven.</p><p>Place the chicken breast on the grill to heat up a little</p><p>Mix all your seasoning in a bowl with your vegetable oil.</p><p>With a brush, smear the mix on the chicken breast on both sides.</p><p>Flip occasionally as it browns till its cooked. </p><p>Stack your mangoes after the chicken is done but if your mangoes are firm, you can grill them as well. </p><p>Serve on its own as an appetizer or with rice.</p>","spoonacularId":716330,"ingredients":[],"createdAt":{"$date":"2024-09-27T16:13:21.459Z"},"__v":0}
{"_id":{"$oid":"66f6d9a105e29a07c436544c"},"likes":0,"title":"Pasta With Tuna","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/654959-556x370.jpg","instructions":"<ol><li>Cook pasta in a large pot of boiling water until al dente. Drain and return to warm pot. Put olive oil in saucepan and add onion. Saute until transparent. Stir in flour and cook for a few seconds and then whisk in milk. Stir constantly until this thickens. Add peas, tuna (shredded into chunks,) parsley, green onions, cheese and hot pepper sauce. Pour over pasta and stir gently to mix. Serve at once.</li></ol>","spoonacularId":654959,"ingredients":[],"createdAt":{"$date":"2024-09-27T16:13:21.459Z"},"__v":0}
{"_id":{"$oid":"66f6fa59decad30c815ae41a"},"likes":0,"title":"Creamy Potato Soup","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/640686-556x370.jpg","instructions":"In a large saucepan over medium-high heat, melt butter and add onions; saut in the butter until the onions are translucent; add the garlic and stir a couple of times, then immediately stir in the chicken broth. Add potatoes, (add water if needed to barely cover potatoes) bring to a boil and reduce to a medium boil and cook until potatoes are tender (about 20-25 minutes). Add the half and half and bring to a low boil and continue cooking for an additional 10 minutes, stirring occasionally. Season with salt and pepper to taste.\nFor a smoother soup, you may blend with a stick blender or mash with the back of a spoon while stirring.","spoonacularId":640686,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:32:57.846Z"},"__v":0}
{"_id":{"$oid":"66f6fa59decad30c815ae41b"},"likes":0,"title":"Sunday Morning Doughnuts","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/662303-556x370.jpg","instructions":"Combine all ingredients in a large bowl and mix well (clean hands work great for the job).\nTurn onto a floured board and knead for a few minutes. Let rest\nRoll out to about 1/2\" thick and cut out with a doughnut cutter.\nHeat about 4\" oil (vegetable oil works fine, we use lard) to 360F\nFry 3 or 4 doughnuts at a time, turning when one side is browned - fry until both sides are nicely browned.\nDrain on paper towels or on a paper bag. Makes about one dozen doughnuts.","spoonacularId":662303,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:32:57.847Z"},"__v":0}
{"_id":{"$oid":"66f6fa59decad30c815ae41c"},"likes":0,"title":"Spicy Cilantro Pesto","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/661066-556x370.jpg","instructions":"<ol><li>Place cilantro in food processor. Pulse until well chopped. Add garlic, sea salt, pepitas, and chili powder. Chop well.</li><li>Using an attachment for adding liquids, add olive oil drop by drop to the running food processor to form a thick paste. Scoop paste into pint jars and store in fridge or freezer.</li></ol>","spoonacularId":661066,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:32:57.847Z"},"__v":0}
{"_id":{"$oid":"66f6fa59decad30c815ae41d"},"likes":0,"title":"Instant Pot Chicken Taco Soup","readyInMinutes":25,"servings":4,"image":"https://img.spoonacular.com/recipes/982382-556x370.jpg","instructions":"Instructions:\nPress the Saute button on the Instant Pot and heat oil. Add onion and bell pepper and saute until translucent. Add tomatoes including juice and add water. Make sure to scrape all of the bits from the sides and bottom of the Instant Pot as you are stirring.\nAdd chicken, chili powder, corn, black beans, green onions, green chilis, and  cup of cilantro. Lock lid. Press the manual or pressure cook button and set time for 15 minutes. When time is up, do a quick release until the valve drops and then unlock the lid. Shred the chicken using two forks and then let the soup simmer for 5 minutes.\nServe the soup into bowls and then top with your favorite toppings such as sour cream, cheese, avocado, etc.","spoonacularId":982382,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:32:57.848Z"},"__v":0}
{"_id":{"$oid":"66f6fa59decad30c815ae41e"},"likes":0,"title":"Cranberry Crumb Bars","readyInMinutes":45,"servings":24,"image":"https://img.spoonacular.com/recipes/640366-556x370.jpg","instructions":"<ol><li>Preheat the oven to 375 degrees F. Butter a 913 inch pan.</li><li>In a medium bowl, mix together 1 cup sugar, flour, almond flour, salt and baking powder. Use a fork or pastry cutter to blend in the butter and egg. The dough will be crumbly. Alternatively, you can pulse the dry ingredients in a food processor with the butter until pebbly, and then mix in the egg until it all comes together. Pat half of the dough into the buttered pan.</li><li>In another bowl, stir together the sugar, cornstarch, vanilla, and orange juice. Mix in the cranberries. Sprinkle the cranberry mixture evenly over the dough in the pan.</li><li>Add 1/4 tsp cinnamon to the remaining dough, then crumble dough over the berries. Bake for 45-55 minutes, or until top is a light golden brown. Cool completely and chill in the refrigerator before cutting into squares. Store in an airtight container in the refrigerator.</li><li>Just toss almonds in a food processor until finely ground to make almond meal.</li></ol>","spoonacularId":640366,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:32:57.848Z"},"__v":0}
{"_id":{"$oid":"66f6fadbdecad30c815ae420"},"likes":1,"title":"Strawberry Mango Green Tea Limeade","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/661834-556x370.jpg","instructions":"In a blender or food processor puree and blend the strawberries, mango, lime juice and simple syrup.\nPour puree over ice in a large pitcher.\nAdd chilled green tea and stir.\nPour into glasses and garnish with lime wedges and fresh strawberries.","spoonacularId":661834,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:35:07.408Z"},"__v":0}
{"_id":{"$oid":"66f6fadbdecad30c815ae421"},"likes":0,"title":"Lemonade Bundt Cake","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/649856-556x370.jpg","instructions":"<ol><li>Preheat oven to 350 degrees.  Grease and flour a 10 inch bundt pan.  Combine the cake mix, lemon pudding mix, eggs, sour cream, vegetable oil and the water. Mix until smooth. Pour the batter into the prepared pan.  Bake for 50-60 minutes or until a toothpick inserted in the center comes out clean.  Let cake cool for 10-15 minutes on a wire rack while you make the glaze.  Combine the lemonade concentrate and 1 cup of the powdered sugar.  Stir in additional powdered sugar until glaze reaches desired consistency.  Spoon the glaze over the cooled cake.  Dust with additional powdered sugar, if desired.</li></ol>","spoonacularId":649856,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:35:07.408Z"},"__v":0}
{"_id":{"$oid":"66f6fadbdecad30c815ae422"},"likes":0,"title":"Gluten Free Waffles","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/644860-556x370.jpg","instructions":"Mix all dry ingredients in a large bowl, and slowly mix in wet ingredients. Cook on low in waffle machine.","spoonacularId":644860,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:35:07.409Z"},"__v":0}
{"_id":{"$oid":"66f6fadbdecad30c815ae423"},"likes":0,"title":"Cajun Potato Wedges","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/636733-556x370.jpg","instructions":"<ol><li>Preheat oven to 425 degrees Fahrenheit. Slice potatoes into  inch thick wedges that are half the length of the potato.</li><li>Make spice mixture: combine all spices and mix together in a small bowl.</li><li>Spray cookie sheet with olive oil cooking spray. Place potatoes on cookie sheet. Toss with olive oil. Sprinkle spice mixture over potatoes and toss.</li><li>Cook for 25 minutes. Flip over and cook for another 5 minutes.</li></ol>","spoonacularId":636733,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:35:07.409Z"},"__v":0}
{"_id":{"$oid":"66f6fadbdecad30c815ae424"},"likes":0,"title":"Carrot and Banana Snacking Cake","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/637161-556x370.jpg","instructions":"Steam carrots until very tender, then mash completely with the banana.\nMix carrots and banana mixture with egg, yogurt, sugars, and oil.\nIn another bowl, combine flours, baking soda and cinnamon. Combine with wet ingredients and fold in raisins.\nPreheat oven to 350 and spray a medium sized baking dish with cooking spray. Bake for 30  40 minutes, depending on the size of the pan you use. Cake is done when a toothpick inserted in the middle comes out clean.","spoonacularId":637161,"ingredients":[],"createdAt":{"$date":"2024-09-27T18:35:07.409Z"},"__v":0}
{"_id":{"$oid":"66f70d68f1e5bc08307f3f30"},"likes":2,"title":"Caramelized cranberries coconut pancakes","readyInMinutes":45,"servings":5,"image":"https://img.spoonacular.com/recipes/637055-556x370.jpg","instructions":"<ol><li>Heat a nonstick sauce pan over medium flame.</li><li>Add cranberries, brown sugar and vanilla extract to the pan.</li><li>Mix, cover and cook for 4-5 minutes till the cranberries are soft and mash it with a spoon.</li><li>Turn off the flame and let it cool for a while.</li><li>In a mixing bowl combine all the dry ingredients.</li><li>In another bowl whip the eggs and mix in the milk.</li><li>Add the cranberries mix to the egg and milk. Beat thoroughly.</li><li>Pour the liquid ingredients to the dry ingredients and mix well. Let it stand for 2 minutes.</li><li>In the meantime heat the griddle or fry pan over medium flame and grease it with cooking spray or oil of your choice.</li><li> Pour a spoonful of the batter into the pan and shape it round.</li><li> Let it cook for 2 minutes or until golden brown. The pancake would rise a bit.</li><li> Flip to the other side and cook again for 2 minutes or until golden brown.</li><li> Repeat the same process for all the pancakes.</li><li> Drizzle sweetener of your choice and top it with cream if desired and serve warm.</li></ol>","spoonacularId":637055,"ingredients":[],"createdAt":{"$date":"2024-09-27T19:54:16.629Z"},"__v":0}
{"_id":{"$oid":"66f70d68f1e5bc08307f3f31"},"likes":0,"title":"Gingerbread","readyInMinutes":45,"servings":24,"image":"https://img.spoonacular.com/recipes/644674-556x370.jpg","instructions":"<ol><li>Preheat oven to 350</li><li>Spray 4 Mini Loaf pans with non-cooking spray, set a side</li><li>Stir together 1 cup of flour, brown sugar, baking powder, cinnamon, ginger, cloves and baking soda.</li><li>Add the pumpkin, molasses, eggs, honey, water and butter.</li><li>Beat with an electric mixer on low to medium speed until combined, about 30 seconds.</li><li>Beat on medium to high speed for 2 minutes, scraping the sides of the bowl occasionally.</li><li>Add the remaining flour; beat for 2 minutes or until mixed.</li><li>Divide the batter evenly among the prepared pans.</li><li>For the topping, sprinkle Turbinado Sugar evenly over all the batter in the pans. Optional Toppings: Sprinkle Crystalized Ginger and Walnuts over other loafs</li><li>Bake in a 350 F oven for 35-40 minutes or until a wooden pick inserted near the center of each loaf comes out clean.</li><li>Cool the loaves in the pans on wire racks for 10 minutes. Remove the loaves from the pans. Cool thoroughly on the wire racks.</li><li>If you want a frosting on the bread (Recipe from Oh She Glows):  Mix 1 3/4 cups powdered sugar,  1/2 Cups of butter, 1 tsp vanilla, 1 Tbsp of Pumpkin Spice.  Beat together in a bowl until it is the mixture you like.  If it is to thick add milk to water it down.  I served the frosting as a side, for those who are watching there calories.  he he</li><li>Serving Size: 4 Mini Loafs</li><li>Number of Servings: 24 (6 slices per loaf)</li><li>Calories per serving:  85,  Fat:  2.6,  Sodium:  84,  Potassium:  119,  Carbs:  15,  Fiber:  2,  Sugar:  6.6,  Protein:  2</li></ol>","spoonacularId":644674,"ingredients":[],"createdAt":{"$date":"2024-09-27T19:54:16.631Z"},"__v":0}
{"_id":{"$oid":"66f70d68f1e5bc08307f3f32"},"likes":0,"title":"No-Bake Green Tea Tofu Cheesecake","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/653191-556x370.jpg","instructions":"Method:\nWrap tofu in cheesecloth and press out water from tofu by placing a heavy object on top for about 15 mins.\nSoak gelatine powder in water and leave aside for about 5 minutes.\nMix green tea powder with 5 tbsp hot water. Set aside.\nIn a food processor,  blend cream cheese,  tofu, yogurt, soya milk, icing sugar and vanilla till very smooth.\nHeat gelatine powder mixture in a double boiler till melted and add to cream cheese mixture and blend well.\nPour 3/4 cream cheese mixture into one bowl and 1/4 to another. Mix green tea mixture to 1/4 plain filling, mix well.\nSpoon plain and green tea cream cheese filling alternately into pan, till all the mixtures are used up and gently shake the pan a little.\nTo make swirls,  gently run a chopstick in circular motion.\nChill cake in refrigerator for at least 4 hours or overnight.\nFor perfect slices, cut cheesecake with a hot knife.","spoonacularId":653191,"ingredients":[],"createdAt":{"$date":"2024-09-27T19:54:16.632Z"},"__v":0}
{"_id":{"$oid":"66f70d68f1e5bc08307f3f33"},"likes":0,"title":"Gluten Free Dairy Free Sugar Free Chinese Chicken Salad","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/644826-556x370.jpg","instructions":"<ol><li>For the salad:</li><li>Finely slice the red, and green cabbage.</li><li>Remove ends and finely slice romaine lettuce.</li><li>Trim ends of scallions (white and green side) and finely slice.</li><li>Peel and grate carrots, or put into a mini food processor to finely chop.</li><li>Peel clementines then remove pith from slices.</li><li>Add all the ingredients into a large serving bowl.</li><li>For the dressing:</li><li>Add all the ingredients into a glass jar and shake until well blended, or whisk all the ingredients in a mixing bowl.</li><li>Pour dressing over salad, toss to combine well.</li><li>If making ahead, dress the salad just before serving.</li></ol>","spoonacularId":644826,"ingredients":[],"createdAt":{"$date":"2024-09-27T19:54:16.633Z"},"__v":0}
{"_id":{"$oid":"66f70d68f1e5bc08307f3f34"},"likes":0,"title":"Strawberry Shortcake Pancakes","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/661886-556x370.jpg","instructions":"Mix Greek Yogurt, Egg Whites & Almond Extract into a small bowl\nIn a separate bowl combine Flour, Baking Soda, Sugar, & Salt\nCombine and whisk till evenly mixed\nFold in Dried Strawberries\nIn a sauce pan or small pot add frozen or fresh strawberries and 1tsp. sugar and cook until thawed and juicy about 5-7 minutes, stirring occasionally.\nSpray Skillet with cooking spray and place 1/4-cup batter onto skillet and cook till bubbles start appearing through the top of the pancake and then flip. NOTE: Cook on medium heat and I flattened out my batter with the spatula to cook more evenly.\nAbout 1-2 minutes on each side\nTop with strawberry Sauce and Maple Syrup, and add a dollop of fat free whip cream.\nMakes 2 servings, 8 pancakes total, 4 pancakes each.","spoonacularId":661886,"ingredients":[],"createdAt":{"$date":"2024-09-27T19:54:16.634Z"},"__v":0}
{"_id":{"$oid":"66f70ec1f1e5bc08307f3f37"},"likes":0,"title":"Corn Chowder with Potatoes, Poblanos, and Smoked Gouda","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/640077-556x370.jpg","instructions":"<ol><li>In a large saut pan, melt the butter over medium heat and saut the onion for about 10 minutes, or until lightly browned.</li><li>Transfer the onion to a 7-quart slow cooker and add the potatoes, bay leaf, thyme, and water. Cover and cook on LOW for about 4 hours, or until the potatoes are tender.</li><li>Mash some of the potatoes against the inside of the cooker or use a handheld immersion blender to puree a small amount of potato and thicken the soup slightly.</li><li>Add the corn, chiles, half-and-half, and  cup of the cheddar. Add the salt to taste and continue cooking for 20 to 30 minutes, or just until all the ingredients are hot.</li><li>Ladle the soup into bowls and garnish each bowl with the remaining cheddar and chopped chives.</li></ol>","spoonacularId":640077,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:00:01.46Z"},"__v":0}
{"_id":{"$oid":"66f70ec1f1e5bc08307f3f38"},"likes":0,"title":"Farro With Mushrooms and Asparagus","readyInMinutes":75,"servings":4,"image":"https://img.spoonacular.com/recipes/642605-556x370.jpg","instructions":"<ol><li>In a small bowl, cover dried mushrooms with warm water.  Soak for 25 minutes, or until softened.</li><li>Drain the mushrooms, and discard the soaking water.  Chop finely.</li><li>Bring a large pot of water to a boil.</li><li>Add farro, and cook for 10 minutes, stirring occasionally.  Drain and reserve.</li><li>In a large skillet, over medium heat, heat the olive oil, and add onion, garlic, thyme, and mushrooms.</li><li>Cook, stirring occasionally, for 5 minutes or until onions are tender.</li><li>Stir in 2 tablespoons of sherry vinegar, and continue cooking for 1 minute.</li><li>Add chicken stock, and bring it to a boil.</li><li>Stir in farro, and return to a boil.</li><li>Lower the heat to a simmer, and cover with a tight fitting lid.  Cook for 10 minutes.</li><li>Add asparagus, and cook, covered, for an additional 10 minutes.</li><li>Season with 1 tablespoon sherry vinegar, salt and pepper.</li></ol>","spoonacularId":642605,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:00:01.46Z"},"__v":0}
{"_id":{"$oid":"66f70ec1f1e5bc08307f3f39"},"likes":0,"title":"Cheesy Turkey Meatballs","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/637690-556x370.jpg","instructions":"<ol><li>Add together in a large bowl your turkey, breadcrumbs, egg, salt, Worcestershire, milk, carrot, onion, cheese, garlic and pepper.</li><li>Mix it together well.  I actually use my hands to mix it together (after a good washing of course).  Its just easier and youre going to need to get dirty anyway to make the meatballs.  Once youve mixed it up good, grab small handfuls of your meat mixture, roll them into balls.</li><li>Heat up about a tablespoon of oil in a large skillet on medium high heat.  When the oil is heated up, drop your balls into the pan.</li><li>Cook for about 5 to 10 minutes, flipping to all sides, until they are cooked through.  Once they are cooked up, drain any leftover oil and add in your bbq sauce.</li><li>Heat and serve.</li></ol>","spoonacularId":637690,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:00:01.461Z"},"__v":0}
{"_id":{"$oid":"66f70ec1f1e5bc08307f3f3a"},"likes":0,"title":"The Blarney Burger","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/663252-556x370.jpg","instructions":"Irish Mustard Sauce: 1 tbsp cornstarch, 2 tsp sugar, 1 tsp dry mustard, 1/2 tsp salt, 1 cup water, 1 tbsp butter, 1/4 cup vinegar, 1 tsp horseradish, 2 egg yolks, beaten. Put all ingredients in a sauce pan over medium heat. Continue whisking until smooth and thickened to consistency of pudding.\nGorgonzola Butter-Wash: In a microwave safe bowl, add remaining tablespoon of Gorgonzola crumbles and 2 tablespoons of butter and melt.\nWhisk together to create a Gorgonzola butter-wash.\nBrush Gorgonzola butter-wash on the inside of the top & bottom buns and toast on the upper or outer edges of grill. Once rolls are lightly toasted, remove.\nMeat: Mix first 7 ingredients together thoroughly then add salt & pepper. Form patties and pat together well.\nCook meat over medium heat - be sure to coat grill with non-stick spray.\nCook about 8-10 minutes on each side.\nSet meat on bottom bun and spoon Irish mustard sauce on top of meat patty.\nAdd shredded cabbage and fold top and bottom together.","spoonacularId":663252,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:00:01.461Z"},"__v":0}
{"_id":{"$oid":"66f70ec1f1e5bc08307f3f3b"},"likes":0,"title":"Roma Tomato Bruschetta","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/658753-556x370.jpg","instructions":"<ol><li>Slice the bread on a bias about 1/2 inch thick. We need about 10-12 slices.</li><li>Take 2 tablespoons of extra virgin olive oil and add salt and pepper (about 1/3 teaspoon each - as per taste).</li><li>Brush this on both sides of the bread.</li><li>Place these slices on a sheet pan and bake for about 3-4 minutes in a 400 degree preheated oven till golden brown. Once one side is done, turn over the crostini to the other side to crisp that as well.</li><li>When the crostini are hot out the oven, rub a garlic clove on them.</li><li>Chop the tomatoes.</li><li>Chiffonade the basil and add to the tomatoes.</li><li>Add salt, pepper, olive oil and balsamic vinegar and let it rest for a few minutes.</li><li>Put a generous amount of tomato on the crostini and serve.</li></ol>","spoonacularId":658753,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:00:01.461Z"},"__v":0}
{"_id":{"$oid":"66f70f3c1dfbcf1513894c2a"},"likes":1,"title":"Almond and cranberry shortbread","readyInMinutes":45,"servings":10,"image":"https://img.spoonacular.com/recipes/632091-556x370.jpg","instructions":"Cream the butter for about 5 minutes until fluffy. Add powdered sugar, continue beating until the mixture is shiny and smooth.\nAdd the yolks and lemon juice and whisk until fully incorporated.\nMix flour and almonds and gradually add to the butter mixture. Mix until the doug has consistency of a thick paste. Do not overmix (too much mixing makes the cookies hard).\nAdd dried cranberries by kneading by hand.\nDivide the dough into two equal parts, shape each part into a 20-22 cm long roll.\nRoll each of the rolls in chopped almonds and/ or pistachios sprinkled over two aluminum sheets long enough to wrap the roll of dough. With fingers lightly press the roll towards the center to remove any air bubbles or cracks from the dough.\nWrap each roll in foil, twist the ends and place in the refrigerator for several hours, preferably overnight.\nRemove foil from a roll of dough (keep the other cool until use) and place on a cutting board. With a large, sharp knife cut the roll  into 5-6 mm wide slices.\nPlace the slices well apart, on a baking sheet covered with parchment paper. Bake the cookies in the oven preheated to 180C for about 12 min (be careful not to burn them). Let them cool on the sheet for about 5 minutes, then transfer to a rack or a plate to cool fully. Repeat with the second roll of dough.\nStore the cookies in an airtight container.","spoonacularId":632091,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:02:04.217Z"},"__v":0}
{"_id":{"$oid":"66f70f3c1dfbcf1513894c2b"},"likes":0,"title":"Creamy Mushrooms Over Soba Noodles (Vegan)","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/640666-556x370.jpg","instructions":"<ol><li>Melt 1 tbs of the Earth Balance in a saute pan.</li><li>Add mushrooms & garlic stirring until the mushrooms are dark and reduced.</li><li>Set the mushrooms aside.</li><li>In the same pan, melt the second tbs of Earth Balance and stir in the flour.  </li><li>Cook stirring for about a minute, making a roux to thicken your sauce.</li><li>  Slowly add the soy milk, stirring until it is smooth and thickened.</li><li>Add the mushrooms, lemon juice, thyme, salt, & pepper</li><li> Add a 1/4 cup of white wine.</li><li>And cook until reduced and sauce has a pleasant consistency</li><li>Divide the cooked soba noodles into bowls</li><li>Ladle the sauce over soba noodles.</li><li>Garnish with sprigs of fresh thyme if you like.</li><li>Enjoy!</li></ol>","spoonacularId":640666,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:02:04.218Z"},"__v":0}
{"_id":{"$oid":"66f70f3c1dfbcf1513894c2c"},"likes":0,"title":"How to Cook Sweet Potatoes on the Grill","readyInMinutes":40,"servings":6,"image":"https://img.spoonacular.com/recipes/1077392-556x370.jpg","instructions":"Instructions\n\nHeat up the grill to 350 degrees. \n\nSlice the sweet potatoes into 1\" rounds.\n\nSpray both sides of the sweet potatoes with butter and sprinkle with cinnamon. \n\nPlace foil over the grilling grates and place the sweet potatoes directly onto the foil. \n\nSpray the sweet potatoes again with a little butter. (To keep the potatoes from sticking to the foil)\n\nClose the grill lid and cook for about 30 minutes. Make sure to turn and flip the sweet potatoes every 10 minutes and add additional sprays of butter to keep from sticking.","spoonacularId":1077392,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:02:04.218Z"},"__v":0}
{"_id":{"$oid":"66f70f3c1dfbcf1513894c2d"},"likes":0,"title":"Dad’s Breakfast Polenta","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/641185-556x370.jpg","instructions":"Prepare polenta according to package directions. (Be sure to season with some salt and pepper as well!)\nMeanwhile, cut bacon into small pieces and brown in a skillet with 1 tablespoon olive oil, on medium-high heat, until brown and crispy.\nRemove the bacon and reserve for later.\nDepending on your preference, you can either clean the pan and use 1 tablespoon olive oil, or you can cook the remaining veggies with a tablespoon of the bacon fat.)\nAdd turkey sausage and bell pepper and saut until sausage is browned and cooked through. Add green onions, bacon, salt and pepper and saut for 5 more minutes.\nAdd polenta to the meat and vegetables and stir to combine. Slowly stir in feta. Serve warm.","spoonacularId":641185,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:02:04.219Z"},"__v":0}
{"_id":{"$oid":"66f70f3c1dfbcf1513894c2e"},"likes":0,"title":"French Onion Marsala Soup","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/643362-556x370.jpg","instructions":"Melt butter with olive oil in a large pot over medium heat. Add onions and stir continually until translucent. Add beef broth, marsala and thyme. Simmer for 30 minutes. Add sugar and season with salt and pepper. Be careful not to over salt!\nLadle soup into oven-safe bowls and place a handful of croutons in each. Sprinkle parmesan and swiss cheese and layer 2 slices of provolone on top. Place bowls on cookie sheet and broil in the preheated oven until cheese bubbles and browns.","spoonacularId":643362,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:02:04.219Z"},"__v":0}
{"_id":{"$oid":"66f7156c5147e93e50701193"},"likes":0,"title":"Pasta With Salmon Cream Sauce","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/654944-556x370.jpg","instructions":"<ol><li>Calories per serving: 300 In large pot of boiling water, cook pasta al dente (tender but firm) about 10 12 minutes. Drain and return to pot. In saucepan, melt butter over medium heat add onion and cook until tender.</li><li>Stir in flour and cook for a few seconds. Whisk in milk and bring to sa simmer, stirring constantly. Add peas, salmon brokin into chunks and salmon juices, parsley, cheese, pepper. Pour mixture over pasta and stir gently to mix. Serve Immediately. Microwave method: Cook pasta as above in glass bowl or 4 cup measure. Microwave butter and onion at Medium-High for 1 minute or until onion is tender. Stir in flour to form smooth paste. Gradually whisk in milk. </li></ol>","spoonacularId":654944,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:28:28.902Z"},"__v":0}
{"_id":{"$oid":"66f7156c5147e93e50701194"},"likes":0,"title":"Plantain Toffee Balls","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/716334-556x370.jpg","instructions":"Peel and mash your plantain till soft. Mix it with the flour, form mini balls and place in the oven to bake for about 20-25 minutes. Please note the plantain mix will still be moist so use a spoon to help form the balls if you are having difficulty with that. Make sure to drizzle oil on the baking sheet so it does not stick to the sheet when it begins to caramelize. If you do not have an oven you can choose to fry the plantain balls as well. I have not tried the frying method but make sure to dab off the excess oil from the plantain.In a separate pot, on very low heat, melt the butter and pour in the sugar, vanilla, milk and water and stir. Leave it on very low heat throughout. Stir once in a while and if you have a candy thermometer, it is ready at 240F. If you do not, the toffee base is ready when it turns light brown like a caramel colour.Dip the plantain balls and swirl and place on a plate to cool. While its still warm, sprinkle your toppings on it. In this case, my toppings were coconut flakes. Serve when it’s cool.","spoonacularId":716334,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:28:28.903Z"},"__v":0}
{"_id":{"$oid":"66f715a65147e93e50701199"},"likes":1,"title":"How to Make the Cheesiest Bowtie Mac and Cheese","readyInMinutes":35,"servings":4,"image":"https://img.spoonacular.com/recipes/715595-556x370.jpg","instructions":"Instructions\n\nStep 1: Heat your oven to 350 degrees Fahrenheit, and then cook your pasta as directed. Drain.\n\nStep 2: Shred the cheese. Add cooked noodles, cheese, sour cream, salt and pepper, and butter to a medium mixing bowl and stir until combined.\n\nStep 3: Add to a 9 x 13 prepared casserole dish, top with extra cheese if desired, and bake for 20 minutes.\n\nStep 4: Remove from oven and serve hot.","spoonacularId":715595,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:29:26.166Z"},"__v":0}
{"_id":{"$oid":"66f715a65147e93e5070119a"},"likes":0,"title":"Ginger Garlic Chili Salmon","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/644581-556x370.jpg","instructions":"Season both sides of salmon fillets with salt and pepper. Chop green onions and put them aside. In a bowl, combine minced ginger, crushed garlic, brown sugar, rice vinegar, hot chili sauce, soy sauce and water. This is the sauce for simmering the salmon.\nIn a deep skillet, pan sear the salmon on medium high heat for 4-5 minutes or until it's almost half done on the side. Flip the salmon to the other side and sear for 2 minutes.\nPour in the sauce when the salmon is still slightly raw in the middle, and let it simmer for 10 minutes on medium heat. When the sauce is reduced, add in the chopped green onions. Continuously scoop the sauce over the salmon for at least one minute to let the top side of the salmon absorb the sauce.\nRemove the salmon carefully from the skillet and transfer to a dish. If the sauce is not reduced to the desired consistency, leave it in the skillet and let it continue to reduce. Pour the sauce over the salmon and serve.","spoonacularId":644581,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:29:26.166Z"},"__v":0}
{"_id":{"$oid":"66f715a65147e93e5070119b"},"likes":0,"title":"Cheddar Pecan Cocktail Biscotti","readyInMinutes":45,"servings":36,"image":"https://img.spoonacular.com/recipes/637513-556x370.jpg","instructions":"Preheat the oven to 350F.\nLine a baking sheet with parchment paper.\nIn a large bowl whisk together flour, cornmeal, baking powder, cayenne pepper, and salt. Stir in the grated cheese and pecans.\nIn another bowl, combine the eggs, mustard, honey, and 1 tablespoon of milk. Beat until thoroughly blended.\nAdd the wet ingredients to the dry. Mix until the dough is too stiff to stir. Use your hands to bring it together in the bowl. Add the second tablespoon of milk if its too dry.\nForm the dough into two 3-inch-wide loaves. Place about 3 inches apart on the lined baking sheet. Smooth the loaves with damp hands.\nBake for 25-30 minutes, until lightly golden. Cool for 20 minutes.\nReduce the oven temperature to 300F.\nCut the cooled loaves into 1/2-inch-thick slices. Place on baking sheet. Bake for 10 minutes. Turn the cookies over. Return to oven and bake for another 10 minutes, or until golden brown.\nCool on a wire rack. Store in an airtight container.","spoonacularId":637513,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:29:26.168Z"},"__v":0}
{"_id":{"$oid":"66f715a65147e93e5070119c"},"likes":0,"title":"Steamy Creamy Mushroom Risotto","readyInMinutes":35,"servings":2,"image":"https://img.spoonacular.com/recipes/157375-556x370.jpg","instructions":"<ol><li>Fry the chicken and the mushrooms and set aside.</li><li>Fry the rice in a pan in the oil for a minute. Start boiling water and prepare the chicken broth in a separate saucepan.</li><li>Start adding chicken broth water and the wine little by little to the rice and simmer at medium heat until the rice is cooked.</li><li>Once the rice is done, add the butter, the chicken, and the mushrooms and blend them in. Add the parmesan, salt, and pepper and stir one last time before you serve.</li></ol>","spoonacularId":157375,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:29:26.168Z"},"__v":0}
{"_id":{"$oid":"66f715a65147e93e5070119d"},"likes":0,"title":"Polla alla Parmigiana: Chicken Parmesan","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/656571-556x370.jpg","instructions":"<ol><li>Preheat oven at 350</li><li>Pound the chicken breast or tights until they are even and  inch thick.</li><li>On a shallow dish combine the flour, salt and pepper. On a second dish, beat the eggs with 1 tablespoon of water. On a third dish, combine the bread crumbs, panko, marjoram and parmesan cheese.</li><li>Coat the chicken on both sides with the flour mixture, shaking off any excess, then dip both sides into the egg mixture and dredge both sides in the bread crumbs mixture.</li><li>Heat the oil in a large saute pan and cook breaded thighs on medium high for 2 to 3 minutes on each side, until the chicken is golden brown on each side. Do not overcrowd the skillet. Remove and place in a cookie sheet.</li><li>Smear tomato sauce over the chicken and top with a mozzarella slice.</li><li>Place in the oven and cook until the mozzarella has melted.</li></ol>","spoonacularId":656571,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:29:26.169Z"},"__v":0}
{"_id":{"$oid":"66f718845147e93e507011a5"},"likes":1,"title":"Ditalini with peas","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/641543-556x370.jpg","instructions":"<ol><li>Place the onion in the cold olive oil and soften without colouring. Add a teaspoon of water from time to time to stop it frying and colouring. Cook till wilted and opaque, about 10 minutes.</li><li>Add the peas and enough water to just cover. Season with salt and pepper and cook till tender, 5 to 15 minutes for fresh peas depending on freshness and size or 10 minutes for frozen.</li><li>Just before the peas are done, add the diced pancetta and ham, stir through and turn the heat off.</li><li>Stir in the turmeric liquor and add the ricotta sieving it through a colander. Ricotta has to melt into the cooking liquids so it becomes a golden sauce.  Keep warm until the pasta is done.</li><li>Meanwhile cook pasta according to the manufacturer's instructions.</li><li>Drain the pasta and save some of the cooking pasta water for the sauce. If it seems dry, add the water to dilute it.</li><li>Immediately toss the cooked pasta in the saut pan so it is thoroughly coated with the sauce and serve at once with the grated Parmesan or Grana Padano cheese.</li></ol>","spoonacularId":641543,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:41:40.52Z"},"__v":0}
{"_id":{"$oid":"66f718845147e93e507011a6"},"likes":0,"title":"Chicken Enchilada Chowder","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/638073-556x370.jpg","instructions":"In a 5 quart slow cooker combine black beans, tomatoes, corn, onion, peppers and chilies. In a large bowl mix together the cream of chicken soup and enchilada sauce, gradually whisk in the milk until smooth. Lay the chicken on top of the veggie mixture and top with the soup mixture, cover and cook on low for 6-8 hours or on high for 3-4 hours. When the chowder is ready pull out the chicken and shred the meat, then place the meat back into the slow cooker and stir in the cheese. Let the chowder cook until all of the cheese is melted. Ladle into bowls and top with sour cream and tortilla chips.","spoonacularId":638073,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:41:40.52Z"},"__v":0}
{"_id":{"$oid":"66f718845147e93e507011a7"},"likes":0,"title":"Brown Sugar Sponge Cookie w/ Chocolate Covered Caramels","readyInMinutes":45,"servings":24,"image":"https://img.spoonacular.com/recipes/636315-556x370.jpg","instructions":"<ol><li>Preheat the oven to 375 degrees. Line baking sheets with parchment paper and spray with nonstick cooking spray.</li><li>In the bowl of a stand mixer on medium speed, beat the egg whites until foamy. Add the baking powder, salt and sugar and continue beating on medium speed until stiff peaks form.</li><li>In another bowl combine egg yolks, vanilla and lemon zest, beat with fork until thoroughly mixed. Fold the yolks into the egg white mixture just until combined.</li><li>Sift the flour over the egg mixture and fold in until the batter is smooth and light. Drop just about 2 teaspoons of batter for each cookie about 2 inches apart onto baking sheets. Top each off with a Rolo in the center and press down lightly.</li><li>Bake for 12 minutes or until golden. Cool on the sheets for 5 minutes then move to racks to cool completely.</li></ol>","spoonacularId":636315,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:41:40.52Z"},"__v":0}
{"_id":{"$oid":"66f718845147e93e507011a8"},"likes":0,"title":"Strawberry Shortcake with Homemade Donuts","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/661889-556x370.jpg","instructions":"<ol><li>Mix cake flour, baking powder and salt together.  I don't like nutmeg so much, but if you do add it now!  Set aside.</li><li>In your mixer, blend the Shortening (I used plain Crisco) and sugar together on low speed until \"sandy\".</li><li>Now blend in the egg yolks on low speed about 1 minute.</li><li>Alternate mixing in your dry ingredients (the flour combo) and the sour cream.  Be sure to scrape down the sides every now and then too.</li><li>Add the vanilla extract last and mix until incorporated.</li><li>Cover the batter and let sit in the fridge for 15-20 minutes.</li><li>Preheat your oven to 350.  Spoon your batter into a ziplock bag to use the corner as a piping bag.  It's a lot easier this way I promise!  Pipe dough into a greased donut pan.</li><li>Bake for 10-12 minutes.</li><li>While baking, prepare the icing for the donuts.  In a saucepan over low heat warm the milk and then whisk in the confectioners sugar until smooth.  That's it!</li><li>Dip the slightly cool donuts in the icing or spoon icing over the top, whatever works for you.</li><li>Now to go completely wild, cut the donut in half (like an english muffin).  Slice up some strawberries and add some whip cream.</li><li>Pure bliss.</li><li>These donuts are super light and airy.  The strawberries and whip cream just go perfectly, it's borderline life changing.</li></ol>","spoonacularId":661889,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:41:40.52Z"},"__v":0}
{"_id":{"$oid":"66f718845147e93e507011a9"},"likes":0,"title":"Raw Vegan Blueberry Chocolate Crust \"Cheesecake","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/658004-556x370.jpg","instructions":"<ol><li> Crust:  Place raw nuts, cacao powder, and dates in the food processor and process for a minute or two.  Then, place in a small pie pan or any small baking pan and press down to make the crust.</li><li> Filling: Place all the filling ingredients (cashews, vanilla extract, lemon juice, water, raw agave, coconut oil, lecithin, salt, and blueberries) in the processor.   Process for a good 3 to 5 minutes, or until the filling is nice and smooth.  Place over the crust in the pan, then FREEZE for a few hours or until it is firm.</li><li> Enjoy!</li></ol>","spoonacularId":658004,"ingredients":[],"createdAt":{"$date":"2024-09-27T20:41:40.52Z"},"__v":0}
{"_id":{"$oid":"66f94b599e8e8e2dbd471ded"},"likes":0,"title":"Rustic Brie Toasts with Wild Mushroom, Cranberry and Shallot","readyInMinutes":45,"servings":10,"image":"https://img.spoonacular.com/recipes/658914-556x370.jpg","instructions":"Start by pre-heating your oven to 350 degrees.  While the oven is pre-heating, heat the olive oil in a saut pan and add the shallot, diced mushroom, cranberry and thyme.  Saut for a few minutes until the shallot begins to wilt and then season with salt and pepper and set aside to cool.\nSlice 12 pieces of brie and place each piece on the bread.  Follow with a spoonful of the cranberry, mushroom and shallot mixture and place on an oiled cookie sheet. Bake the toasts for 15 minutes or just until the brie melts.","spoonacularId":658914,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:43:05.219Z"},"__v":0}
{"_id":{"$oid":"66f94b599e8e8e2dbd471dee"},"likes":0,"title":"Buckwheat Banana Pancakes","readyInMinutes":30,"servings":1,"image":"https://img.spoonacular.com/recipes/636385-556x370.jpg","instructions":"<ol><li>Preheat a large skillet over medium heat for 3-5 minutes while you make the batter.</li><li>Whisk together the flours, flax seed, baking powder, baking soda and salt. Add the yogurt, milk, maple syrup, vanilla and oil, if using. Mix until smooth (there is no gluten in this batter, so no worries about over-mixing and creating tough pancakes). Batter should be thick, but if you like thinner pancakes, add an additional tablespoon or two of milk. Fold in sliced bananas.</li><li>Grease with a few drops of oil and spread around the pan. Add batter,  cup at a time (batter should sizzle when it hits the pan). Cook for about 2 minutes on each side (the first pancakes will take the longest to cook) and serve warm, with lots of maple syrup, additional bananas, nuts, chocolate chips, etc.</li></ol>","spoonacularId":636385,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:43:05.22Z"},"__v":0}
{"_id":{"$oid":"66f94b599e8e8e2dbd471def"},"likes":0,"title":"Kale and Roasted Sweet Potato Soup with Chicken Sausage","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/648721-556x370.jpg","instructions":"Place cubed sweet potatoes in a baking pan or dish. Season with salt and pepper and coat with olive oil.\nBake for 20  25 minutes, until soft. Remove from oven and set aside.\nIn a dutch oven over medium heat, warm some olive oil.\nCook the chicken sausage until just browned.\nAdd in onion and mushrooms and cook for about 3  5 minutes, until softened.\nAdd in garlic, thyme, coriander, some sea salt and black pepper. Stir in and cook for about 1 minute.\nPour in chicken stock and bring to a boil.\nReduce heat and simmer for about 5  10 minutes.\nAdd in roasted sweet potatoes and kale.\nPush the kale down into the soup so its submerged. Cook for about 3  5 minutes, until bright green and tender.","spoonacularId":648721,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:43:05.221Z"},"__v":0}
{"_id":{"$oid":"66f94b599e8e8e2dbd471df0"},"likes":0,"title":"Peanut Butter Cookie Bars","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/655279-556x370.jpg","instructions":"<ol><li>Preheat oven to 375 degrees. </li><li>In a small bowl with melted butter, beat in the brown sugar, granulated sugar, peanut butter and eggs. Set aside. </li><li>In a separate bowl, combine the flour, bran, oats and baking soda. Stir mixture into butter mixture. </li><li>In a glass baking dishes, press out half of dough mixture into each. Sprinkle peanut butter candy pieces across top of dough mixture. Cook until done, testing with toothpick, approximately 19 minutes. </li><li>Cook the rest of the batter, if desired or refrigerate for another time. Remove to rack to cool.To serve, cut into bars.</li></ol>","spoonacularId":655279,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:43:05.222Z"},"__v":0}
{"_id":{"$oid":"66f94b599e8e8e2dbd471df1"},"likes":0,"title":"Bruschetta Stuffed Potatoes","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/636356-556x370.jpg","instructions":"Preheat oven to 350 F. Generously coat skins of potatoes with oil (will make skin crispy). Bake for 1 to 1 1/2 hours or until tender.\nWhile potatoes are baking in the oven chop & mix together the red onion, tomato, garlic, fresh basil & cheese in a small bowl. Set aside.\nWhen potatoes are done cut small slices off the top of each potato, scoop out the soft flesh and place in a large bowl. Place empty shells on a baking sheet and turn oven down to 150 F.\nMix and mash in cultured dairy, butter & olive oil. Pour bruschetta mixture in and stir well. Season to taste with sea salt and pepper.\nSpoon the bruschetta potato mixture back into the shells and return them to the oven to keep warm. If potatoes are not reheated to a high temperature, the enzymes in the dairy will be preserved.","spoonacularId":636356,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:43:05.222Z"},"__v":0}
{"_id":{"$oid":"66f94c169e8e8e2dbd471df4"},"likes":0,"title":"Turkey and Rice Stuffed Acorn Squash","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/663985-556x370.jpg","instructions":"Prepare rice according to package instructions. (I either cook the rice in chicken stock, or this time I used water and added 1 tablespoon vegeta seasoning to the water to add flavor to the rice as it cooks.)\nMeanwhile preheat oven to 375 degrees. Cut squash in half and drizzle with olive oil, salt and pepper. Roast skin side down for 30 minutes.\nHeat 1 tablespoon olive oil in large skilled. Add diced onions. Cook until translucent. Add garlic and cook for 1 minute longer. Add turkey, 1 tablespoon vegeta, red pepper, salt and pepper. Cook until turkey is browned and almost cooked through. Rough chop the mushrooms and add to the pan. Cook until mushrooms are softened. Add rice and spinach and stir until spinach is just wilted.\nStuff the squash with the meat and rice mixture and top with bread crumbs. (Either toss bread crumbs with 2 teaspoons olive oil, or I just spray them with spray olive oil to make sure that they brown in the oven.\nBake stuffed squash in oven until bread crumbs are browned.","spoonacularId":663985,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:46:14.088Z"},"__v":0}
{"_id":{"$oid":"66f94c169e8e8e2dbd471df5"},"likes":0,"title":"Classic French Onion Soup","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/639597-556x370.jpg","instructions":"Preheat oven to 400\nIn a large Dutch oven, melt butter over medium heat.\nAdd onions to the pot and sprinkle with flour. Reduce heat to medium low and cook for 45 minutes stirring occasionally. If the onions are cooking too quickly, reduce heat.\nWhen the onions are tender and golden in colour, de-glaze the pan with sherry.\nPour beef broth into the pot and bring to a boil over medium heat. Add herbs, salt and pepper to taste.\nReduce heat and simmer for 15 minutes.\nSpray a cookie sheet with cooking spray. Butter slices of French bread and bake in the oven for 5-10 minutes until very dry. Set aside.\nRemove herb stalks and bay leaf.\nLadle soup portions into four oven safe ramekins. Top with crusty French bread and sprinkle with cheese. Place ramekins on a cookie sheet and bake uncovered at 400 for 5-10 minutes until cheese is bubbling. Broil for one minute more to brown the top.\nServe warm.\nServes 4","spoonacularId":639597,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:46:14.088Z"},"__v":0}
{"_id":{"$oid":"66f94c169e8e8e2dbd471df6"},"likes":0,"title":"My \"Secret\" Bolognese Sauce","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/652819-556x370.jpg","instructions":"In a large, heavy dutch oven or stock pot, heat olive oil over med/high heat.  Add the ground veal being careful not to crowd the pot.  Cook over med/high heat until browned and remove with a slotted spoon to a large bowl.  Drain all but 2 tablespoons of the fat, add the beef to the pot and cook until browned.  Remove with slotted spoon and add to the bowl with the veal.  Drain all but 2 tablespoons of fat and repeat with the pork.  Drain all the fat and brown the sausage.  Remove the sausage with the spoon and add to the meat mixture.  Do not drain the fat.\nAdd the diced onions and carrots to the pot and cook until the onions are translucent and softened stirring occasionally.  Add the garlic and oregano, continue to cook for about 1-2 minutes.  Add the wine to the pot and scrape any brown bits left on the bottom, stir and let the wine cook down for approximately 2-3 minutes.\nAdd the meat mixture to the onions and stir to combine.  Add all four cans of tomatoes and stir thoroughly.  Stir in the parsley, basil, sugar, salt and pepper.  Turn the heat down to low and simmer for approximately 2-3 hours stirring occasionally.  Before serving, taste the sauce for seasoning.since this is a large recipe you may need to adjust the sugar, salt and pepper to suit your tastes.","spoonacularId":652819,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:46:14.088Z"},"__v":0}
{"_id":{"$oid":"66f94c169e8e8e2dbd471df7"},"likes":0,"title":"Savory Carrot Souffle","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/659459-556x370.jpg","instructions":"<ol><li>Start by cooking the carrots in salted boiling water until tender. Once tender drain all the water and pulse/blend the carrots with 1/2 of the milk till smooth. Set aside.</li><li>In a small sauce pot start cooking the rest of the milk, heavy cream, flour, salt, butter, parmesan cheese, and nutmeg. Stir till thick consistency. Set aside to cool.</li><li>Start  by preheating oven to 350 degrees Farenheit. Whisk/beat the egg whites in a bowl till stiff peak. Set aside.</li><li>Mix the carrot puree and white sauce (bechamel) together and add in the yolks one at a time, then fold in the stiff egg whites. Pour mixture in pre-greased ramekins and set in a bain-marie (water bath). Bake for 1 hour.</li></ol>","spoonacularId":659459,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:46:14.088Z"},"__v":0}
{"_id":{"$oid":"66f94c169e8e8e2dbd471df8"},"likes":0,"title":"Poached Egg With Spinach and Tomato","readyInMinutes":20,"servings":2,"image":"https://img.spoonacular.com/recipes/656481-556x370.jpg","instructions":"<p>Take a wide skillet and fill it with enough water so the eggs can be submerged. Bring it up to a steady boil and then drop the temperature so it's at a steady simmer. Add the vinegar.</p><p>Break one egg into a bowl and slowly pour into the boiling water. Do the same with the second egg. Let it cook until the white is cooked around the yolk, about two to three minutes.</p><p>In the meanwhile, heat another wide frying pan and add some olive oil. Add the garlic and chilli and saut for about a minute until fragrant. Add the spinach, mix gently and cover. Cook for a minute and shut off the heat. Season to taste with salt and pepper. Separate amidst the two slices of toast and add some slices of tomato.</p><p>Top each bed of vegetables with a poached egg. Season with some salt and pepper. Serve immediately.</p>","spoonacularId":656481,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:46:14.089Z"},"__v":0}
{"_id":{"$oid":"66f94cf83de26d37e8deb9e1"},"likes":0,"title":"Raspberry Thumbprint Wholewheat Scones With Macadamia Nuts","readyInMinutes":45,"servings":20,"image":"https://img.spoonacular.com/recipes/657907-556x370.jpg","instructions":"Preheat oven to 400 F\nPlace oats in a food processor. Process until finely ground\nAdd flours, brown sugar, baking powder, baking soda, salt, cinnamon, and allspice to a food processor. Pulse 3 times\nAdd butter; pulse 5 times until mixture resembles coarse meal. Be very careful - Don't over beat.\nAdd 1 tsp vanilla and sour cream; pulse 3 times or just until combined ( DO NOT over-mix). If you're afraid you might over-mix, you can transfer the mixture into a big bowl and add sour cream and vanilla. Use spatula to mix. If you over-mix, the mixture will be too runny.\nAdd cranberries, and nuts. Use spatula to mix well.\nTurn dough out onto a lightly floured surface; knead lightly 3 times. Roll dough to a 1/2 inch thickness; cut with a 2 1/2 inch biscuit cutter\nPlace cut dough on a baking sheet. Use a watermelon scoop or small round spoon to press in a middle of each cut though to make a half hole for raspberry jam\nMix together jam and the remaining vanilla extract.\nAdd 1/2 teaspoon of jam into a hole. Don't over put it otherwise it will run all over a scone.\nBake for 14 minutes or until golden brown. Remove from baking sheet; transfer to a wire rack\nWhile they're cooling, combine powdered sugar and milk. Stir with a whisk until smooth. Drizzle the glaze evenly over scones.","spoonacularId":657907,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:50:00.715Z"},"__v":0}
{"_id":{"$oid":"66f94cf83de26d37e8deb9e2"},"likes":0,"title":"Bridget Jones's Shepherd's Pie","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/636096-556x370.jpg","instructions":"Preheat the oven to 180 C.\nIn a large frying pan, heat a little olive oil and fry the chopped onion and garlic.\nAdd the mince, stirring, until browned all over.\nWhile the meat is frying, break up any lumps with the back of the spoon.\nAdd the flour (this helps to thicken the juices) and stir.\nMix well and add the thyme and the rosemary and stir.\nAdd the chopped tomatoes and pour the stock mixture.\nAdd a pinch of salt and freshly ground black pepper and let it simmer for about 5 minutes.\nFor the mash, boil the potatoes, then drain them in a sieve and place into a clean bowl.\nAdd the milk, butter and egg yolk, and mash together.\nSeason with salt and freshly ground black pepper.\nPour the meat into an ovenproof dish and spread the mash on top, smooth over and mark with a spatula.\nPut the dish into the oven and cook until the surface is bubbling and golden-brown.","spoonacularId":636096,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:50:00.716Z"},"__v":0}
{"_id":{"$oid":"66f94cf83de26d37e8deb9e3"},"likes":0,"title":"Quinoa, Tomato, Green Onion Side Salad","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/657698-556x370.jpg","instructions":"<ol><li>Put your quinoa and your water in a pan. Heat over medium heat until bubbling, then cover and reduce heat to low. Cook for about 15 minutes or until all the water is absorbed.</li><li>While your quinoa is cooking, get out and wash your green onions and tomatoes. Chop them roughly.</li><li>Chop a lemon in half and squeeze one half's juice into a bowl, picking out the seeds.</li><li>Let your quinoa cool. A little warm is fine.</li><li>Add olive oil, lemon juice, and tomatoes and green onions to the pan. Stir.</li><li>Add salt and pepper to your liking.</li><li>Serve chilled</li></ol>","spoonacularId":657698,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:50:00.717Z"},"__v":0}
{"_id":{"$oid":"66f94cf83de26d37e8deb9e4"},"likes":0,"title":"Crunchy Lemon Dill Vegetable Dip","readyInMinutes":45,"servings":10,"image":"https://img.spoonacular.com/recipes/640956-556x370.jpg","instructions":"<ol><li>Mix sour cream, mayonnaise, lemon juice, lemon zest, chopped dill, minced scallions, minced carrots, chopped bell pepper, salt, and pepper.</li><li>Refrigerate.</li><li>Serve with vegetables, crackers, or whatever else you want.</li></ol>","spoonacularId":640956,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:50:00.718Z"},"__v":0}
{"_id":{"$oid":"66f94cf83de26d37e8deb9e5"},"likes":0,"title":"Spinach & Ham Quiche","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/661249-556x370.jpg","instructions":"<ol><li>With little oil, fry shallot till fragrant and golden brown.</li><li>Add ham fry for a while and add spinach and fry till spinach cooked, dish up and set aside.</li><li>Measure whipping cream and milk together in measuring cup (you can omit whipping cream and use all 160ml milk) add eggs, lightly beaten and pinch of salt, mix well.</li><li>Spread ham spinach and cheddar cheese evenly over the bottom of the prepared tart pan, add a dash of pepper then gently pour egg mixture over it.</li><li>Bake at preheated 180C for 40 mins and serve hot or warm.</li></ol>","spoonacularId":661249,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:50:00.719Z"},"__v":0}
{"_id":{"$oid":"66f94d5c3de26d37e8deb9e8"},"likes":0,"title":"Kahlua Tiramisu","readyInMinutes":45,"servings":11,"image":"https://img.spoonacular.com/recipes/648698-556x370.jpg","instructions":"Put the mascarpone, vanilla, Kahla and a little less than 1/2 of coffee in a medium mixing bowl, blend until everything is smoothly mixed together.\nIn another medium bowl, beat the cream with the icing sugar until smooth, then fold in the mascarpone mix.\nPlace the remaining coffee into large deep plate, quickly dip the biscuits flipping sides, one by one, enough to make one layer in a 11x7 casserole dish.\nSpread evenly half of the mascarpone mix on top.\nRepeat with another layer of biscuits and the rest of the mascarpone mix. Refrigerate.\nBefore serving, fill a small sieve with cocoa powder and lightly dust the top.\nIf you are fancy, grate some of bittersweet chocolate or make chocolate curls and scatter them all over","spoonacularId":648698,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:51:40.049Z"},"__v":0}
{"_id":{"$oid":"66f94d5c3de26d37e8deb9e9"},"likes":0,"title":"Buffalo Chicken Wings Wonton Wraps","readyInMinutes":45,"servings":20,"image":"https://img.spoonacular.com/recipes/636411-556x370.jpg","instructions":"Preheat oven to 350 degrees\nLine a baking sheet with parchment paper.\nCut your chicken into tiny pieces, as small as you can get it.\nIn a medium bowl add chicken, cream cheese, cheddar cheese and hot sauce. Mix together until well blended.\nIn a tiny bowl, add some water. This is for sealing the edges of your wontons.\nPlace 1 1/2 tsp. of mixture in won-ton wrapper, take your finger and dip in water and place along the edges of the wrapper (this will be the glue to seal the wrappers together). Fold wrapper over into triangle place on baking sheet, Do the same for the rest of the wrappers. Bake in over for 15 minutes, until lightly brown.\nServe with Light Blue Cheese or Ranch Dressing on the side.","spoonacularId":636411,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:51:40.05Z"},"__v":0}
{"_id":{"$oid":"66f94d5c3de26d37e8deb9ea"},"likes":0,"title":"Falafels With Tahini Sauce","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/642546-556x370.jpg","instructions":"Soak the garbanzo beans overnight -drain.\nIn a food processor add all the other ingredients except the flour and process until crumbly.\nPour into a large bowl, add the flour a a tablespoon at the time and mix well.\nKeep adding flour until you can easily form the mixture into balls or patties without them falling apart.\nPlace in the refridgerator and allow to chill while you make the Tahini Sauce.\nFor the Tahini Sauce\nPlace all the ingredients for the tahini sauce in the food processor and process until smooth, it should be a thin sauce.\nIf it becomes too thick add more water or if you really like the tang add more lemon juice.","spoonacularId":642546,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:51:40.05Z"},"__v":0}
{"_id":{"$oid":"66f94d5c3de26d37e8deb9eb"},"likes":0,"title":"Raspberry Walnut Coffee Cake","readyInMinutes":35,"servings":6,"image":"https://img.spoonacular.com/recipes/657917-556x370.jpg","instructions":"<ol><li>Preheat oven to 375 and grease an 8x8 pan.</li><li>Combine all wet ingredients (milk, flax, vanilla, syrup, oil). Let stand while grinding the walnuts. </li><li>Whisk together with the baking soda, cinnamon, and salt.</li><li>Pour half the batter into prepared pan. Using a spoon, dollop lines of jam across the batter and swirl into batter using a knife. Pour the rest of the batter on top.</li><li>Mix up the crumble topping: add the walnuts to a bag and crush until broken down into pea-sized crumbs. Toss with the oat flour, cinnamon, sugar and rolled oats if using. Stir in the tablespoon of oil until the everything starts to come together--mixture should be crumbly. Sprinkle the topping evenly across the top of the batter and bake for 25 minutes, or until browned on top and it springs back slightly when touched. Serve warm.</li></ol>","spoonacularId":657917,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:51:40.05Z"},"__v":0}
{"_id":{"$oid":"66f94d5c3de26d37e8deb9ec"},"likes":0,"title":"Simple Roast Chicken","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/660133-556x370.jpg","instructions":"Wash the chicken inside and out and pat dry. Make sure the skin is nice and dry so the skin gets crispy. Season well with salt and pepper inside, out and under the skin.\nMix the butter with the garlic, chilli and lemon rind. Season a bit with salt and pepper. Stuff the flavoured butter under the skin over the breast, legs and back. Stuff the lemon half into the cavity.\nPre-heat the oven to 400F. Toss the two kinds of potatoes in the bottom the the baking pan with the chilli, salt and pepper to taste and a generous helping of olive oil. Place a rack over the vegetables. Position the chicken breast side up on the rack.\nBake for the first 15 minutes at 400F. Then drop the temperature and continue to cook for about an hour at 300F.\nHalfway through cooking turn the chicken on its breast. Spoon over some of the juices.\nLater, to check for doneness, pierce the thickest part of the chicken (the thigh). If the juices run clear the chicken is ready, if not continue cooking.\nServe chicken on a platter on the bed of roasted potatoes.","spoonacularId":660133,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:51:40.051Z"},"__v":0}
{"_id":{"$oid":"66f94e063de26d37e8deb9ef"},"likes":0,"title":"Chicken Cordon Bleu","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/638035-556x370.jpg","instructions":"<ol><li>Preheat oven to 350 degrees F.</li><li>Butterfly the chicken breasts by slicing half lengthwise but not cutting all the way through. Lay the halved breasts between 2 pieces of plastic wrap. Using the flat side of a meat mallet, gently pound the chicken to 1/4-inch thickness, taking care to not tear or create holes in the meat.</li><li>Lay 2 slices of cheese on each breast, followed by 2 slices of ham, and 2 more of cheese; leaving a 1/2-inch margin on all sides to help seal the roll. Tuck in the sides of the breast and roll up tight like a jellyroll. Squeeze the log gently to seal.</li><li>Season the flour with salt and pepper; spread out on waxed paper or in a flat dish. Mix the breadcrumbs with thyme, kosher salt, pepper, and oil. The oil will help the crust brown. Beat together the eggs and water, the mixture should be fluid. Lightly dust the chicken with flour, then dip in the egg mixture. Gently coat in the bread crumbs.</li><li>Carefully transfer the roulades to a baking pan and bake for 20 minutes until browned and cooked through.</li><li>Serve whole or cut into pinwheels.</li></ol>","spoonacularId":638035,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:54:30.749Z"},"__v":0}
{"_id":{"$oid":"66f94e063de26d37e8deb9f0"},"likes":0,"title":"Hard-Boiled Egg Gratin In A Bechamel Sauce","readyInMinutes":45,"servings":3,"image":"https://img.spoonacular.com/recipes/646302-556x370.jpg","instructions":"<ol><li>Hard-boil the eggs: bring a saucepan of salted water to the boil. Add the eggs, reduce the heat and simmer for 10 minutes. Put the eggs into cold water until just cool enough to handle and then shell. (A trick for shelling hard-boiled eggs is to roll them with the palm of your hand on a hard surface to break up the shell and then peel them under a slow stream of running water.) Reserve the eggs in a bowl of warm water.</li><li>Melt the butter in a saucepan or small frying pan over low heat. Add the onion and cook, stirring frequently, until tender but not coloured.</li><li>Prepare the bchamel sauce: melt the butter in a medium heavy-bottomed saucepan over low heat. Add the flour and whisk for about 2 minutes; do not allow it to colour. Whisk in the milk and bring to the boil, whisking constantly to avoid lumps. Season with the nutmeg and salt and pepper to taste. Reduce the heat and simmer for 10 minutes, whisking constantly and scraping the bottom and sides of the pan to prevent the sauce from sticking. Stir in the cooked onions and cook for 5 minutes.</li><li>Heat the grill. Slice the eggs 1 cm (0.4 inch) thick. Spread a thin layer of the bchamel sauce over the bottom of the gratin dish. Layer the egg slices over the bchamel sauce and coat with the remaining sauce. Sprinkle with grated cheese, then grill, turning the dish if necessary to colour evenly, until the top is golden brown. Serve immediately.</li></ol>","spoonacularId":646302,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:54:30.751Z"},"__v":0}
{"_id":{"$oid":"66f94e063de26d37e8deb9f1"},"likes":0,"title":"Easy Chicken Cordon Bleu","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/641896-556x370.jpg","instructions":"Pre-heat oven into 180C.\nGently pound the chicken breast into 1/4 thickness using a meat mallet.\nSeason the chicken meat - sprinkle salt and ground pepper on both sides.\nPlace 1 ham and 2 cheese sticks on top of each breast (but I prefer putting on another 2 cheese sticks! i love cheese!) Roll up each breast an secure with a toothpick.\nDredge in flour. Then brush with beaten eggs. Then finally roll in bread crumbs mixture.\nBrush the baking pan with olive oil, then place the chicken rolls.\nBake for about 20 minutes. Then layer each rolls with butter cubes. Let the butter melts on its top, the roll will absorb its flavor and will give a really nice smell.\nBake for another 15 minutes.\nYou may serve this your favorite sauce.","spoonacularId":641896,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:54:30.751Z"},"__v":0}
{"_id":{"$oid":"66f94e063de26d37e8deb9f2"},"likes":0,"title":"Chicken Suya","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/716342-556x370.jpg","instructions":"Heat the oven to 500 F.Wash and season the chicken with the Suya spice, chilli powder, seasoning cubes, salt and drizzle the oil over it.Place the chicken in the oven and grill for 40 minutes. Check the chicken occasionally and flip on both sides so it can cook properly.Serve hot garnished with the onions and tomato and a bit of suya spice sprinkled over the chicken.","spoonacularId":716342,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:54:30.751Z"},"__v":0}
{"_id":{"$oid":"66f94e063de26d37e8deb9f3"},"likes":0,"title":"Cinnamon Twists","readyInMinutes":45,"servings":14,"image":"https://img.spoonacular.com/recipes/639492-556x370.jpg","instructions":"<ol><li>Combine 2 cups flour with yeast.</li><li>Heat and stir milk, butter or margarine, sugar and salt until warm and butter is almost completely melted.</li><li>Add this  to the flour mixture along with the eggs.</li><li>Beat with an electric mixer on low speed for 30 seconds, scraping the bowl, then beat on high speed for approx. 3 minutes. Stir in as much of the remaining flour ( 2 to 2 1/3 cups) as you can.</li><li>Turn out onto a lightly floured surface. Knead in enough remaining flour to make a moderately soft dough that is smooth and elastic (about 3 - 5 minutes). Shape into a ball. Place in a lightly greased bowl. Cover and let rise in a warm place till double in size. (About 1 hour)</li><li>Punch dough down. Divide in half. Cover and let rest 10 minutes.</li><li>Roll half of the dough into a 12x8 inch rectangle. Melt 3 tablespoons butter or margarine; brush half over the dough. combine 3/4 cup sugar and 2 1/2 teaspoons ground cinnamon; sprinkle half of the mixture over dough. Fold dough in half and then in half once more. Cut strips of dough along the short end and twist sealing the seams.</li><li>Place in a baking sheet. Cover; let rise till nearly double about 30 minutes.</li><li>Bake in a 375 degree oven for 20 to 25 minutes. (Be sure to check them, they brown easily.)</li><li>For the sugar glaze combine 1 cup sifted powdered sugar with 1/4 teaspoon vanilla and 1 tablespoon milk. Continue to add milk 1 teaspoon at a time until you get a drizzling consistency.</li></ol>","spoonacularId":639492,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:54:30.751Z"},"__v":0}
{"_id":{"$oid":"66f94eba19fd2d4329c9fe48"},"likes":0,"title":"Black Lentil and Couscous Salad","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/635126-556x370.jpg","instructions":"Whisk together the olive oil, apple cider vinegar, Dijon mustard, orange zest and juice and honey. Set aside.\nIn a large bowl, mix the remaining ingredients until well incorporated. Drizzle the dressing on top, toss and serve.","spoonacularId":635126,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:57:30.382Z"},"__v":0}
{"_id":{"$oid":"66f94eba19fd2d4329c9fe49"},"likes":0,"title":"Quinoa Tabbouleh Salad","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/657686-556x370.jpg","instructions":"Bring water to a boil in a medium saucepan. Add quinoa and stir. Cover and reduce heat. Allow quinoa to simmer on medium-low heat until all water is cooked off, about 20 minutes. Stir occasionally. Be careful not to burn your quinoa. Allow to cool.\nPlace cooled quinoa into a large bowl (preferably something with an airtight lid).\nAdd all remaining ingredients and gently stir until very well-mixed. Cover and refrigerate for at least an hour.\nStir again before serving.\nCan be stored, covered, in the refrigerator for two or three days. But it's best on the first day, when the veggies are still fresh and crisp!","spoonacularId":657686,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:57:30.383Z"},"__v":0}
{"_id":{"$oid":"66f94eba19fd2d4329c9fe4a"},"likes":0,"title":"Fried Yam and Spicy Mayo","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/716279-556x370.jpg","instructions":"Peel, rinse and slice your yam and set aside.In a pot of boiling water, place your sliced yam to cook for about 2-3 minutes.Strain in a sieve with paper towel to remove excess water and sprinkle your salt.Heat up your oil and deep fry your yam till golden brown.For the spicy mayo, mix the hot sauce and mayonnaise till both are completely blended and serve with the fried yam. If you would like to donate to Food Clique, please click hereSee Previous Post to learn about Food Clique","spoonacularId":716279,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:57:30.384Z"},"__v":0}
{"_id":{"$oid":"66f94eba19fd2d4329c9fe4b"},"likes":0,"title":"Smashed Fried Lemon Potatoes","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/660322-556x370.png","instructions":"<ol><li>In a large pot of salted water place the well-scrubbed potatoes. Bring to a boil and cook until the potatoes are tender, about 20 minutes. Drain the potatoes and rinse with cold water. Using the palm, or the back of a large spatula, press the potatoes until slightly mashed.</li><li>In a large skillet, heat the olive oil over medium high heat. Add the garlic and cook until slightly brown. Remove and toss. Add the potatoes and cook without stirring for about 5 to 10 minutes, the bottoms need to be a nice golden brown color. Using a spatula or cooking thongs, turn and cook another 5 to 8 minutes. Transfer to a plate.</li><li>In a bowl mix together the lemon zest, lemon juice, olive oil, rosemary, parsley, thyme, vinegar and sea salt. Add the potatoes and coat them well gently.</li></ol>","spoonacularId":660322,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:57:30.384Z"},"__v":0}
{"_id":{"$oid":"66f94eba19fd2d4329c9fe4c"},"likes":0,"title":"Steak with lemon and capers","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/661531-556x370.jpg","instructions":"<ol><li>Flatten the steaks lightly with a meat mallet.</li><li>Combine flour, salt and pepper, dip steaks into the mixture, coating both sides.</li><li>Saut the steaks in a hot mixture of butter and olive oil over medium heat, about 4 minutes on each side. Remove from the pan and set aside.</li><li>Saut the garlic in the same fat for about 1 minute, stirring.</li><li>Add the wine and lemon juice, stir and simmer for 5 minutes to slightly reduce the liquid.</li><li>Add capers, stir. Return the steaks to the pan, cover and simmer over low heat for 4 minutes.</li></ol>","spoonacularId":661531,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:57:30.384Z"},"__v":0}
{"_id":{"$oid":"66f94ed519fd2d4329c9fe4e"},"likes":0,"title":"Game Day Jerk Wings","readyInMinutes":45,"servings":10,"image":"https://img.spoonacular.com/recipes/644149-556x370.jpg","instructions":"Split wings apart into 2 sections and slash a slit in the flat part of the wing for quicker cooking.\nCombine chile powder, salt, black pepper, cayenne, and allspice in a bowl and sprinkle liberally over the wings (you don't need to use all of it).  Refrigerate for at least 1 hour.\nCombine Pickapeppa sauce, butter, honey, Tabasco, and pepper flakes in a medium saucepan over low heat until it is well incorporated.\nLet wings come to room temperature.\nPrepare grill for medium high direct heat. Grill dry rubbed wings for 20-25 mins, constantly turning the wings with tongs to maintain good grill marks without over-charing the wings. Take the biggest wing after 20 mins and take a bite out of it, and if the juices run clear, they are done. Place wings in a large bowl and toss with the jerk sauce.\nServe with blue cheese dressing and carrots.","spoonacularId":644149,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:57:57.672Z"},"__v":0}
{"_id":{"$oid":"66f94ed519fd2d4329c9fe4f"},"likes":0,"title":"Frittata with Mushrooms, Thyme, and Parmigiano Cheese","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/643859-556x370.jpg","instructions":"<ol><li>Pre-heat oven on to 350 degrees (later you'll change it to \"Broil\").</li><li>Heat an 8-inch ovenproof skillet over medium-high heat.</li><li>Coat pan with cooking spray or butter.</li><li>Add mushrooms and green onions to pan; saut 12 minutes or until mushrooms are nicely browned.</li><li>In a medium bowl, add the eggs and egg replacement.</li><li>Add the half and half.</li><li>Add the Parmesan cheese.</li><li>Add the thyme and any additional herbs that you like.</li><li>Add salt and pepper and whisk everything together.</li><li>Pour the egg/cheese mixture into the same pan with the sauteed mushrooms and green onions.</li><li>Heat pan over medium heat.</li><li>Cook, covered, for about 6 minutes or when it is just a little bit liquid-y/runny on the top.</li><li>At that point, place the pan into the oven and cook on 350 for another 5 - 10 minutes.</li><li>Once the frittata is completely set and cooked (not runny on top) change the oven temperature to \"Broil\".</li><li>Place the pan on the lowest rack of the oven and broil for about 2 minutes or until a golden brown color forms on the top.</li></ol>","spoonacularId":643859,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:57:57.672Z"},"__v":0}
{"_id":{"$oid":"66f94ed519fd2d4329c9fe50"},"likes":0,"title":"Double Chocolate Milo Pancakes","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/716293-556x370.jpg","instructions":"<p>Mix your dry ingredients and wet ingredients except the peanuts till smooth.In a pan, add 1 tablespoon of vegetable oil and with a small spoon, scoop the mixture and form little circles in the pan.Fry on low- medium heat till brown on both sides.When pancakes are fried and ready set aside.In a small pan, mix the milo, sugar and water and bring to boil on medium heat till a thick sauce is formed. Pour into a bowl and allow to cool.Crush your peanuts and set aside.With a tiny scoop of the chocolate syrup, smear it over the pancakes and sprinkle some peanuts over it.When they are all ready, dust it over with a bit more milo and serve.</p>","spoonacularId":716293,"ingredients":[],"createdAt":{"$date":"2024-09-29T12:57:57.673Z"},"__v":0}
{"_id":{"$oid":"66f94f8c19fd2d4329c9fe59"},"likes":0,"title":"Ground Turkey Stuffed Peppers","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/645978-556x370.jpg","instructions":"<ol><li>Cook rice then knead it together with remaining filling ingredients. Cut tops off peppers and fill each one. Place in your slow cooker or a large stove-top pot. Mix together sauce ingredients. Top each stuffed pepper with sauce and pour remaining sauce all around the stuffed peppers. Cook on medium/low for about an hour. Top with grated parmesan cheese and a little parsley for looks and serve warm.</li></ol>","spoonacularId":645978,"ingredients":[],"createdAt":{"$date":"2024-09-29T13:01:00.12Z"},"__v":0}
{"_id":{"$oid":"66f94f8c19fd2d4329c9fe5a"},"likes":0,"title":"Eggplant Parmesan","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/642293-556x370.jpg","instructions":"Preheat oven to 350 degrees.\nSlice eggplant into 1/4 inch thick rounds and salt for 30 minutes to remove water.\nSaute onions and garlic in a tablespoon of oil. \nAdd tomatoes and oregano, simmer until sauce thickens slightly.\nDip each eggplant slice first into eggs, then into crumbs. Saute in hot olive oil until golden brown on both sides.\nPlace a layer of browned slices in 2 quart casserole; sprinkle with some of Parmesan, oregano and mozzarella; then cover well with some of tomato sauce. \nRepeat until all eggplant is used, topping last layer of sauce with several slices of mozzarella. \nBake until the sauce bubbles and the cheese is melted and browned, about 30 minutes.","spoonacularId":642293,"ingredients":[],"createdAt":{"$date":"2024-09-29T13:01:00.12Z"},"__v":0}
{"_id":{"$oid":"66f94f8c19fd2d4329c9fe5b"},"likes":0,"title":"Broccoli Oatmeal Breakfast Casserole","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/636199-556x370.jpg","instructions":"<ol><li>Preheat the oven at 350 degree Fahrenheit. Prepare 8 inch square baking dish with cooking spray.</li><li>Grind the broccoli separately in a food processor and combine it with all the dry ingredients in a mixing bowl.</li><li>In another bowl combine all the wet ingredients.</li><li>Pour the wet ingredients into the dry ingredients and mix well.</li><li>Spoon the batter into the baking dish and put it in the oven.</li><li>Bake it for 25-30 minutes or until the fork comes out clean.</li><li>Cut into desired size and serve hot.</li></ol>","spoonacularId":636199,"ingredients":[],"createdAt":{"$date":"2024-09-29T13:01:00.12Z"},"__v":0}
{"_id":{"$oid":"66f94f8c19fd2d4329c9fe5c"},"likes":0,"title":"Delicious Homemade Chocolate Oreos","readyInMinutes":90,"servings":25,"image":"https://img.spoonacular.com/recipes/641395-556x370.jpg","instructions":"<ol><li>Set two racks in the middle of the oven. Preheat to 375F.</li><li>In a food processor, or bowl of an electric mixer, thoroughly mix the flour, cocoa, baking soda and powder, salt, and sugar. While pulsing, or on low speed, add the butter, and then the egg. Continue processing or mixing until dough comes together in a mass.</li><li>Take rounded teaspoons of batter and place on a parchment paper-lined baking sheet approximately two inches apart. (I started off with loonie sized chunks of dough which was too big. Its more like the size of a quarter. Remember, youre aiming for 50 to 60 of these individual wafers!) With moistened hands, slightly flatten the dough. Bake for 9 minutes, rotating once for even baking. Set baking sheets on a rack to cool.</li><li>To make the cream, place butter and shortening in a mixing bowl, and at low speed, gradually beat in the sugar and vanilla. Turn the mixer on high and beat for 2 to 3 minutes until filling is light and fluffy.</li><li>To assemble the cookies, in a pastry bag with a 1/2 inch, round tip, pipe teaspoon-size blobs of cream into the center of one cookie. Place another cookie, equal in size to the first, on top of the cream. Lightly press, to work the filling evenly to the outsides of the cookie. (I dont think its entirely necessary to use a pastry bag. You could just spoon some icing on and squeeze between two wafers.) Continue this process until all the cookies have been sandwiched with cream.</li></ol>","spoonacularId":641395,"ingredients":[],"createdAt":{"$date":"2024-09-29T13:01:00.12Z"},"__v":0}
{"_id":{"$oid":"66f94f8c19fd2d4329c9fe5d"},"likes":0,"title":"Black Bean Brownies","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/635063-556x370.jpg","instructions":"Preheat oven to 350 F. Mix beans, oil, applesauce, eggs, egg yolk, sugar, cocoa powder, and espresso powder in your food processor. Pulse for 1 minute, or until smooth.\nPlace your chopped chocolate and butter in a small bowl and microwave for 1 minute, stirring halfway. Stir until the mixture is smooth. Set aside to cool for a few minutes.\nAdd chocolate/butter mixture, vanilla extract, and salt to the food processor; pulse to blend. Pour batter into a large bowl and stir in the flour.\nSpread batter into a foil-lined 8x8\" baking pan coated with nonstick cooking spray. Smooth the top and sprinkle evenly with the walnuts (if using).\nBake for 25 to 30 minutes, or until a toothpick inserted into the center comes out clean. Let the brownies cool in the pan on a wire rack for 15 minutes. Cut into squares and serve","spoonacularId":635063,"ingredients":[],"createdAt":{"$date":"2024-09-29T13:01:00.121Z"},"__v":0}
{"_id":{"$oid":"66faa044d52310097f11f0df"},"likes":0,"title":"Banana & Oreo Muffin","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/633970-556x370.jpg","instructions":"Sift the flour, baking power and baking soda together and set aside.\nRemove the cream from the cookies, place the cookies in a ziplock bag, use a rolling pin, crush the cookie into fine crumbs.\nCream butter and sugar with electric beater till light and fluffy(about 3 minutes on medium speed).\nAdd in egg one at a time and beat till the mixture is well combine without any egg trace.\nAdd mashed banana, vanilla essence and condensed milk into the butter mixture and give it a quick whisk.\nLower the mixer speed, add flour mixture and blend the mixture till smooth.\nStir in the oreo cookies crumbs till combined, scoop the mixture into prepared muffin cups to 3/4 full.\nTop the muffin batter with some extra banana slices and oreo cookies, bake them in preheated 180 degree oven for about 20 - 25 minutes or till a toothpick inserted in the center and comes out clean.","spoonacularId":633970,"ingredients":[],"createdAt":{"$date":"2024-09-30T12:57:40.305Z"},"__v":0}
{"_id":{"$oid":"66faa044d52310097f11f0e0"},"likes":0,"title":"Shortbread Lemon Cookies","readyInMinutes":45,"servings":36,"image":"https://img.spoonacular.com/recipes/659887-556x370.jpg","instructions":"Beat butter with one egg.\nAdd almond flour, sugar, all-purpose flour, and lemon juice, and mix with the mixer on the lowest setting.\nShape the dough into two rolls, about 2 inches each in diameter, and put in the refrigerator for 3 hours.\nPreheat oven to 350.\nSlice each log into cookies, about 1/8 inch thick, and place on a lightly greased baking sheet.\nBeat the second egg and brush the top of each cookie with it.\nPlace one lemon slice on top of each cookie.\nSprinkle with sugar and bake for 12-15 minutes.\nIf you like the tops of the cookies browned, put them under the broiler the last 5 minutes of baking.\nCool and optionally sprinkle with powdered sugar (optional).","spoonacularId":659887,"ingredients":[],"createdAt":{"$date":"2024-09-30T12:57:40.306Z"},"__v":0}
{"_id":{"$oid":"66faa044d52310097f11f0e1"},"likes":0,"title":"Vegan Stuffed Portobello Mushroom over Quinoa","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/664491-556x370.jpg","instructions":"Cook quinoa\nAfter the tofu has thawed, drain and squeeze the excess water off.\nBrush off portobello mushrooms and remove the stems.\nMake the marinade for the mushroom:  3 tablespoons of olive oil, 3 tablespoons of balsamic vinaigrette, salt, and pepper (just keep adding the salt little by little until the marinade tastes good to you).\nHeat 3 tablespoons of olive oil in a pan and add the onions, garlic, oregano, and basil.  After you sweat the onions, add the tofu.  Note: smash the tofu with your hands and place it into the pan.  Keep stirring and cook on medium heat for about 15 to 20 minutes.\nAdd Nutritional yeast, spinach, tomato, and lemon juice to the tofu.  Cook for another minute then set aside.\nDip the mushroom in the marinade and place on a baking pan (top side down).\nStuff the mushrooms with the tofu and veggies.\nTop it off with vegan cheese.\nPreheat oven 370 degrees.\nBake stuffed mushrooms for 15 to 20 minutes.\nServe over quinoa.","spoonacularId":664491,"ingredients":[],"createdAt":{"$date":"2024-09-30T12:57:40.307Z"},"__v":0}
{"_id":{"$oid":"66faa044d52310097f11f0e2"},"likes":0,"title":"Mini-Cherry Pies","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/651990-556x370.jpg","instructions":"<ol><li>Directions:</li><li>In the work bowl of a food processor, combine flour, 1/2 cup granulated sugar, pecans, and 1/2 teaspoon salt, pulsing to blend. Add butter to flour mixture, pulsing until mixture is crumbly, approximately 30 seconds.</li><li>With the food processor running,gradually add 2/3 cup cold water, in a slow steady stream, through lid opening until mixture forms a ball. Flatten dough into 2 disks, wrap in plastic wrap and refrigerate for 1 hour.</li><li>Preheat oven to 350 degrees.</li><li>On a lightly floured surface, roll 1 pastry disk to a 1/8-inch thickness. Fit dough into 12 (2-1/2-inch) mini pie plates. Trim dough around the edges. Freeze until dough is firm, approximately 10 minutes.</li><li>Prick the bottoms and sides of dough with a fork. Bake until golden, 6 to 8 minutes.</li><li>In a small bowl, combine cornstarch and remaining 2 tablespoons cold water, stirring until mixture is blended.</li><li>In a large saucepan, combine cherries, cornstarch mixture, remaining 1/4 cup granulated sugar, and remaining 1/2 teaspoon salt. Cook over medium heat until cherries are soft and mixture is thick. Add lemon juice and vanilla, stirring to combine.</li><li>On a lightly floured surface, roll remaining pastry disk to a 1/8-inch thickness. Cut dough into very thin (1/8 to 1/4-inch-wide) strips. Arrange enough dough strips vertically side by side to achieve at least a 2-1/2-inch width. Pull back halfway every other vertical strip, and place a strip horizontally across remaining vertical strips. Return to their original positions the vertical strips that were pulled back, and pull back the other vertical strips. Place another strip horizontally across remaining vertical strips as close as possible to first horizontal strip. Continue to tightly weave 1 horizontal strip at a time into the vertical strips, working out form the center to make at least a 2-1/2-x-2-1/2-inch lattice top for each mini pie. Using a spatula, carefully transfer lattice tops to prepared pie plates.</li><li>Using a knife, trim the edges. Gently press edge of lattice tops to seal. Brush top and edges of dough with cream. Sprinkle the top of each pie with 1 teaspoon turbinado sugar. Bake until crusts are golden, 18 to 24 minutes. Serve warm with a scoop of vanilla ice cream, if desired.</li></ol>","spoonacularId":651990,"ingredients":[],"createdAt":{"$date":"2024-09-30T12:57:40.308Z"},"__v":0}
{"_id":{"$oid":"66faa776c363363bc32ea125"},"likes":0,"title":"Risotto With Fresh Peas","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/658384-556x370.jpg","instructions":"Melt butter in heavy large saucepan over medium heat, add evo, bay leaf and onions.  Season with salt and pepper.  Cook until onions are translucent.  Add minced garlic.  Saute until tender, roughly 8 minutes.\nStir in the rice and toast it for a few minutes.  Add wine, cook until the liquid is absorbed, stirring often, about 2 minutes.  Add 1 cup of HOT chicken broth at a time, making sure the liquid is absorbed, stirring often.  This process should be done over medium low heat and will take about 28 minutes.  Add 1 cup of chicken broth roughly every 3 minutes.  Cook the rice until tender and mixture is creamy.\nContinue to stir in the peas, Parmesan, salt and pepper to taste.  Cook until the mixture has absorbed all the liquid.  It will double in size. Let cool and don't eat it all.  For some reason, the mixture doesn't last long around my house.","spoonacularId":658384,"ingredients":[],"createdAt":{"$date":"2024-09-30T13:28:22.891Z"},"__v":0}
{"_id":{"$oid":"66faa776c363363bc32ea128"},"likes":0,"title":"Tapioca Pudding with Pineapple and Coconut","readyInMinutes":60,"servings":4,"image":"https://img.spoonacular.com/recipes/662871-556x370.jpg","instructions":"<ol><li>The place to start is with the tapioca, the pudding is a custard. So, in a heavy bottomed saucepan add the full milk, salt, tapioca, the seeds from the vanilla pod, and the empty vanilla pod. Bring this mix to a gentle simmer and stir occasionally. Do this until the tapioca is translucent and tender, this takes about 20 minutes. When cooked, stir in the coconut milk.</li><li>While the tapioca mix is cooking you can whisk the egg yolks and sugar together in a bowl - quite big as it has to hold half of your tapioca mix too. Mix the egg and sugar together until the color lightens.</li><li>Taking your cooked tapioca mix from the heat, pour half of it into the bowl with the eggs and sugar, whisk together using a metal hand whisk. Then pour this back into the pan and place on a medium heat.</li><li>On a medium heat keep whisking until the mix thickens, this takes about 5 minutes or so. It is important not to use too high a heat as the eggs will scramble. The mix will not become really thick, the chilling process with thicken it further. I like to check the sweetness level at this stage, you can add a little more sugar if you wish, but if you do, stir it through until it dissolves. Put your tapioca pudding in a clean, cool bowl, remove the vanilla bean and set aside to cool. When it has cooled, cover with cling film and put in the fridge.</li><li>Now for the pineapple. Combine the fruit with the honey, lime juice and most of the zest. Keep back a little lime zest to dress.</li><li>Place half of the mix in a food processor and blend until smooth. Transfer this back into the bowl with the rest of the pineapple and stir together  check the flavour and add more honey or lime if you wish.</li><li>Once your tapioca has chilled, place some of the pineapple mix in the bottom of your serving dishes, then add the tapioca and top with a little pineapple and some lime zest to finish.</li></ol>","spoonacularId":662871,"ingredients":[],"createdAt":{"$date":"2024-09-30T13:28:22.914Z"},"__v":0}
{"_id":{"$oid":"66faa776c363363bc32ea12b"},"likes":0,"title":"Apricot Slice","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/632678-556x370.jpg","instructions":"<ol><li>Method:</li><li>Dice dried apricot and mix with 1 teaspoon plain flour, set aside.</li><li>Beat soft butter, sugar, salt and vanilla extract till white and fluffy at medium speed.</li><li>Lower speed add eggs one at a time and beat well until incorporated</li><li>Stop machine and pour in plain flour and fold well with a rubber spatula.</li><li>Lastly add in dried apricot and mix well.</li><li>Pour batter into a 8 inch square tray (lined all sides up) and bake at preheated oven 170C for about 30 mins or skewer inserted comes out clean.</li></ol>","spoonacularId":632678,"ingredients":[],"createdAt":{"$date":"2024-09-30T13:28:22.929Z"},"__v":0}
{"_id":{"$oid":"66faa776c363363bc32ea12e"},"likes":0,"title":"Carrot Banana Bread","readyInMinutes":75,"servings":10,"image":"https://img.spoonacular.com/recipes/637171-556x370.jpg","instructions":"<ol><li>Preheat oven to 350 degrees. Butter and flour a loaf pan. Set aside.</li><li>Whisk together flour, baking soda, salt, cinnamon and nutmeg in medium mixing bowl; set aside.</li><li>In a large mixing bowl whisk the yogurt and honey together. Add eggs and vanilla. Mix well.</li><li>Add 1/4 of the flour mixture at a time and stir in - alternating with the banana and ending with the flour mixture. Scrap down sides and just mix until incorporated; don't over mix.</li><li>Add carrot, raisins and walnuts. Stir until evenly mixed throughout. Spoon into the greased loaf pan. Sprinkle sunflower seeds over top if desired.</li><li>Bake 55-60 minutes until a toothpick comes out clean. Cool for 15-20 minutes. Remove from pan and continue cooling on wire rack. Frost with cream cheese frosting if desired.</li><li>In a medium mixing bowl with an electric mixer beat cream cheese, butter, and vanilla together on low-medium until fluffy.</li><li>Add a cup and a half of sugar and a tablespoon of milk. Beat. Add more sugar and milk in small amounts beating after each addition until you get the consistency you want.</li><li>Beat for two minutes on low until light and fluffy.</li></ol>","spoonacularId":637171,"ingredients":[],"createdAt":{"$date":"2024-09-30T13:28:22.941Z"},"__v":0}
{"_id":{"$oid":"66faa776c363363bc32ea131"},"likes":0,"title":"Spaghetti With Pesto Trapanese","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/660835-556x370.jpg","instructions":"Place a large (this is key) pot of water to boil. Salt when it boils, not before.\nMeanwhile, make the pesto: In a mortar (or use a food processor with a blade) pound together the oil, almonds and pine-nuts. Add the garlic, 2 ice cubes and the rest of the ingredients, pounding quickly to make a paste.You want to leave a bit of a texture for crunch.\nCook the pasta al dente, as per directions, drain and reserve some of the boiling water. Toss the pasta with the pesto, using some of the reserved water to make it creamier. Grate some fresh pecorino or ricotta salata (or both) over and serve hot with a leaf of basil to garnish.","spoonacularId":660835,"ingredients":[],"createdAt":{"$date":"2024-09-30T13:28:22.953Z"},"__v":0}
{"_id":{"$oid":"66fbea5fafc26a08a980a323"},"likes":0,"title":"Minted Pea & Spinach Soup","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/652038-556x370.jpg","instructions":"<ol><li>Place pototoes in a medium sized pot with a little bit of water and some salt & pepper. Place lid on and cook for 20 minutes until almost soft.</li><li>Add peas and cook for a further 5 minutes until potatoes are soft and cooked through.</li><li>Add spinach and cook a further 3 -5 minutes, until wilted.</li><li>Take off the heat and let cool for a few minutes, then blend to a puree with an immersion blender.</li><li>Place pot back on the stovetop, adding cream, milk, water and chicken stock. Re-heat for a few minutes until piping-hot. Add yoghurt, mint, sugar, salt and pepper to taste and stir through.</li><li>Serve immediately, scattered with some crispy croutons or bacon bits (or if you're like me and you just have some cheesegrillers on hand, fry them up in thin slices with a bit of sweet chilli sauce and use as topper).</li></ol>","spoonacularId":652038,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:26:07.056Z"},"__v":0}
{"_id":{"$oid":"66fbea5fafc26a08a980a326"},"likes":0,"title":"Couscous with olives","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/640238-556x370.jpg","instructions":"Place the couscous grains into a bowl and pour over the hot chicken stock. Cover the bowl and leave couscous to soak the stock for 15 minutes or until tender.\nMeanwhile, toast the pine nuts in a dry frying pan for 3 minutes, shaking the pan from time to time. Set aside.\nRun a fork through the couscous to break up the grains and add olive oil, black olives, tomatoes, toasted pine nuts and herbs. Combine.\nSeason with  pepper and serve warm.","spoonacularId":640238,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:26:07.096Z"},"__v":0}
{"_id":{"$oid":"66fbea5fafc26a08a980a329"},"likes":0,"title":"Double Chocolate Brownie Semifreddo","readyInMinutes":45,"servings":10,"image":"https://img.spoonacular.com/recipes/641586-556x370.jpg","instructions":"Place chocolate in a medium-sized heatproof bowl. Place over a saucepan of simmering water and using a spatula stir until the chocolate has melted. Set aside.\nPlace the eggs, extra yolks, vanilla, and sugar in a large-sized, heatproof bowl. Place over a saucepan of simmering water and, using a hand-held electric mixer, beat for 6 to 8 minutes or until the egg mixture becomes thick and pale. Remove from heat and allow to cool slightly.\nIn a medium-sized bowl, whisk the cream until stiff peaks form. Using a large spatula, gently fold through the egg mixture until well combined. Fold in the melted chocolate and brownies. Pour into 2 loaf pans and freeze for at least 6 hours or overnight.","spoonacularId":641586,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:26:07.107Z"},"__v":0}
{"_id":{"$oid":"66fbea5fafc26a08a980a32c"},"likes":0,"title":"Easy Shrimp Scampi","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/642096-556x370.jpg","instructions":"<ol><li>In a large skillet, melt butter and oil. Add garlic and saute 30 seconds.</li><li>Stir in wine and lemon juice and cook 1 minute.</li><li>Stir in shrimp, parsley, salt and pepper. Cook 2-3 minutes over high heat, stir constantly.</li><li>Serve with pasta or rice.</li></ol>","spoonacularId":642096,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:26:07.119Z"},"__v":0}
{"_id":{"$oid":"66fbea5fafc26a08a980a32f"},"likes":0,"title":"Mediterranean semolina cake","readyInMinutes":45,"servings":10,"image":"https://img.spoonacular.com/recipes/651434-556x370.jpg","instructions":"In a mixer, whisk the eggs and sugar until thick and pale in colour. Add the yoghurt and zest of the citrus.\nGradually add all the dry ingredients and combined well.\nIncorporate the olive oil and mix.\nPour into the round baking tin (20-23cm) lined with baking paper (or use a silicone round mold for cakes) and bake for 35 minutes at 180C (160C fan) or if pierced with a skewer it comes out clean.\nRemove cake from the oven and pierce all over with a skewer.\nPour the syrup all over the cake and cool slightly before serving.\nSyrup\nAdd almonds, raisins, cranberries, honey and orange juice to a pot and bring to the boil. Cook for 1 - 2 minutes.","spoonacularId":651434,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:26:07.13Z"},"__v":0}
{"_id":{"$oid":"66fbebd291c9721492e3a24c"},"likes":0,"title":"Hummus with roasted orange peppers","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/647634-556x370.jpg","instructions":"Find the directions for preparation here - http://divinespicebox.com/2014/06/08/hummus-with-roasted-orange-peppers/","spoonacularId":647634,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:32:18.778Z"},"__v":0}
{"_id":{"$oid":"66fbebd291c9721492e3a24f"},"likes":0,"title":"Fresh Fig, Walnut, Rosemary Upside Down Cake And A Crisp Citrusy Chardonnay","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/643478-556x370.jpg","instructions":"Position a rack in the center of the oven, and preheat to 350 degrees.\nAdd butter to a 9 inch round baking pan and place inside of a warm oven until melted, about 5 minutes.\nRemove from oven and sprinkle brown sugar evenly over the butter.\nAdd figs, flesh side up.\nSprinkle with 1  tsp of the rosemary.\nFill in the nooks and crannies with walnut pieces.\nIn a medium bowl sift flour, baking powder, and salt together.\nIn a separate bowl beat eggs with sugar at medium speed until creamy.\nBecause I liked this cake better with the eggs added whole rather than separating and adding the egg whites at the end, I beat the eggs and sugar for an additional 3 minutes until they were frothy and small bubbles formed.\nAdd the flour mixture to the creamed mixture and beat until well combined.\nPour cake batter evenly over the fruit and smooth with a spatula.\nBake for 35 to 40 minutes or until cake is golden and a toothpick into the center comes out clean.\nPlace on a wire rack to cool for 10 minutes.\nRun a blunt knife around the edges of the pan to loosen the cake.\nInvert carefully onto a plate.\nServe warm or at room temperature. Leftovers are yummy heated for about 15 seconds in the microwave!\nDelicious with a bold cup of java or a cool glass of Chardonnay like this one  Edna Valley 2010 Paragon. Crisp, citrusy with a hint of peach and a small amount of spice. Great paring with the strong lemon base of this cake!","spoonacularId":643478,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:32:18.8Z"},"__v":0}
{"_id":{"$oid":"66fbebd291c9721492e3a252"},"likes":0,"title":"Classic Apple Pie with Perfect Crust","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/655740-556x370.jpg","instructions":"<ol><li>Before you begin assembiling your ingredients, place a large glass of water into the freezer.</li><li>Do not skip this step.</li><li>Apple Pie Filling:</li><li>In a large bowl combine the sliced apples, sugars, lemon juice, ground cinnamon, nutmeg, and salt.</li><li>Stir well and let sit will you make the crust.</li><li>Pie Crust:</li><li>Get your glass of water from the freezer.</li><li>Combine flour and salt in a medium sized bowl.</li><li>Cut in the shortening.</li><li>Place the egg and vinegar in a 1/2 cup, top up with the water from the freezer.</li><li>Stir this into the flour mixture.</li><li>Stir until a ball is formed.</li><li>Shape into 2 small discs and wrap, place in the fridge for 30 mintes.</li><li>Generously flour the surface and rolling pin.</li><li>Beginning in the center of the disc of dough, roll out, lifting often to be sure it is not sticking to the counter.</li><li>If you find it sticking, add a touch more flour to the counter.</li><li>Once it is large enough to line a 9 inch pie plate either roll it lightly around the rolling pin or gently fold it into fouths and transfar to the pie plate.</li><li>Be sure you have at least an half inch of dough over hanging the edge of the plate.</li><li>Add the cornstarch to the apples and stir well to incorporate.</li><li>Pour the bowl of apples into the pastry lined pie plate.</li><li>Dot the surface with the butter.</li><li>Roll out the second disc of dough, making sure it is large enough to cover the top including the half in dough overhang around the edges.</li><li>Now you tuck the top layer of crust under the bottem layer of crust going completely around the whole pie.</li><li>Crimp the edge if the crust with wither your fingers or a fork, being sure to not break through the dough.</li><li>Be sure it is sealed well.</li><li>With a paring knife make a few slits through the top crust, and sprinkle with a half teaspoon of sugar.</li><li>Bake at 375 degrees for 60 minutes.</li><li>Do allow to cool for at least an hour so the filling can set.</li></ol>","spoonacularId":655740,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:32:18.818Z"},"__v":0}
{"_id":{"$oid":"66fbf04a34b9752f4d75e49c"},"likes":0,"title":"Jam Tarts","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/648389-556x370.jpg","instructions":"<ol><li>Melt butter. Blend in cream cheese, maple syrup and lemon juice. Add flour and combine until dough is smooth. Chill overnight. Roll dough to 1/4-inch thickness. Cut into 3-inch rounds. Make an indentation in the center of each. Spoon jam into each indentation. Bake on oiled cookie sheets at 450 degrees for 15 minutes. Crust should be golden brown and possibly flaking. If not, return for additional few minutes.</li><li>Makes 12</li></ol>","spoonacularId":648389,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:51:22.266Z"},"__v":0}
{"_id":{"$oid":"66fbf04a34b9752f4d75e49f"},"likes":0,"title":"My Asian Fried Fish Fillet","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/652824-556x370.jpg","instructions":"<ol><li>In a bowl, put fish fillet and put the ff also : rice wine, soy sauce, white pepper, sugar, all spice and curry powder.</li><li>Mix them well and marinate for 30 minutes. Set aside in the fridge.</li><li>Then beat 2 eggs and slowly add to the marinated fish, add also the corn flour and baking powder</li><li>Mix well and make sure the fillet is well coated.</li><li>Now you can start frying, the oil should be hot.</li></ol>","spoonacularId":652824,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:51:22.291Z"},"__v":0}
{"_id":{"$oid":"66fbf04a34b9752f4d75e4a2"},"likes":0,"title":"Black Bean Feijoada","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/635066-556x370.jpg","instructions":"<ol><li>Heat oil, saute onions until translucent. Add cent. Add remaining ingredients, saute for 2 minutes, and set aside. Prepare topping. and sea salt. Simmer for 5 more minutes.</li><li>Partially mash beans for a thick bean sauce consistency.</li></ol>","spoonacularId":635066,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:51:22.309Z"},"__v":0}
{"_id":{"$oid":"66fbf04a34b9752f4d75e4a5"},"likes":0,"title":"Lebanese Tabouleh","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/649411-556x370.jpg","instructions":"<ol><li>Remove stems from parsley and mint. Rinse leaves in a colander. Pat dry with paper towel.</li><li>In a food processor pulse parsley and mint until finely chopped. Transfer to a large mixing bowl.</li><li>Add green onions, tomatoes and bulgur wheat; stir to combine.</li><li>Toss with lemon juice and olive oil. Refrigerate for an hour before serving.</li><li>Serve on its own or with pita bread</li><li>Serves 2</li></ol>","spoonacularId":649411,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:51:22.325Z"},"__v":0}
{"_id":{"$oid":"66fbf12834b9752f4d75e4a8"},"likes":0,"title":"Orange Chocolate Cake","readyInMinutes":45,"servings":12,"image":"https://img.spoonacular.com/recipes/653836-556x370.jpg","instructions":"<ol><li>Preheat oven at 175C, Grease a 9\" bundt pan, and dust flour or spray non-stick spray in pan.</li><li>Beat butter for a while and add in sugar, continue to beat butter until creamy.</li><li>Add eggs one at a time and mix well. Add orange rind, orange juice and vanilla extract, beat at low speed till well combined.</li><li>Split ingredient (B) into 4 portions and sour cream into 3 portions. Pour in one portion of flour and sour cream alternately, beat well after each addition.</li><li>Take half of the mixture and gently mix with melted chocolate (do not over mix).</li><li>Scoop plain and chocolate batter alternately into pan, till all the batters are used up and gently shake the pan a little.</li><li>Bake for 50-60 minutes or skewer comes out clean.</li><li>Remove cake from oven and set to cool for 20 minutes then unmould, leave to cool completely.</li></ol>","spoonacularId":653836,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:04.854Z"},"__v":0}
{"_id":{"$oid":"66fbf12834b9752f4d75e4ab"},"likes":0,"title":"Gluten Free Coconut Chicken Salad","readyInMinutes":45,"servings":5,"image":"https://img.spoonacular.com/recipes/644813-556x370.jpg","instructions":"Preheat the oven to 350 degrees.\nDefrost the chicken tenderloins if necessary.\nIn a shallow dish, beat the egg and add in the water and salt.\nIn another shallow bowl, pour in the sweetened coconut.\nDip the chicken in the egg, then in the coconut. Press to coat and set aside.\nIn a large, ovenproof skillet, heat the oil over medium-high heat.\nAdd the chicken and cook, turning once, until golden, about 3 minutes. (Do not overcrowd your panI had to make my chicken in 2 batches)\nTransfer the skillet to the oven and bake until cooked through, about 12 minutes.\nServe the chicken on top of a salad with tomatoes, cashews, onion, and whatever else your heart desires.\nFor the dressingjust whisk all the ingredients in a medium-sized dish. Then, drizzle the sweet honey mustard dressing on top and gobble up!","spoonacularId":644813,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:04.87Z"},"__v":0}
{"_id":{"$oid":"66fbf12834b9752f4d75e4ae"},"likes":0,"title":"Whole Grain Pumpkin Bread","readyInMinutes":45,"servings":24,"image":"https://img.spoonacular.com/recipes/665257-556x370.jpg","instructions":"<ol><li>Preheat oven to 375 degrees. Grease 2 loaf pans. Beat oil, brown sugar and molasses until well blended. Blend in egg and pumpkin. Stir flours, brans, wheat germ, soda, cinnamon, cloves, nutmeg and salt into mixture just until moistened. Fold in nuts. Fill pans and bake about 1 hour, until pick comes out clean. Cool on rack. Better if served the day after cooking.</li></ol>","spoonacularId":665257,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:04.888Z"},"__v":0}
{"_id":{"$oid":"66fbf12834b9752f4d75e4b1"},"likes":0,"title":"Sweet and Spicy Country-Style Ribs","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/662463-556x370.jpg","instructions":"Heat the fat in a 6-quart enameled Dutch oven over medium high heat and brown the ribs on all sides.  Pour in the stock; add water to cover if necessary.  Add the vegetable scraps and bring to a boil.  Lower the heat to a simmer, cover and cook for 45 minutes to an hour, or until the ribs are tender.\nWhile the ribs are braising, saute the onions over medium-low heat in a large cast iron skillet until soft; add the garlic and saute for another minute more.  Stir in tomato sauce, vinegar, honey, pepper or hot sauce, cayenne pepper, chili chili powder, salt and dry mustard. Bring the mixture to a boil, then reduce heat and simmer, uncovered for 25 minutes, stirring occasionally.\nWhen the ribs are tender, remove them from the braising liquid and add them to the spicy tomato sauce in the pan.  Raise the heat and cook, stirring frequently, until the sauce has glazed the ribs, about 10 minutes.  Serve with the remaining sauce on the side, if desired.","spoonacularId":662463,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:04.904Z"},"__v":0}
{"_id":{"$oid":"66fbf13e34b9752f4d75e4b4"},"likes":0,"title":"Avocado Tomato & Mozzarella Panini/sandwiches","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/633167-556x370.jpg","instructions":"Top 4 slices of bread with a layer of mozzarella, tomato, avocado slices and another layer of mozzarella.\nSpread a little butter on both outsides of the sandwiches and grill until bread is toasted and cheese is melted.\nServe warm and enjoy!","spoonacularId":633167,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:26.202Z"},"__v":0}
{"_id":{"$oid":"66fbf13e34b9752f4d75e4b7"},"likes":0,"title":"Almost Guilt Free Mac and Cheese","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/632213-556x370.jpg","instructions":"Preheat oven to 425 degrees Farenheit.\nFor Roasted Cauliflower\nClean core and leaves from cauliflower (you do not have to have any precision when doing this).  Chop cauliflower into pieces.  Pieces should be roughly 1/2\" - 3/4\".\nPlace chopped cauliflower pieces onto a baking sheet.  Drizzle olive oil over top of cauliflower and mix to thoroughly coat pieces.\nAfter 20 minutes, toss cauliflower pieces to brown all sides.  Bake for another 20 minutes or until edges are browned.\nRemove from oven and lower temperature to 350 degrees Farenheit.\nFor Macaroni and Cheese\nIn a large pot of boiling and salted water, cook pasta until it is al dente.  Once done, drain.\nIn another large saucepan, over medium high heat, melt 3 tablespoons of butter.  Once melted, whisk in flour.  Keep whisking to ensure that there are no lumps.  After 5-7 minutes, the butter and flour mixture should be a light caramel color.\nAdd the soy milk, bay leaves, paprika, lemon juice, thyme, garlic powder and Szechuan pepper.  Stir occasionally for 10 - 15 minutes.  The mixture should thicken up.  Remove bay leaves.\nIn a medium size bowl thoroughly mix eggs.  Using a 1/4 cup measuring cup, slowly add milk mixture to eggs (temper the eggs).  While adding the hot mixture to the eggs, make sure that you keep whisking.  Once you have roughly 2 cups of the soy milk mixture in with the eggs, dump everything into the main saucepan and stir.  Add in 3/4 of the shredded cheeses, and all of the goat cheese, and stir to combine.\nAdd in the cooked, diced chicken and roasted cauliflower.  Once these are combined, add the cooked pasta and stir thoroughly.\nSeason with salt and pepper.\nPour into a 9\"x13\" baking pan.\nCover with remaining cheese.\nMelt 2 tablespoons of butter in a saute pan.  Add panko bread crumbs and stir to coat all of the crumbs with butter.\nTop the mac and cheese with the panko crumbs and bake for 30 minutes.\nLet rest for 15-20 minutes before serving.\nIf you really want to kick up the heat factor in this, you can add tablespoon of Sriracha hot sauce to the mix.","spoonacularId":632213,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:26.218Z"},"__v":0}
{"_id":{"$oid":"66fbf13e34b9752f4d75e4bc"},"likes":0,"title":"Tofu Pineapple Stir-Fry","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/663520-556x370.jpg","instructions":"In a small bowl mix soy sauce, oyster sauce, sesame oil, sambal oelek and sugar together and set aside.\nIn a large wok heat 2 tbsp of peanut oil over high heat.\nAdd chilies and lemongrass and fry until fragrant.\nAdd tofu and stir-fry until golden.  About five minutes\nRemove chilies and tofu and set aside.\nAdd the remainder of the peanut oil to the wok and add the veggies.\nStir-fry until the carrot is tender, but the pepper is still slightly crisp. 4-6 minutes.\nAdd tofu and chilies back and pour in the sauce.\nToss to coat and let the sauce reduce slightly. 1-2 minutes.\nRemove from heat and serve immediately over noodles or brown basmati rice.","spoonacularId":663520,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:26.247Z"},"__v":0}
{"_id":{"$oid":"66fbf15534b9752f4d75e4bf"},"likes":0,"title":"One Soup, Two Ways: Chunky Vegetables and Cream Of Vegetables","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/653687-556x370.jpg","instructions":"For chunky vegetable soup: Heat olive oil over medium low heat in a soup pot (big enough to hold everything you have) and throw in garlic, onions, carrots and celery.\nStir around a bit, add the salt and cover. Let sweat for about 10 minutes.\nAdd the tomato puree and corn, stir, let cook for a few minutes.\nThen add the broth, turn heat up to maximum and bring to a boil.\nAdd the beans. Season with dried herbs.\nFor the Cream of Vegetables: Transfer half of the chunky soup into another soup pot.\nWhiz everything up with a hand-held blender, or in a blender. Then use a sieve, and \"filter\" the soup.\nBring back to a boil, add  cream, turmeric, curry powder, cayenne pepper and stir well.","spoonacularId":653687,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:49.053Z"},"__v":0}
{"_id":{"$oid":"66fbf15534b9752f4d75e4c2"},"likes":0,"title":"How to Make The Ultimate Slow Cooker Potato Soup","readyInMinutes":255,"servings":6,"image":"https://img.spoonacular.com/recipes/1064362-556x370.jpg","instructions":"InstructionsCoat the cubed potatoes with flour and place in the slow cooker. Add diced onion, bacon, and sprinkle pepper over the potatoes. Pour chicken or vegetable stock over the potatoes and cook on high for 3 and 1/2 hours. Use a potato masher to slightly mash the cooked potatoes and add half and half.  Cook an additional 30 minutes. Scoop soup into bowls and add toppings of your choice.","spoonacularId":1064362,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:49.068Z"},"__v":0}
{"_id":{"$oid":"66fbf15534b9752f4d75e4c5"},"likes":0,"title":"Julia Child's Coq au Vin","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/648638-556x370.jpg","instructions":"<ol><li>Blanch the bacon to remove some of its saltiness. Drop the bacon into a saucepan of cold water, covered by a couple of inches. Bring to a boil, simmer for 5 minutes, drain. Rinse in cold water, pat dry with paper towels. Cut the bacon into 1 inch by 1/4 inch pieces.</li><li>Brown bacon on medium high heat in a dutch oven big enough to hold the chicken, about 10 minutes. Remove the cooked bacon, set aside. Keep the bacon fat in the pan. Working in batches if necessary, add onions and chicken, skin side down. Brown the chicken well, on all sides, about 10 minutes. Halfway through the browning, add the garlic and sprinkle the chicken with salt and pepper.</li><li>Spoon off any excess fat. Add the chicken stock, wine, and herbs. Add back the bacon. Lower heat to a simmer. Cover and cook for 20 minutes, or until chicken is tender and cooked through. Remove chicken and onions to a separate platter. Remove the bay leaves, herb sprigs, garlic, and discard.</li><li>Add mushrooms to the remaining liquid and turn the heat to high. Boil quickly and reduce the liquid by three fourths until it becomes thick and saucy. Lower the heat, stir in the butter. Return the chicken and onions to the pan to reheat and coat with sauce. Adjust seasoning. Garnish with parsley and serve with potatoes or egg noodles.</li></ol>","spoonacularId":648638,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:49.084Z"},"__v":0}
{"_id":{"$oid":"66fbf15534b9752f4d75e4c8"},"likes":0,"title":"Ultimate Chocolate Chunk Cookies","readyInMinutes":24,"servings":6,"image":"https://img.spoonacular.com/recipes/715483-556x370.jpg","instructions":"Preheat oven to 350.Mix together in a medium bowl the flour, baking soda, and salt.Carefully soften chocolate chips, butter, and vanilla flavoring in the microwave in 15 second increments, stirring in between, for one full minute.Beat eggs and sugar together until light an fluffy.Reduce blender speed and combine the melted chocolate chips, butter, vanilla, and slowly mix in the flour.Add in the chocolate chunks and pecans until mixed.Drop 1 tablespoon of dough onto cookie sheet, 2 - 3 inches apart and bake for 12-14 minutes, keeping your center soft and chewy. Allow to cool for 10 minutes before moving to a cooling rack to cool completely.","spoonacularId":715483,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:49.099Z"},"__v":0}
{"_id":{"$oid":"66fbf15534b9752f4d75e4cb"},"likes":0,"title":"Bittersweet Chocolate Ice Cream","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/635040-556x370.jpg","instructions":"<ol><li>Prep your ice cream maker according to the manufacturers directions.</li><li>In a medium sauce pan, heat the half & half until warm- not hot.</li><li>In a bowl, whisk the egg yolks until blended.</li><li>Add the sugar and about 1/2 of the warm half and half. Stir to combine well and add the mixture back to the saucepan. Whisking briskly while combining.</li><li>Cook over medium heat until the mixture coats the back of a silicone spatula (about 10-12 minutes). Remove from heat and add the chocolate and coffee, stir to melt and combine thoroughly.</li><li>Place the pan with the custard in an ice bath to cool, stirring occasionally, until it reaches room temperature.Add the whipping cream and vanilla</li><li>Pour into another container and chill until cold -several hours-or you are ready pour into the ice cream maker.</li><li>Freeze in the ice cream maker according to the manufacturers directions. Makes about a quart.</li></ol>","spoonacularId":635040,"ingredients":[],"createdAt":{"$date":"2024-10-01T12:55:49.115Z"},"__v":0}
{"_id":{"$oid":"66fc08181187fcc3e0739967"},"likes":0,"title":"Healthy Orange Chicken","readyInMinutes":45,"servings":2,"image":"https://img.spoonacular.com/recipes/646499-556x370.jpg","instructions":"Cut the chicken breast into cubes. In a mixing bowl, marinate the chicken with orange juice, rice vinegar, rice wine, hot chili sauce, brown sugar, and minced garlic. Cover the chicken with plastic wrap and press down so the marinade will soak the chicken evenly. Refrigerate for 1 hour.\nWhile waiting for the chicken to marinate, prepare the vegetables. Chop the onion into square pieces. Chop green onions and separate the white and green parts. Zest the orange.\nIn a saut pan, add vegetable oil and turn to high heat. Add in the chicken and saut for 1 minute. Toss the chicken and saut for another minute or until caramelized. Transfer the chicken to a dish.\nContinue to use high heat. Add the chopped onion to the pan and saut until soft. Add the chicken back to the pan, with the white parts of the green onion and orange zest. Cook for about 30 seconds. Add the liquid to the pan and let it simmer to 30 seconds. Add the remaining green onion to the pan and let the sauce continue to reduce and thicken.\nWhen the sauce is reduced to desired consistency, add salt and pepper to taste. The orange chicken is done. Serve over white rice.","spoonacularId":646499,"ingredients":[],"createdAt":{"$date":"2024-10-01T14:32:56.3Z"},"__v":0}
{"_id":{"$oid":"66fc08181187fcc3e073996a"},"likes":0,"title":"Peaches And Cream Oatmeal","readyInMinutes":45,"servings":1,"image":"https://img.spoonacular.com/recipes/655186-556x370.jpg","instructions":"Microwave the peaches for 30 seconds.\nAdd oats, milk, cream cheese, agave and cinnamon.  Microwave for 1 minute, stir, and enjoy!","spoonacularId":655186,"ingredients":[],"createdAt":{"$date":"2024-10-01T14:32:56.327Z"},"__v":0}
{"_id":{"$oid":"66fc08181187fcc3e073996d"},"likes":0,"title":"No-Bake Chocolate Peanut Butter Pie","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/653185-556x370.jpg","instructions":"<ol><li>CRUST:</li><li>Crush the cookies in a food processor until fine crumbs.</li><li>Transfer to a small bowl and add the earth balance.</li><li>Combine with a fork, or hands until fully blended and begins to take shape.</li><li>Press evenly into a 9 inch pie plate. My crust ended at about 1/2 inch before the rim.</li><li>Chill in the freezer while preparing the filling.</li><li>FILLING:</li><li>In a stand mixer set with a paddle attachment, or using a hand held mixer set on medium speed, beat peanut butter with the cream cheese.</li><li>After about a minute add the coconut yogurt.</li><li>Once combined, reduce to low speed and add sifted powdered sugar, increase back to medium speed and beat until smooth.</li><li>Turn off mixer, then add in 1/2 cup peanuts, and broken pieces of peanut butter cups and combine well.</li><li>Fold in thawed whipped topping until well blended.</li><li>Pour the filling into the chilled crust and spread evenly.</li><li>Sprinkle the 3 tablespoons of peanuts, dark chocolate chips, and the reserved cookie crumbs on top.</li><li>Chill for at least another 90 minutes before serving.</li><li>Slice with a sharp knife to pierce through all the peanut butter chunks in the pie.</li></ol>","spoonacularId":653185,"ingredients":[],"createdAt":{"$date":"2024-10-01T14:32:56.345Z"},"__v":0}
{"_id":{"$oid":"66fc08181187fcc3e0739970"},"likes":0,"title":"chilli chicken","readyInMinutes":160,"servings":2,"image":"https://img.spoonacular.com/recipes/629963-556x370.jpg","instructions":"<p><a href=\"http://indianhealthyrecipes.com/chilli-chicken-dry-recipe-indo-chinese-style/\">Find Complete instructions on swasthi's recipes</a><strong><br></strong></p>","spoonacularId":629963,"ingredients":[],"createdAt":{"$date":"2024-10-01T14:32:56.363Z"},"__v":0}
{"_id":{"$oid":"66fc08181187fcc3e0739973"},"likes":0,"title":"Almond Torte With Cream & Cherries","readyInMinutes":45,"servings":27,"image":"https://img.spoonacular.com/recipes/632199-556x370.jpg","instructions":"<ol><li>For the torte: Whip the egg whites with the dash of salt until they form stiff peaks.</li><li>Whip in the honey and gently fold into the ground almonds and cardamom seeds.</li><li>Place mixture on well greased trays (or use baking paper). I like to divide the mixture into four on two trays.</li><li>Spread the mixture out to about a 3/4 of an inch thick and in a circle.</li><li>Bake at about 250 to 300 degrees F for around 15 minutes. Keep an eye on them and dont let them burn on the bottom.</li><li>For the cherry filling: I advise soaking the dates in boiling water for about 5 minutes and put them through a tami or puree them so any skins are removed.</li><li>Heat the cherries and water gently in a saucepan with the lid on until they are hot.</li><li>Remove the lid and add the dates and reduce the juices down.</li><li>Turn the heat off and cool slightly before adding the rose water.</li><li>To put the torte together: Whip fresh cream and add honey.</li><li>On one layer of torte add the cherries and then the cream.</li><li>Put another layer of torte and repeat.</li></ol>","spoonacularId":632199,"ingredients":[],"createdAt":{"$date":"2024-10-01T14:32:56.38Z"},"__v":0}
{"_id":{"$oid":"66fc104d692a31f4ead792e3"},"likes":0,"title":"Instant Pot Chili Mac","readyInMinutes":14,"servings":6,"image":"https://img.spoonacular.com/recipes/1165787-556x370.jpg","instructions":"Instructions\n\nTurn on the pressure cooker and place on sauté mode. Once heated, add the olive oil, onion, and bell pepper. Sauté for 3 minutes.\n\nAdd in the ground beef and continue to stir until the beef is thoroughly cooked.\n\nAdd in the seasonings. Stir.\n\nAdd crushed tomatoes and kidney beans and mix well.\n\nPour in chicken broth and macaroni noodles. Stir the mixture until well combined.\n\nHit the cancel button on the Instant Pot.\n\nSecurely place the lid on the pressure cooker and lock the lid in place. Set the vent to seal and start the manual cook time for 4 minutes.\n\nOnce the cooking time is finished, carefully place the valve to vent and allow the pressure pin to drop before unlocking the lid to the Instant Pot.\n\nRemove the lid and stir the chili mac recipe well. Mix in the cheese.\n\nAdd your favorite toppings and serve.","spoonacularId":1165787,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:07:57.536Z"},"__v":0}
{"_id":{"$oid":"66fc104d692a31f4ead792e6"},"likes":0,"title":"Soft Croatian corn bread - proja","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/660504-556x370.jpg","instructions":"<ol><li>Mix and combine eggs, salt, corn and wheat flour, instant polenta, baking powder, olive oil, and yogurt</li><li>Gradually add as much mineral water as needed to make a quite thin batter.</li><li>Mix in and combine cottage cheese.</li><li>Pour batter into the baking pan lightly greased with butter and bake in oven at 220C for about 30 minutes or until the proja - corn bread is baked (trick with a toothpick).</li></ol>","spoonacularId":660504,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:07:57.563Z"},"__v":0}
{"_id":{"$oid":"66fc104d692a31f4ead792e9"},"likes":0,"title":"Simple Protein Pancakes","readyInMinutes":20,"servings":5,"image":"https://img.spoonacular.com/recipes/1021260-556x370.jpg","instructions":"InstructionsGrab all of your ingredients and the Premier Protein powder and place them into a blender. Set the blender for a one minute blend to get all of the ingredients mixed well together.Once everything is blended well, set aside and allow the protein powder pancakes mixture thicken.Heat the skillet, and make sure to let the skillet get very hot before pouring the batter.Once the skillet is hot, start pouring small sized pancakes. Don't flip the pancakes until the batter has started forming small bubbles on the edges, and the edges start to turn a light golden brown. This should take approximately 2 minutes.Flip the pancakes over and allow them to cook thoroughly on the other side.After all of the pancakes are finished, top with your favorite toppings and a little maple syrup.","spoonacularId":1021260,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:07:57.575Z"},"__v":0}
{"_id":{"$oid":"66fc104d692a31f4ead792ec"},"likes":0,"title":"Butternut Squash Pizza","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/636593-556x370.jpg","instructions":"Preheat oven to highest internal temperature.\nCaramelize the onion by sauteing it over medium heat in oil for about 10-15 minutes on the stove top. Fry bacon while you roll out pizza dough.\nBreak up mozzarella and distribute over rolled out pizza dough\nAdd onion and chopped bacon\nAdd bite sized pieces of squash\nAdd mixed greens\nAdd pine nuts\nDrizzle balsamic reduction over everything\nSprinkle on manchego cheese (or alternative cheese)\nPop pizzas in oven (my oven goes to 550 degrees and pizzas take about 5 minutes to cook to my liking.)\nBalsamic reduction: Boil 1 cup of balsamic vinegar in a small pot for a few minutes until it is reduced by half and thickened.","spoonacularId":636593,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:07:57.593Z"},"__v":0}
{"_id":{"$oid":"66fc137f9dfdd90a1d199ca7"},"likes":0,"title":"Cottage pie with Quorn mince","readyInMinutes":45,"servings":3,"image":"https://img.spoonacular.com/recipes/640185-556x370.jpg","instructions":"Add the stock cube to 200 ml of boiling water and keep aside to dissolve.\nBring a saucepan of water to a boil. Add the potatoes and cook until tender - around  15 to 20 minutes. Drain the potatoes, remove in the saucepan and mash till smooth. Add the butter, parsley and milk, mixing thoroughly. (Add more milk if required)\nPreheat the oven to 200 C. In a large frying pan, heat a tablespoon of oil. Add the onion, carrots, garlic, green chillies and the bay leaf and fry for 4-5 minutes on medium heat. Add the frozen Quorn mince  and the cumin powder and cook for further 5 minutes. Then add in the tomatoes, chopped rosemary and stock. Bring to a boil and turn off the heat.\nRemove the bay leaf and transfer the Quorn mince to an oven proof dish in a single layer. Add the mashed potatoes on the top, covering the quorn mince and fluff the mash layer with a fork. Lightly brush the surface with a beaten egg. Cook in the oven for 20-25 minutes.\n* You can also add a layer of grated cheese on top of the potatoes. Skip the egg if using cheese.","spoonacularId":640185,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:21:35.683Z"},"__v":0}
{"_id":{"$oid":"66fc137f9dfdd90a1d199caa"},"likes":0,"title":"Apple Walnut Brownies","readyInMinutes":75,"servings":10,"image":"https://img.spoonacular.com/recipes/632611-556x370.jpg","instructions":"<ol><li>Preheat oven to 160C/320F. Line a rectangle cake pan.</li><li>Combine butter and chopped baking chocolate over low heat until melted. Remove from heat and set aside to cool.</li><li>Place eggs. brown sugar, and vanilla extract in a mixing bowl and beat till fluffy and add in the melted butter chocolate mixture, stir till well combined.</li><li>Add self rising flour, cinnamon, walnuts, and green apple, mix well and pour into prepared cake pan.</li><li>Bake in preheated oven for 40 to 45 minutes and leave cake to cool. Best to chill for at least one hour for easy spreading of the ganache cream.</li><li>To make the chocolate ganache: bring the cream to just a boil over medium-high heat.</li><li>Add in the semi-sweet chocolate pieces and blend well till chocolate melts. </li><li>Whisk until creamy.</li><li>Let cool and spread onto cake.</li></ol>","spoonacularId":632611,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:21:35.714Z"},"__v":0}
{"_id":{"$oid":"66fc137f9dfdd90a1d199cad"},"likes":0,"title":"Easy Shepherd's Pie (Beef And/or Lamb Combo)","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/642091-556x370.jpg","instructions":"<ol><li>Boil potatoes in salted water until tender, about 12 minutes. Drain potatoes and pour them into a bowl.</li><li>Combine cream cheese (or sour cream), egg yolk and milk (or heavy cream). Add the cream mixture into potatoes and mash until potatoes are almost smooth.</li><li>While potatoes boil, preheat a large skillet over medium high heat. Add oil to hot pan with beef and/or lamb.</li><li>Season meat with salt and pepper. Brown and crumble meat for 3 or 4 minutes. If you are using lamb and the pan is fatty, spoon away some of the drippings.</li><li>Add chopped carrot* and onion to the meat. Cook veggies with meat 5 minutes, stirring frequently.</li><li>NOTE:*by finely chopping the carrots, they will cook a little faster.</li><li>Add the thyme.</li><li>OPTIONAL Add the tomato paste, which gives the meat filling a richer flavor.</li><li>In a second small skillet over medium heat cook butter and flour together 2 minutes. Whisk in broth and Worcestershire sauce. Thicken gravy 1 minute. Add gravy to meat and vegetables. Stir in peas.</li><li>Preheat broiler to high.</li><li>Fill a small rectangular casserole with meat and vegetable mixture. Spoon potatoes over meat evenly.</li><li>Top potatoes with paprika and broil 6 to 8 inches from the heat until potatoes are evenly browned. Top casserole dish with chopped parsley and serve</li></ol>","spoonacularId":642091,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:21:35.725Z"},"__v":0}
{"_id":{"$oid":"66fc137f9dfdd90a1d199cb0"},"likes":0,"title":"Persian Rhubarb Stew (Khoresh Rivas)","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/655771-556x370.jpg","instructions":"<ol><li>In a pan, heat 2-3 tablespoons of oil and saute chopped onions until translucent. Add turmeric, stir, add the meat and brown on all sides. Add salt and pepper to taste. Pour enough water to cover the meat. Cover and cook for an hour on medium to low heat, longer if it is not yet tender.</li><li>In a medium-sized frying pan, saute the chopped parsley and mint together in 2 tablespoons of oil over medium heat.Combine the parsley and mint mixture with the meat sauce half way through the cooking. Add water if necessary.</li><li>Lightly saute sliced rhubarbs in 2 tablespoons of olive oil for 2-3 minutes on medium heat. Add the rhubarb to the pot, lower the heat to a gentle simmer and cook for an additional 15 minutes.</li><li>Taste and add 2-3 tablespoons of sugar or to taste, gently stir and cook for an additional 5 minutes.</li><li>Serve warm with basmati rice.</li></ol>","spoonacularId":655771,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:21:35.747Z"},"__v":0}
{"_id":{"$oid":"66fc13fd8607d80d3ec4ecae"},"likes":0,"title":"Seared Scallops With Wilted Greens","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/659679-556x370.jpg","instructions":"<ol><li>Slice the kale stems into thin pieces and the leaves into larger strips. Heat a large, deep pan to medium-high.</li><li>Add the bacon a cook 3-4 minutes.  Then add the shallots and cook until soft3 more minutes.</li><li>Next add the garlic, and kale STEMS.</li><li>Cook another 4-5 minutes before adding the leaves.  Toss until wilted over the heat. Add the soy sauce, vinegar, then salt and pepper to taste.  Keep warm.</li><li>Heat an iron skillet to high.  Dry the scallops thoroughly, then salt and pepper.</li><li>Add the oil to the pan and swirl around.  When it starts to smoke, quickly add the scallops.</li><li>Cook on high for about 1-2 minutes.</li><li>Flip the scallops and add the butter.  Spoon the butter over the scallops as they cook another 1-2 minutes. Serve over warm greens.</li></ol>","spoonacularId":659679,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:23:41.289Z"},"__v":0}
{"_id":{"$oid":"66fc13fd8607d80d3ec4ecb1"},"likes":0,"title":"Authentic Mexican Wedding Cookies","readyInMinutes":45,"servings":48,"image":"https://img.spoonacular.com/recipes/633082-556x370.jpg","instructions":"Beat butter in large bowl in an electric mixer until light and fluffy.\nAdd 1/2 cup powdered sugar and vanilla; beat until well blended.\nBeat in flour, then pecans. Divide dough in half; form each half into ball. Wrap in plastic and chill for about 30 minutes.\nPreheat oven to 350F. Whisk remaining 1 1/2 cups powdered sugar and cinnamon in pie dish to blend. Set cinnamon sugar aside.\nWorking with half of chilled dough, roll dough by 2 teaspoonfuls between palms into balls. Arrange balls on heavy large baking sheet, spacing 1/2 inch apart.\nBake cookies for 18 minutes or until golden brown on bottom and just pale golden on top. Cool cookies 5 minutes on baking sheet.\nGently toss warm cookies in cinnamon sugar to coat completely. Transfer coated cookies to rack and cool completely. Repeat with other half of the dough.\nSift remaining cinnamon sugar over cookies and serve.","spoonacularId":633082,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:23:41.313Z"},"__v":0}
{"_id":{"$oid":"66fc13fd8607d80d3ec4ecb4"},"likes":0,"title":"Blackberry Cobbler","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/635200-556x370.jpg","instructions":"<ol><li>Preheat the oven to 375.</li><li>In a bowl, add the blackberries and the sugar together.  Let the berries macerate or if you are like me, you wait until it's halfway done. lol I couldn't wait any longer.</li><li>In a larger bowl, mix the flour, baking powder, salt and milk. Now add the melted butter and mix until it's well blended.</li><li>Now pour the batter into a ungreased baking dish (next time I'll be greasing it). Now spoon the berries on top of the batter.</li><li>Bake in the oven for 45-55 minutes. Serve warm with whip cream or some ice cream.  This lasted for about 15 minutes in my house. Yes, it was yummy. 'Nuff said.</li></ol>","spoonacularId":635200,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:23:41.33Z"},"__v":0}
{"_id":{"$oid":"66fc13fd8607d80d3ec4ecb7"},"likes":0,"title":"Donkatsu - Korean Breaded Pork Cutlet","readyInMinutes":30,"servings":4,"image":"https://img.spoonacular.com/recipes/641565-556x370.jpg","instructions":"<ol><li>Trim off fat from pork chops (usually on the sides), then pound into thin pieces with tenderizer. Season with salt and pepper.</li><li>Coat pork with flour, then beaten egg, and lastly panko bread crumbs.</li><li>Heat vegetable oil in pan or skillet on medium heat.</li><li>Fry until golden brown and cooked through (you can cut to check insides). Usually takes about 8-10 minutes total if fully submerged in oil.</li><li>Remove cutlets from the oil and drain on paper towel to remove excess oil and cool.</li><li>Drain shredded cabbage well. Cut each cutlet into small pieces and serve on plate with cabbage slaw.</li><li>Serve with katsu sauce for dipping and serve with rice.</li></ol>","spoonacularId":641565,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:23:41.349Z"},"__v":0}
{"_id":{"$oid":"66fc13fd8607d80d3ec4ecba"},"likes":0,"title":"Strawberry Banana Stuffed Pancakes","readyInMinutes":30,"servings":2,"image":"https://img.spoonacular.com/recipes/661758-556x370.jpg","instructions":"<ol><li>Mix together the Greek yogurt, 1/4 cup banana, egg whites, and vanilla extract into a small bowl.</li><li>In a separate bowl combine flour, baking soda, 1/2 teaspoon sugar, and salt.</li><li>Combine both bowls and whisk until evenly mixed.</li><li>Fold in 5 fresh, chopped strawberries.</li><li>Place 1/4-cup batter onto a non-stick skillet over medium heat and cook until bubbles start appearing through the top of the pancake. Flip (about 2 minutes on each side).</li><li>For the sauce: Add 1/4 cup mashed banana, 5 frozen strawberries, and 1 teaspoon of sugar in a sauce pan (if you use fresh strawberries, add 1 tablespoon of water to the sauce pan). Cook on low, stirring frequently until thickened (about 5-7 minutes.)</li><li>Evenly divide sauce over top of pancakes</li></ol>","spoonacularId":661758,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:23:41.366Z"},"__v":0}
{"_id":{"$oid":"66fc144200988e0f7ea670ee"},"likes":0,"title":"Swiss Chard and Mushroom Popover Bake","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/662668-556x370.jpg","instructions":"<ol><li>Preheat your oven to 425 degrees F.</li><li>Add the olive oil to a large skillet over medium heat. When hot, add the onion and mushrooms and cook, stirring, until soft. Add the Swiss chard, garlic, and seasonings, and mix well for a few minutes (be careful not to burn the garlic).</li><li>Remove the mixture from the heat and cover it.</li><li>Spray an 8-inch square baking dish (you could also use a pie plate) with the nonstick cooking spray. Add the margarine and place the dish in the oven until the margarine melts, then remove it from the oven.</li><li>In a medium bowl, whisk together the garbanzo bean flour, milk and eggs.</li><li>Pour the flour mixture into the baking dish and bake for 12-14 minutes, or until it becomes puffy and lightly browns.</li><li>Spoon the Swiss chard mixture to the crust and sprinkle the Provolone cheese over the top. Bake for about 10 minutes, or until the cheese has melted.</li></ol>","spoonacularId":662668,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:24:50.167Z"},"__v":0}
{"_id":{"$oid":"66fc144200988e0f7ea670f1"},"likes":0,"title":"Penne Arrabiata","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/655573-556x370.jpg","instructions":"<ol><li>Bring a large pot of water to a boil. Saute about 1 teaspoon of dried red pepper in a 3 tbsp. olive oil. Add 5 cloves fresh minced garlic, 2 tbsp.</li><li>Fresh Italian parsley, minced.</li><li>When these ingredients are not, but not smoking, add 1 can tomatoes, chopped. (I like Pomi tomatoes which comes in a box). Stir, cover and cook untilthe sauce i heated. Cook the Penne in salted boiling water. Cook until al dante. Drain and add to sauce. Mix throughly Just before serving, add some coarsely chopped fresh basil and a little more parsley. Serve immediately.</li></ol>","spoonacularId":655573,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:24:50.192Z"},"__v":0}
{"_id":{"$oid":"66fc144200988e0f7ea670f4"},"likes":0,"title":"Trinidadian Chicken Potato Curry","readyInMinutes":150,"servings":4,"image":"https://img.spoonacular.com/recipes/663824-556x370.jpg","instructions":"<p>Wash and pat dry chicken thighs. In a sealable container, combine all marinade ingredients. Toss chicken in marinade, cover and refrigerate for at least 2 hours.</p><p>In a Dutch oven, heat vegetable oil over medium high heat. Add onions and saut until tender. Add garlic and continue to saut until fragrant.</p><p>Sprinkle onions and garlic with curry powder and stir to evenly coat. Add 1 tablespoon of water and cook for one minute, stirring constantly.</p><p>Add chicken and marinade. Saut until lightly browned, about 5 minutes.</p><p>If you want a thick curry add potatoes now, otherwise set aside.</p><p>Sprinkle chicken with amchar masala, cumin and salt. Toss to coat. Pour in one cup of water and bring to a boil.</p><p>Reduce heat, cover pot and simmer for 20 minutes. If you reserved the potatoes for a thinner curry, add them to the pot after twenty minutes.</p><p>Continue to simmer for an additional twenty minutes until chicken reaches an internal temperature of 165 F and potatoes are cooked through.</p><p>Serve warm with roti or rice.</p>","spoonacularId":663824,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:24:50.209Z"},"__v":0}
{"_id":{"$oid":"66fc15d000988e0f7ea670f7"},"likes":0,"title":"Cocoa Protein Pancakes","readyInMinutes":15,"servings":2,"image":"https://img.spoonacular.com/recipes/157259-556x370.jpg","instructions":"<p><strong>1.</strong> Blend the rolled oats in a blender or food processor until you have a fine powder. Mix in the cocoa powder.<br></p><p> <strong>2.</strong> Blend the ground oats/cocoa powder with the cottage cheese (or quark, if you can find it) and eggs.</p><p> <strong>3.</strong> Pour the thick batter into a hot, oiled skillet and use the back of a spoon to form round pancakes.</p><p> <strong>4</strong>. Flip the pancakes once the sides are firm and turning brown.<strong>.</strong></p><p> <strong>5.  </strong>Serve with maple syrup.</p>","spoonacularId":157259,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:31:28.644Z"},"__v":0}
{"_id":{"$oid":"66fc15d000988e0f7ea670fa"},"likes":0,"title":"Fish Crocchette Appetizer","readyInMinutes":45,"servings":8,"image":"https://img.spoonacular.com/recipes/642927-556x370.jpg","instructions":"<ol><li>Begin to cook the fish and potatoes.</li><li>Cook cod in a saucepan.</li><li>Boil the potatoes in their skins in a pot with the water or in the microwave in a container with two inches of water (for the cooking time in the microwave, read the instruction booklet)</li><li>Let cool cod, eliminated any remaining bones. In a bowl add the mashed potatoes, the minced cod, the garlic cooked in the milk, tuna, drained, Parmesan, chopped parsley, salt , egg and the half lemon zest grated.</li><li>Mix well the mixture , form into balls to the same size if possible.</li><li>Coat in white flour, dip in beaten egg and into bread crumbs, fry in canola oil (325 degrees F) until golden , dry on paper towels.</li></ol>","spoonacularId":642927,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:31:28.849Z"},"__v":0}
{"_id":{"$oid":"66fc15d100988e0f7ea670fd"},"likes":0,"title":"Butternut Squash Souffle Side Dish","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/636598-556x370.jpg","instructions":"<ol><li>Puree butternut squash with blender and set aside to let cool.</li><li>In a small saucepan, heat cream, milk, nutmeg, cinnamon, ginger and vanilla to a simmer.</li><li>Meanwhile, in a separate bowl, whisk yolks and sugar until pale yellow.</li><li>Add a cup of the hot cream mixture very slowly into yolks while continuing to whisk.</li><li>Then add yolks and cream back to saucepan and keep stirring over low heat.</li><li>Mixture should thicken in a few minutes, then turn off heat and incorporate into squash puree.</li><li>Preheat oven to 375 degrees, making sure the rack is near the bottom.</li><li>Place a baking sheet in the oven.</li><li>Butter your ramekins and dust the insides and rims with sugar.</li><li>Then take egg whites in a clean bowl and whisk until glossy. It should form stiff peaks when you remove your whisk from the bowl, and should be able to hold the weight of an egg.</li><li>Use a spatula to combine the egg whites scoop by scoop into the squash mixture, making sure they form a fully homogeneous mixture, but do not overmix.</li><li>Carefully scoop your mixture into the ramekins up to the rims.</li><li>Bake on lower rack for about 25 minutes, or until tops are golden brown.</li><li>They should rise, but with firm tops and jiggly centers.</li></ol>","spoonacularId":636598,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:31:29.048Z"},"__v":0}
{"_id":{"$oid":"66fc15d100988e0f7ea67100"},"likes":0,"title":"Authentic Italian Biscotti","readyInMinutes":45,"servings":60,"image":"https://img.spoonacular.com/recipes/633078-556x370.jpg","instructions":"<ol><li>Preheat oven to 350 degrees. Line 2 baking sheets with parchment paper.</li><li>Sift together flour, sugar, baking powder, baking soda, and salt. Add 2 whole eggs and 1 egg yolk, almond extract, and almonds. Mix thoroughly until dough holds together. Add half of reserved egg white, if necessary, to make a cohesive dough.</li><li>With wet hands, shape dough into 4 logs, each 6 long and 1  in diameter. Place 3-4 apart on baking sheets. Bake on middle rack of oven until logs are light golden brown and spring back when touched (about 24 minutes). Cool 15 minutes.</li><li>Lower oven to 275. Slice logs with a serrated knife diagonally into 1/2 slices. Return to oven and bake until completely dry and crisp throughout (about 40 minutes). Cool.</li></ol>","spoonacularId":633078,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:31:29.249Z"},"__v":0}
{"_id":{"$oid":"66fc15d100988e0f7ea67103"},"likes":0,"title":"Rack of Lamb With Parsley","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/657710-556x370.jpg","instructions":"1. Preheat the oven to 400.\n2. Brush the rack with oil, and sprinkle it with salt and pepper. Put the rack in a roasting pan, and roast it in the preheated oven for 12 minutes\n3. remove the meat from the oven, and coat it with the mustard\n4. lower the oven temperature to 350\n5. Combine the bread crumbs, parsley, shallot, garlic, thyme and melted butter. Spread this mixture over the top of the rack. Put the rack in the 350 oven, and roast for another 15 minutes.\n6. Remove the rack from the oven, and let it rest for 10 minutes before carving it into chops. The lamb will medium rare.","spoonacularId":657710,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:31:29.454Z"},"__v":0}
{"_id":{"$oid":"66fc161100988e0f7ea67106"},"likes":0,"title":"Appetizing Apple and Almond Soup","readyInMinutes":45,"servings":4,"image":"https://img.spoonacular.com/recipes/632449-556x370.jpg","instructions":"<ol><li>Wash and rinse the apples thoroughly. Cut the apples (with their skin) as well as the gooseberry, tomatoes, and carrots roughly into chunks. Soak almonds in warm water and peel off the skin.</li><li>In a deep bottomed pan or pressure cooker, boil 3 cups of water.</li><li>Add chopped fruits, veggies, almonds. Let it simmer or pressure cook until 4 whistles.</li><li>Puree the boiled veggies/fruits in a mixer until smooth.</li><li>Sieve the soup if desired.</li><li>Season with salt and sugar to taste.</li><li>To make the soup creamier, add cream to the soup and simmer for another 5 minutes.</li></ol>","spoonacularId":632449,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:32:33.943Z"},"__v":0}
{"_id":{"$oid":"66fc161100988e0f7ea67109"},"likes":0,"title":"Slow Cooker: Pork and Garbanzo Beans","readyInMinutes":45,"servings":6,"image":"https://img.spoonacular.com/recipes/660306-556x370.jpg","instructions":"<ol><li>In slow cooker layer in this order: pork, then garbanzo beans, onion, pour water over all. Mix spices together and sprinkle over pork and beans. Cover. Set on low and cook for approximately 6 hours. The beans should be tender and creamy. The pork should fall very easily from the bone. The pork can be either shredded for cubed for your preference. *3</li><li>Serving Suggestion: Scoop about 1 cup of beans with broth into a soup bowl. Top with shredded pork. Add 1/4 of an avocado sliced, top with chopped fresh cilantro.</li><li>NOTES:</li><li>*1 The beans do not need to be soaked before adding to the slow cooker. They will be perfectly soft and creamy without pre-soaking.</li><li>*2 Substitute the water for: 2 cups water and 1 bottle of good quality dark beer like Negra Modelo. You can also substitute the water for chicken stock or pork stock. Each of these substitutions will add an extra dimension of flavor.</li><li>*3 If you want to shred the pork, it is easiest to do when the pork is hot. Use two forks to pull the pork apart and shred. If you want to slice the pork (like for sandwiches) it is best to do when the pork is cold. Let the pork rest in the refrigerator for several hours or over night. Slice with a serrated knife or a very sharp chef knife.</li></ol>","spoonacularId":660306,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:32:33.973Z"},"__v":0}
{"_id":{"$oid":"66fc161100988e0f7ea6710d"},"likes":0,"title":"Chicken Parmesan Patty- Eat As A Burger OR On Pasta","readyInMinutes":45,"servings":3,"image":"https://img.spoonacular.com/recipes/801377-556x370.jpg","instructions":"Preheat oven to 400Combine groundchicken, egg, 1/2 cup bread crumbs, seasonings and half of the chopped onion in a bowl. Shape into 6-8 patties.Coat in more bread crumbs. Place on sheet pan. Drizzle with Olive oil.Bake for 20 minutes or until internal temperature reaches 165.Starting the sauce:Add water, tomato paste, dates and sun dried tomato to a sauce pan over medium heat. Stir until fully combined.Bring to a boil. When the sauce starts to boil, reduce to simmer.Add tomatoes, fresh herbs and seasonings. Simmer while chicken finishes.Serve over whole wheat pasta OR as a burger!","spoonacularId":801377,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:32:33.995Z"},"__v":0}
{"_id":{"$oid":"66fc161200988e0f7ea67110"},"likes":0,"title":"Asparagus Eggs Benedict","readyInMinutes":30,"servings":2,"image":"https://img.spoonacular.com/recipes/632928-556x370.jpg","instructions":"<ol><li>Fill a medium saucepan or wide deep skillet 3/4 full with hot tap water.</li><li>Bring to a boil over high heat. Reduce heat to maintain a gentle boil. Trim off and discard woody ends of asparagus. Place asparagus in shallow microwave-safe casserole dish, cover with vented plastic wrap, and cook at HIGH power 1-1/2 to 2-1/2 minutes or until asparagus are crisp-tender.</li><li>Cover tightly; set aside in a warm place.</li><li>Break whole eggs, one at a time, into a small dish. Slip eggs into simmering water. Cook about 3 minutes for soft-set eggs or until cooked as desired.</li><li>While eggs are cooking, place egg yolks in blender container. Add lemon juice, salt and cayenne pepper. Place butter in microwave-safe measuring cup and cook at HIGH power until melted and bubbly, about 1 to 1-1/2 minutes.</li><li>With blender running, pour hot butter in a stream through the hole in the lid. Blend 30 seconds or until sauce has thickened.</li><li>Split and toast English muffins. Place warmed ham on each muffin half and top with about 3 asparagus. Using a slotted spoon, place poached eggs over asparagus. Spoon sauce over eggs.</li></ol>","spoonacularId":632928,"ingredients":[],"createdAt":{"$date":"2024-10-01T15:32:34.018Z"},"__v":0}
